import { m as mergeLocales } from "./index-OqF_uRM0.js";
const locale$d = { design: {
  Confirm: {
    cancel: "отмена",
    confirm: "ок"
  },
  CascaderList: { empty: "Нет" },
  Select: { empty: "Нет" },
  Calendar: {
    year: "",
    weekDays: [
      "Вс",
      "Пн",
      "Вт",
      "Ср",
      "Чт",
      "Пт",
      "Сб"
    ],
    months: [
      "Январь",
      "Февраль",
      "Март",
      "Апрель",
      "Май",
      "Июнь",
      "Июль",
      "Август",
      "Сентябрь",
      "Октябрь",
      "Ноябрь",
      "Декабрь"
    ]
  },
  ColorPicker: {
    more: "Больше цветов",
    cancel: "отмена",
    confirm: "ок"
  },
  GradientColorPicker: {
    linear: "линейный",
    radial: "радиальный",
    angular: "угловой",
    diamond: "ромбовидный",
    offset: "смещение",
    angle: "угол",
    flip: "перевернуть",
    delete: "удалить"
  }
} };
const locale$c = { "docs-ui": {
  toolbar: {
    undo: "Отменить",
    redo: "Повторить",
    font: "Шрифт",
    fontSize: "Размер шрифта",
    bold: "Полужирный",
    italic: "Курсив",
    strikethrough: "Зачеркнутый",
    subscript: "Нижний индекс",
    superscript: "Верхний индекс",
    underline: "Подчеркнутый",
    textColor: { main: "Цвет текста" },
    fillColor: { main: "Цвет фона текста" },
    table: {
      main: "Таблица",
      insert: "Добавить таблицу",
      colCount: "Количество столбцов",
      rowCount: "Количество строк"
    },
    resetColor: "Сбросить",
    order: "Упорядоченный список",
    unorder: "Неупорядоченный список",
    checklist: "Список задач",
    documentFlavor: "Современный режим",
    alignLeft: "Выровнять по левому краю",
    alignCenter: "Выровнять по центру",
    alignRight: "Выровнять по правому краю",
    alignJustify: "Выровнять по ширине",
    horizontalLine: "Горизонтальная линия",
    headerFooter: "Верхние и нижние колонтитулы",
    pageSetup: "Настройки страницы"
  },
  table: {
    insert: "Вставить",
    insertRowAbove: "Вставить строку выше",
    insertRowBelow: "Вставить строку ниже",
    insertColumnLeft: "Вставить столбец слева",
    insertColumnRight: "Вставить столбец справа",
    delete: "Удалить таблицу",
    deleteRows: "Удалить строку",
    deleteColumns: "Удалить столбец",
    deleteTable: "Удалить таблицу"
  },
  headerFooter: {
    header: "Верхний колонтитул",
    footer: "Нижний колонтитул",
    panel: "Настройки верхнего и нижнего колонтитулов",
    firstPageCheckBox: "Особенная первая страница",
    oddEvenCheckBox: "Разные четные и нечетные страницы",
    headerTopMargin: "Верхнее поле верхнего колонтитула (px)",
    footerBottomMargin: "Нижнее поле нижнего колонтитула (px)",
    closeHeaderFooter: "Закрыть верхний и нижний колонтитулы",
    disableText: "Настройки верхнего и нижнего колонтитулов отключены"
  },
  doc: {
    menu: { paragraphSetting: "Настройка абзаца" },
    slider: { paragraphSetting: "Настройка абзаца" },
    paragraphSetting: {
      alignment: "Выравнивание",
      indentation: "Отступ",
      left: "Левый",
      right: "Правый",
      firstLine: "Первая строка",
      hanging: "Висит",
      spacing: "Расстояние",
      before: "До",
      after: "После",
      lineSpace: "Высота строки",
      multiSpace: "Двойной отступ",
      fixedValue: "Фиксированное значение (px)"
    }
  },
  rightClick: {
    copy: "Копировать",
    cut: "Вырезать",
    paste: "Вставить",
    delete: "Удалить",
    bulletList: "Неупорядоченный список",
    orderList: "Упорядоченный список",
    checkList: "Список задач",
    insertBellow: "Вставить ниже"
  },
  "page-settings": {
    "document-setting": "Настройки документа",
    mode: "Режим",
    "modern-mode": "Современный",
    "classic-mode": "Классический",
    "modern-width": "Ширина содержимого",
    "modern-width-narrow": "Узкая",
    "modern-width-medium": "Средняя",
    "modern-width-wide": "Широкая",
    "page-size": {
      main: "Размер бумаги",
      a4: "A4",
      a3: "A3",
      a5: "A5",
      b4: "B4",
      b5: "B5",
      letter: "Американский формат",
      legal: "Юридический формат",
      tabloid: "Таблоидный формат",
      statement: "Формат заявления",
      executive: "Исполнительный формат",
      folio: "Формат фолио"
    },
    "paper-size": "Размер бумаги",
    orientation: "Ориентация",
    portrait: "Книжная",
    landscape: "Альбомная",
    "custom-paper-size": "Пользовательский размер бумаги",
    top: "Верх",
    bottom: "Низ",
    left: "Слева",
    right: "Справа",
    cancel: "Отмена",
    confirm: "Подтвердить"
  }
} };
const locale$b = { sheets: {
  tabs: {
    sheetCopy: "(Копия{0})",
    sheet: "Лист"
  },
  info: {
    overlappingSelections: "Невозможно использовать эту команду на пересекающихся выделениях",
    acrossMergedCell: "Через объединенную ячейку",
    partOfCell: "Выделена только часть объединенной ячейки",
    hideSheet: "После скрытия этого листа не будет видно ни одного листа"
  },
  definedName: {
    nameEmpty: "Имя не может быть пустым",
    nameDuplicate: "Имя уже существует",
    nameInvalid: "Недопустимое имя",
    nameSheetConflict: "Имя конфликтует с именем листа",
    formulaOrRefStringEmpty: "Формула или ссылочная строка не может быть пустой",
    nameConflict: "Имя конфликтует с именем функции",
    defaultName: "ОпределенноеИмя"
  },
  permission: { dialog: {
    autoFillErr: "Диапазон защищен, и у вас нет разрешения на автозаполнение. Для использования автозаполнения свяжитесь с создателем.",
    editErr: "Диапазон защищен, и у вас нет разрешения на редактирование. Для редактирования свяжитесь с создателем.",
    formulaErr: "Диапазон или ссылочный диапазон защищен, и у вас нет разрешения на редактирование. Для редактирования свяжитесь с создателем.",
    insertOrDeleteMoveRangeErr: "Вставленный или удаленный диапазон пересекается с защищенным диапазоном, и эта операция в настоящее время не поддерживается.",
    insertRowColErr: "Диапазон защищен, и у вас нет разрешения на вставку строк и столбцов. Для вставки строк и столбцов свяжитесь с создателем.",
    moveRangeErr: "Диапазон защищен, и у вас нет разрешения на перемещение выделения. Для перемещения выделения свяжитесь с создателем.",
    moveRowColErr: "Диапазон защищен, и у вас нет разрешения на перемещение строк и столбцов. Для перемещения строк и столбцов свяжитесь с создателем.",
    operatorSheetErr: "Лист защищен, и у вас нет разрешения на операции с листом. Для операций с листом свяжитесь с создателем.",
    removeRowColErr: "Диапазон защищен, и у вас нет разрешения на удаление строк и столбцов. Для удаления строк и столбцов свяжитесь с создателем.",
    setRowColStyleErr: "Диапазон защищен, и у вас нет разрешения на установку стилей строк и столбцов. Для установки стилей строк и столбцов свяжитесь с создателем.",
    setStyleErr: "Диапазон защищен, и у вас нет разрешения на установку стилей. Для установки стилей свяжитесь с создателем."
  } },
  autoFill: {
    copy: "Копировать ячейку",
    series: "Заполнить ряд",
    formatOnly: "Только формат",
    noFormat: "Без формата"
  },
  merge: { confirm: {
    title: "Продолжение объединения сохранит только значение верхней левой ячейки, остальные значения будут удалены. Вы уверены, что хотите продолжить?",
    cancel: "Отменить объединение",
    confirm: "Продолжить объединение",
    warning: "Предупреждение",
    dismantleMergeCellWarning: "Это приведет к разделению некоторых объединенных ячеек. Вы хотите продолжить?"
  } }
} };
const locale$16 = {
  ARRAY_CONSTRAIN: {
    description: "Задает размер массива, в который будут помещены результаты",
    abstract: "Задает размер массива, в который будут помещены результаты",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/3267036?hl=ru&sjid=8484774178571403392-AP"
    }],
    functionParameter: {
      inputRange: {
        name: "массив",
        detail: "Диапазон для ограничения."
      },
      numRows: {
        name: "количество строк",
        detail: "Количество строк, которое должен содержать результат."
      },
      numCols: {
        name: "количество столбцов",
        detail: "Количество столбцов, которое должен содержать результат."
      }
    }
  },
  FLATTEN: {
    description: "Объединяет все значения из одного или нескольких диапазонов в один столбец",
    abstract: "Объединяет все значения из одного или нескольких диапазонов в один столбец",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/10307761?hl=ru&sjid=17375453483079636084-AP"
    }],
    functionParameter: {
      range1: {
        name: "диапазон1",
        detail: "Первый диапазон, который необходимо выровнять."
      },
      range2: {
        name: "диапазон2",
        detail: "Дополнительные диапазоны, которые необходимо выровнять."
      }
    }
  }
};
const locale$15 = {
  BETADIST: {
    description: "Возвращает интегральную функцию плотности бета-вероятности",
    abstract: "Возвращает интегральную функцию плотности бета-вероятности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%82%D0%B0%D1%80%D0%B0%D1%81%D0%BF-49f1b9a9-a5da-470f-8077-5f1730b5fd47"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение в интервале между A и B, для которого вычисляется функция."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      A: {
        name: "A",
        detail: "Нижняя граница интервала изменения x."
      },
      B: {
        name: "B",
        detail: "Верхняя граница интервала изменения x."
      }
    }
  },
  BETAINV: {
    description: "Возвращает обратную интегральную функцию плотности бета-вeроятности указанного бета-распределения",
    abstract: "Возвращает обратную интегральную функцию плотности бета-вeроятности указанного бета-распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%82%D0%B0%D0%BE%D0%B1%D1%80-8b914ade-b902-43c1-ac9c-c05c54f10d6c"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с бета-распределением."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      A: {
        name: "A",
        detail: "Нижняя граница интервала изменения x."
      },
      B: {
        name: "B",
        detail: "Верхняя граница интервала изменения x."
      }
    }
  },
  BINOMDIST: {
    description: "Возвращает отдельное значение биномиального распределения",
    abstract: "Возвращает отдельное значение биномиального распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC%D1%80%D0%B0%D1%81%D0%BF-506a663e-c4ca-428d-b9a8-05583d68789c"
    }],
    functionParameter: {
      numberS: {
        name: "число успехов",
        detail: "Количество успешных испытаний."
      },
      trials: {
        name: "число испытаний",
        detail: "Количество независимых испытаний."
      },
      probabilityS: {
        name: "вероятность успеха ",
        detail: "Вероятность успеха каждого испытания. "
      },
      cumulative: {
        name: "накопительная",
        detail: "Логическое значение, определяющее форму функции. Если кумулятив имеет значение TRUE, функция BINOMDIST возвращает функцию накопительного распределения, которая является вероятностью наличия не более числа успехов. Если значение FALSE, возвращается функция вероятностной массы, то есть вероятность числа успехов."
      }
    }
  },
  CHIDIST: {
    description: "Возвращает правостороннюю вероятность распределения хи-квадрат",
    abstract: "Возвращает правостороннюю вероятность распределения хи-квадрат",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82%D1%80%D0%B0%D1%81%D0%BF-c90d0fbc-5b56-4f5f-ab57-34af1bf6897e"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      degFreedom: {
        name: "степени свободы",
        detail: "Число степеней свободы."
      }
    }
  },
  CHIINV: {
    description: "Возвращает значение, обратное правосторонней вероятности распределения хи-квадрат",
    abstract: "Возвращает значение, обратное правосторонней вероятности распределения хи-квадрат",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82%D0%BE%D0%B1%D1%80-cfbea3f6-6e4f-40c9-a87f-20472e0512af"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: " Вероятность, связанная с распределением хи-квадрат."
      },
      degFreedom: {
        name: "степени свободы",
        detail: "Число степеней свободы."
      }
    }
  },
  CHITEST: {
    description: "Возвращает критерий независимости",
    abstract: "Возвращает критерий независимости",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82%D1%82%D0%B5%D1%81%D1%82-981ff871-b694-4134-848e-38ec704577ac"
    }],
    functionParameter: {
      actualRange: {
        name: "фактический интервал ",
        detail: "Интервал данных, который содержит результаты наблюдений, подлежащие сравнению с ожидаемыми значениями."
      },
      expectedRange: {
        name: "ожидаемый интервал ",
        detail: "Интервал данных, который содержит отношение произведений итогов по строкам и столбцам к общему итогу."
      }
    }
  },
  CONFIDENCE: {
    description: "Возвращает доверительный интервал для среднего генеральной совокупности с нормальным распределением",
    abstract: "Возвращает доверительный интервал для среднего генеральной совокупности с нормальным распределением",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D0%B2%D0%B5%D1%80%D0%B8%D1%82-75ccc007-f77c-4343-bc14-673642091ad6"
    }],
    functionParameter: {
      alpha: {
        name: "альфа",
        detail: 'Уровень значимости, используемый для вычисления доверительного уровня. Доверительный уровень равен 100*(1 - альфа) процентам или, иными словами, значение аргумента "альфа", равное 0,05, означает 95-процентный доверительный уровень.'
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение генеральной совокупности для диапазона данных, предполагается известным."
      },
      size: {
        name: "размер",
        detail: "Размер выборки."
      }
    }
  },
  COVAR: {
    description: "Возвращает ковариацию, т. е. среднее произведений отклонений для каждой пары точек в двух наборах данных.",
    abstract: "Возвращает ковариацию",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D0%B2%D0%B0%D1%80-50479552-2c03-4daf-bd71-a5ab88b2db03"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Первый диапазон ячеек с целыми числами."
      },
      array2: {
        name: "массив2",
        detail: " Второй диапазон ячеек с целыми числами."
      }
    }
  },
  CRITBINOM: {
    description: "Возвращает наименьшее значение, для которого интегральное биномиальное распределение больше или равно заданному критерию",
    abstract: "Возвращает наименьшее значение, для которого интегральное биномиальное распределение больше или равно заданному критерию",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D1%80%D0%B8%D1%82%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-eb6b871d-796b-4d21-b69b-e4350d5f407b"
    }],
    functionParameter: {
      trials: {
        name: "число испытаний",
        detail: "Число испытаний Бернулли."
      },
      probabilityS: {
        name: "вероятность успеха ",
        detail: "Вероятность успеха каждого испытания. "
      },
      alpha: {
        name: "альфа",
        detail: " Значение критерия."
      }
    }
  },
  EXPONDIST: {
    description: "Возвращает экспоненциальное распределение",
    abstract: "Возвращает экспоненциальное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%8D%D0%BA%D1%81%D0%BF%D1%80%D0%B0%D1%81%D0%BF-68ab45fd-cd6d-4887-9770-9357eb8ee06a"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      lambda: {
        name: "лямбла",
        detail: "Значение параметра."
      },
      cumulative: {
        name: "накопительная",
        detail: 'Логическое значение, определяющее форму экспоненциальной функции, которую следует использовать. Если аргумент "интегральная" имеет значение ИСТИНА, функция ЭКСПРАСП возвращает интегральную функцию распределения; если он имеет значение ЛОЖЬ, возвращается функция плотности распределения.'
      }
    }
  },
  FDIST: {
    description: "Возвращает правый хвост F-распределения вероятности для двух наборов данных",
    abstract: "Возвращает правый хвост F-распределения вероятности для двух наборов данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-f%D1%80%D0%B0%D1%81%D0%BF-ecf76fba-b3f1-4e7d-a57e-6a5b7460b786"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого вычисляется функция."
      },
      degFreedom1: {
        name: "степени свободы1",
        detail: "Числитель степеней свободы."
      },
      degFreedom2: {
        name: "степени свободы2",
        detail: "Знаменатель степеней свободы."
      }
    }
  },
  FINV: {
    description: "Возвращает значение, обратное (правостороннему) F-распределению вероятностей",
    abstract: "Возвращает значение, обратное (правостороннему) F-распределению вероятностей",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-f%D1%80%D0%B0%D1%81%D0%BF%D0%BE%D0%B1%D1%80-4d46c97c-c368-4852-bc15-41e8e31140b1"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с интегральным F-распределением."
      },
      degFreedom1: {
        name: "степени свободы1",
        detail: "Числитель степеней свободы."
      },
      degFreedom2: {
        name: "степени свободы2",
        detail: "Знаменатель степеней свободы."
      }
    }
  },
  FTEST: {
    description: "Возвращает результат F-теста",
    abstract: "Возвращает результат F-теста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D1%82%D0%B5%D1%81%D1%82-4c9e1202-53fe-428c-a737-976f6fc3f9fd"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Первый массив или диапазон данных."
      },
      array2: {
        name: "массив2",
        detail: "Второй массив или диапазон данных."
      }
    }
  },
  GAMMADIST: {
    description: "Возвращает гамма-распределение",
    abstract: "Возвращает гамма-распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0%D1%80%D0%B0%D1%81%D0%BF-7327c94d-0f05-4511-83df-1dd7ed23e19e"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      cumulative: {
        name: "накопительная",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение ИСТИНА, функция ГАММАРАСП возвращает интегральную функцию распределения; если этот аргумент имеет значение ЛОЖЬ, возвращается функция плотности распределения вероятности.'
      }
    }
  },
  GAMMAINV: {
    description: "Возвращает обратное гамма-кумулятивное распределение",
    abstract: "Возвращает обратное гамма-кумулятивное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0%D0%BE%D0%B1%D1%80-06393558-37ab-47d0-aa63-432f99e7916d"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с гамма-распределением."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      }
    }
  },
  HYPGEOMDIST: {
    description: "Возвращает гипергеометрическое распределение",
    abstract: "Возвращает гипергеометрическое распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B8%D0%BF%D0%B5%D1%80%D0%B3%D0%B5%D0%BE%D0%BC%D0%B5%D1%82-23e37961-2871-4195-9629-d0b2c108a12e"
    }],
    functionParameter: {
      sampleS: {
        name: "число успехов в выборке",
        detail: "Количество успешных испытаний в выборке."
      },
      numberSample: {
        name: "размер выборки",
        detail: "Размер выборки."
      },
      populationS: {
        name: "число успехов в совокупности ",
        detail: "Количество успешных испытаний в генеральной совокупности."
      },
      numberPop: {
        name: "размер совокупности",
        detail: "Размер генеральной совокупности"
      },
      cumulative: {
        name: "накопительная",
        detail: "Логическое значение, определяющее вид функции. Если значение кумулятивного распределения равно TRUE, HYPGEOMDIST возвращает кумулятивную функцию распределения; если FALSE, функция возвращает функцию плотности вероятности."
      }
    }
  },
  LOGINV: {
    description: "Возвращает обратную функцию логнормального распределения",
    abstract: "Возвращает обратную функцию логнормального распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%BE%D0%B3%D0%BD%D0%BE%D1%80%D0%BC%D0%BE%D0%B1%D1%80-0bd7631a-2725-482b-afb4-de23df77acfe"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с логнормальным распределением."
      },
      mean: {
        name: "cреднее",
        detail: "Среднее ln(x)."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение ln(x)."
      }
    }
  },
  LOGNORMDIST: {
    description: "Возвращает интегральное логнормальное распределение",
    abstract: "Возвращает интегральное логнормальное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%BE%D0%B3%D0%BD%D0%BE%D1%80%D0%BC%D1%80%D0%B0%D1%81%D0%BF-f8d194cb-9ee3-4034-8c75-1bdb3884100b"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      mean: {
        name: "cреднее",
        detail: "Среднее ln(x)."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение ln(x)."
      },
      cumulative: {
        name: "накопительная",
        detail: "Логическое значение, определяющее форму функции. Если кумулятивная функция TRUE, LOGNORM.DIST возвращает кумулятивную функцию распределения; если FALSE, возвращает функцию плотности вероятности."
      }
    }
  },
  MODE: {
    description: "Возвращает наиболее часто встречающееся или повторяющееся значение в массиве или диапазоне данных",
    abstract: "Возвращает наиболее часто встречающееся или повторяющееся значение в массиве или диапазоне данных.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BE%D0%B4%D0%B0-e45192ce-9122-4980-82ed-4bdc34973120"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, для которого требуется вычислить моду."
      },
      number2: {
        name: "число2",
        detail: "От 1 до 255 числовых аргументов, для которых вычисляется мода. Вместо аргументов, разделенных точкой с запятой, можно воспользоваться массивом или ссылкой на массив."
      }
    }
  },
  NEGBINOMDIST: {
    description: "Возвращает отрицательное биномиальное распределение",
    abstract: "Возвращает отрицательное биномиальное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%82%D1%80%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC%D1%80%D0%B0%D1%81%D0%BF-f59b0a37-bae2-408d-b115-a315609ba714"
    }],
    functionParameter: {
      numberF: {
        name: "число неудач",
        detail: "Количество неудачных испытаний."
      },
      numberS: {
        name: "число успехов",
        detail: " Пороговое значение числа успешных испытаний."
      },
      probabilityS: {
        name: "вероятность успеха ",
        detail: "Вероятность успеха."
      },
      cumulative: {
        name: "накопительная",
        detail: "Логическое значение, определяющее форму функции. Если кумулятивная функция TRUE, NEGBINOMDIST возвращает кумулятивную функцию распределения; если FALSE, возвращает функцию плотности вероятности."
      }
    }
  },
  NORMDIST: {
    description: "Возвращает нормальное распределение для указанного среднего и стандартного отклонения",
    abstract: "Возвращает нормальное распределение для указанного среднего и стандартного отклонения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC%D1%80%D0%B0%D1%81%D0%BF-126db625-c53e-4591-9a22-c9ff422d6d58"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      mean: {
        name: "cреднее",
        detail: "Среднее ln(x)."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение ln(x)."
      },
      cumulative: {
        name: "накопительная",
        detail: "Логическое значение, определяющее форму функции. Если кумулятивная функция TRUE, NORMDIST возвращает кумулятивную функцию распределения; если FALSE, возвращает функцию плотности вероятности."
      }
    }
  },
  NORMINV: {
    description: "Возвращает обратное нормальное распределение для указанного среднего и стандартного отклонения.",
    abstract: "Возвращает обратное нормальное распределение для указанного среднего и стандартного отклонения.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC%D0%BE%D0%B1%D1%80-87981ab8-2de0-4cb0-b1aa-e21d4cb879b8"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, соответствующая нормальному распределению."
      },
      mean: {
        name: "cреднее",
        detail: "Среднее ln(x)."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение ln(x)."
      }
    }
  },
  NORMSDIST: {
    description: "Возвращает стандартное нормальное интегральное распределение",
    abstract: "Возвращает стандартное нормальное интегральное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC%D1%81%D1%82%D1%80%D0%B0%D1%81%D0%BF-463369ea-0345-445d-802a-4ff0d6ce7cac"
    }],
    functionParameter: { z: {
      name: "z",
      detail: "Значение, для которого требуется вычислить распределение."
    } }
  },
  NORMSINV: {
    description: "Возвращает обратное значение стандартного нормального распределения",
    abstract: "Возвращает обратное значение стандартного нормального распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC%D1%81%D1%82%D0%BE%D0%B1%D1%80-8d1bce66-8e4d-4f3b-967c-30eed61f019d"
    }],
    functionParameter: { probability: {
      name: "вероятность",
      detail: "Вероятность, соответствующая нормальному распределению."
    } }
  },
  PERCENTILE: {
    description: "Возвращает k-ю персентиль для значений из интервала",
    abstract: "Возвращает k-ю персентиль для значений из интервала",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%B5%D1%80%D1%81%D0%B5%D0%BD%D1%82%D0%B8%D0%BB%D1%8C-91b43a53-543c-4708-93de-d626debdddca"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, который определяет относительное положение."
      },
      k: {
        name: "k",
        detail: "Значение процентили в интервале от 0 до 1, включая эти числа."
      }
    }
  },
  PERCENTRANK: {
    description: "Возвращает ранг значения в наборе данных в процентах от набора данных",
    abstract: "Возвращает ранг значения в наборе данных в процентах от набора данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BD%D0%B3-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BD%D0%B3-f1b5836c-9619-4847-9fc9-080ec9024442"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, который определяет относительное положение."
      },
      x: {
        name: "x",
        detail: "Значение, для которого требуется узнать ранг в массиве."
      },
      significance: {
        name: "точность",
        detail: "Значение, определяющее количество значимых цифр для возвращаемого процентного значения. Если этот аргумент опущен, для функции ПРОЦЕНТРАНГ используются три цифры (0,xxx)."
      }
    }
  },
  POISSON: {
    description: "Возвращает распределение Пуассона",
    abstract: "Возвращает распределение Пуассона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%83%D0%B0%D1%81%D1%81%D0%BE%D0%BD-d81f7294-9d7c-4f75-bc23-80aa8624173a"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      mean: {
        name: "cреднее",
        detail: "Среднее ln(x)."
      },
      cumulative: {
        name: "накопительная",
        detail: "Логическое значение, определяющее форму функции. Если кумулятивная функция TRUE, POISSON возвращает кумулятивную функцию распределения; если FALSE, он возвращает функцию плотности вероятности."
      }
    }
  },
  QUARTILE: {
    description: "Возвращает квартиль множества данных",
    abstract: "Возвращает квартиль множества данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%B2%D0%B0%D1%80%D1%82%D0%B8%D0%BB%D1%8C-93cf8f62-60cd-4fdb-8a92-8451041e1a2a"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон ячеек с числовыми значениями, для которых определяется значение квартиля."
      },
      quart: {
        name: "часть",
        detail: "Значение, которое требуется вернуть."
      }
    }
  },
  RANK: {
    description: "Возвращает ранг числа в списке чисел",
    abstract: "Возвращает ранг числа в списке чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%B0%D0%BD%D0%B3-6a2fc49d-1831-4a03-9d8c-c279cf99f723"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, для которого определяется ранг."
      },
      ref: {
        name: "cсылка",
        detail: "Ссылка на список чисел. Нечисловые значения в ссылке игнорируются."
      },
      order: {
        name: "порядок",
        detail: 'Число, определяющее способ упорядочения. Если значение аргумента "порядок" равно 0 или опущено, ранг числа определяется в Microsoft Excel так, как если бы ссылка была списком, отсортированным в порядке убывания. Если значение аргумента "порядок" — любое число, кроме нуля, то ранг числа определяется в Microsoft Excel так, как если бы ссылка была списком, отсортированным в порядке возрастания.'
      }
    }
  },
  STDEV: {
    description: "Оценивает стандартное отклонение по выборке. Стандартное отклонение — это мера того, насколько широко разбросаны точки данных относительно их среднего",
    abstract: "Оценивает стандартное отклонение по выборке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD-51fecaaa-231e-4bbb-9230-33650a72c9b0"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий выборке из генеральной совокупности."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы 2—255, соответствующие выборке из генеральной совокупности. Вместо аргументов, разделенных точкой с запятой, можно использовать массив или ссылку на массив."
      }
    }
  },
  STDEVP: {
    description: "Вычисляет стандартное отклонение по генеральной совокупности",
    abstract: "Вычисляет стандартное отклонение по генеральной совокупности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD%D0%BF-1f7c1c88-1bec-4422-8242-e9f7dc8bb195"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий генеральной совокупности."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы 2—255, соответствующие генеральной совокупности. Вместо аргументов, разделенных точкой с запятой, можно использовать массив или ссылку на массив."
      }
    }
  },
  TDIST: {
    description: "Возвращает процентные точки (вероятность) для t-распределения Стьюдента",
    abstract: "Возвращает процентные точки (вероятность) для t-распределения Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D1%80%D0%B0%D1%81%D0%BF-630a7695-4021-4853-9468-4a1f9dcdd192"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Числовое значение, для которого требуется вычислить распределение."
      },
      degFreedom: {
        name: "cтепени свободы",
        detail: "Целое, указывающее число степеней свободы."
      },
      tails: {
        name: "хвосты",
        detail: 'Определяет количество возвращаемых хвостов распределения. Если значение "хвосты" = 1, функция TDIST возвращает одностороннее распределение. Если значение "хвосты" = 2, функция TDIST возвращает двустороннее распределение.'
      }
    }
  },
  TINV: {
    description: "Возвращает двустороннее обратное t-распределения Стьюдента",
    abstract: "Возвращает двустороннее обратное t-распределения Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D1%80%D0%B0%D1%81%D0%BF%D0%BE%D0%B1%D1%80-a7c85b9d-90f5-41fe-9ca5-1cd2f3e1ed7c"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, соответствующая двустороннему распределению Стьюдента."
      },
      degFreedom: {
        name: "cтепени свободы",
        detail: "Целое, указывающее число степеней свободы."
      }
    }
  },
  TTEST: {
    description: "Возвращает вероятность, соответствующую критерию Стьюдента",
    abstract: "Возвращает вероятность, соответствующую критерию Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%82%D1%82%D0%B5%D1%81%D1%82-1696ffc1-4811-40fd-9d13-a0eaad83c7ae"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Первый массив или диапазон данных."
      },
      array2: {
        name: "массив2",
        detail: "Второй массив или диапазон данных."
      },
      tails: {
        name: "хвосты",
        detail: 'Число хвостов распределения. Если значение "хвосты" = 1, функция TTEST возвращает одностороннее распределение. Если значение "хвосты" = 2, функция TTEST возвращает двустороннее распределение.'
      },
      type: {
        name: "тип",
        detail: "Вид выполняемого t-теста."
      }
    }
  },
  VAR: {
    description: "Оценивает дисперсию по выборке",
    abstract: "Оценивает дисперсию по выборке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B8%D1%81%D0%BF-1f2b7ab2-954d-4e17-ba2c-9e58b15a7da2"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий выборке из генеральной совокупности."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы 2—255, соответствующие выборке из генеральной совокупности."
      }
    }
  },
  VARP: {
    description: "Вычисляет дисперсию для генеральной совокупности",
    abstract: "Вычисляет дисперсию для генеральной совокупности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B8%D1%81%D0%BF%D1%80-26a541c4-ecee-464d-a731-bd4c575b1a6b"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий генеральной совокупности."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы 2—255, соответствующие генеральной совокупности."
      }
    }
  },
  WEIBULL: {
    description: "Возвращает распределение Вейбулла",
    abstract: "Возвращает распределение Вейбулла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D0%B5%D0%B9%D0%B1%D1%83%D0%BB%D0%BB-b83dc2c6-260b-4754-bef2-633196f6fdcc"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      cumulative: {
        name: "накопительная",
        detail: "Логическое значение, определяющее форму функции. Если кумулятивная функция TRUE, WEIBULL возвращает кумулятивную функцию распределения; если FALSE, он возвращает функцию плотности вероятности."
      }
    }
  },
  ZTEST: {
    description: "Возвращает одностороннее значение вероятности z-теста",
    abstract: "Возвращает одностороннее значение вероятности z-теста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-z%D1%82%D0%B5%D1%81%D1%82-8f33be8a-6bd6-4ecc-8e3a-d9a4420c4a6a"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, с которыми сравнивается x."
      },
      x: {
        name: "x",
        detail: "Проверяемое значение."
      },
      sigma: {
        name: "сигма",
        detail: "Известное стандартное отклонение генеральной совокупности. Если этот аргумент опущен, используется стандартное отклонение выборки."
      }
    }
  }
};
const locale$14 = {
  CUBEKPIMEMBER: {
    description: "Возвращает свойство ключевого показателя эффективности (KPI) и отображает имя KPI в ячейке. KPI — это количественная мера, такая как ежемесячная валовая прибыль или ежеквартальная текучесть сотрудников, используемая для мониторинга производительности организации.",
    abstract: "Возвращает свойство ключевого показателя эффективности (KPI) и отображает имя KPI в ячейке. KPI — это количественная мера, такая как ежемесячная валовая прибыль или ежеквартальная текучесть сотрудников, используемая для мониторинга производительности организации.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/en-us/office/cubekpimember-function-744608bf-2c62-42cd-b67a-a56109f4b03b"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  CUBEMEMBER: {
    description: "Возвращает элемент или кортеж из куба. Используйте для проверки существования элемента или кортежа в кубе.",
    abstract: "Возвращает элемент или кортеж из куба. Используйте для проверки существования элемента или кортежа в кубе.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/en-us/office/cubemember-function-0f6a15b9-2c18-4819-ae89-e1b5c8b398ad"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  CUBEMEMBERPROPERTY: {
    description: "Возвращает значение свойства элемента из куба. Используйте для проверки существования имени элемента в кубе и для возврата указанного свойства для этого элемента.",
    abstract: "Возвращает значение свойства элемента из куба. Используйте для проверки существования имени элемента в кубе и для возврата указанного свойства для этого элемента.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/en-us/office/cubememberproperty-function-001e57d6-b35a-49e5-abcd-05ff599e8951"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  CUBERANKEDMEMBER: {
    description: "Возвращает n-ого или ранжированного элемента в наборе. Используйте для возврата одного или нескольких элементов в наборе, таких как лучший продавец или топ-10 студентов.",
    abstract: "Возвращает n-ого или ранжированного элемента в наборе. Используйте для возврата одного или нескольких элементов в наборе, таких как лучший продавец или топ-10 студентов.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/en-us/office/cuberankedmember-function-07efecde-e669-4075-b4bf-6b40df2dc4b3"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  CUBESET: {
    description: "Определяет вычисляемый набор элементов или кортежей, отправляя выражение набора на сервер, который создает набор, а затем возвращает этот набор в Microsoft Excel.",
    abstract: "Определяет вычисляемый набор элементов или кортежей, отправляя выражение набора на сервер, который создает набор, а затем возвращает этот набор в Microsoft Excel.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/en-us/office/cubeset-function-5b2146bd-62d6-4d04-9d8f-670e993ee1d9"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  CUBESETCOUNT: {
    description: "Возвращает количество элементов в наборе.",
    abstract: "Возвращает количество элементов в наборе.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/en-us/office/cubesetcount-function-c4c2a438-c1ff-4061-80fe-982f2d705286"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  CUBEVALUE: {
    description: "Возвращает агрегированное значение из куба.",
    abstract: "Возвращает агрегированное значение из куба.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/en-us/office/cubevalue-function-8733da24-26d1-4e34-9b3a-84a8f00dcbe0"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  }
};
const locale$13 = {
  DAVERAGE: {
    description: "Возвращает среднее значение выбранных записей базы данных",
    abstract: "Возвращает среднее значение выбранных записей базы данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/daverage-function-a6a2d5ac-4b4b-48cd-a1d8-7b37834e5aee"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DCOUNT: {
    description: "Считает ячейки, содержащие числа в базе данных",
    abstract: "Считает ячейки, содержащие числа в базе данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dcount-function-c1fc7b93-fb0d-4d8d-97db-8d5f076eaeb1"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DCOUNTA: {
    description: "Считает непустые ячейки в базе данных",
    abstract: "Считает непустые ячейки в базе данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dcounta-function-00232a6d-5a66-4a01-a25b-c1653fda1244"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DGET: {
    description: "Извлекает из базы данных одну запись, соответствующую заданным критериям",
    abstract: "Извлекает из базы данных одну запись, соответствующую заданным критериям",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dget-function-455568bf-4eef-45f7-90f0-ec250d00892e"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DMAX: {
    description: "Возвращает максимальное значение из выбранных записей базы данных",
    abstract: "Возвращает максимальное значение из выбранных записей базы данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dmax-function-f4e8209d-8958-4c3d-a1ee-6351665d41c2"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DMIN: {
    description: "Возвращает минимальное значение из выбранных записей базы данных",
    abstract: "Возвращает минимальное значение из выбранных записей базы данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dmin-function-4ae6f1d9-1f26-40f1-a783-6dc3680192a3"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DPRODUCT: {
    description: "Умножает значения в определенном поле записей, соответствующих критериям в базе данных",
    abstract: "Умножает значения в определенном поле записей, соответствующих критериям в базе данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dproduct-function-4f96b13e-d49c-47a7-b769-22f6d017cb31"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DSTDEV: {
    description: "Оценивает стандартное отклонение на основе выборки из выбранных записей базы данных",
    abstract: "Оценивает стандартное отклонение на основе выборки из выбранных записей базы данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dstdev-function-026b8c73-616d-4b5e-b072-241871c4ab96"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DSTDEVP: {
    description: "Вычисляет стандартное отклонение на основе всей совокупности выбранных записей базы данных",
    abstract: "Вычисляет стандартное отклонение на основе всей совокупности выбранных записей базы данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dstdevp-function-04b78995-da03-4813-bbd9-d74fd0f5d94b"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DSUM: {
    description: "Складывает числа в столбце поля записей в базе данных, которые соответствуют критериям",
    abstract: "Складывает числа в столбце поля записей в базе данных, которые соответствуют критериям",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dsum-function-53181285-0c4b-4f5a-aaa3-529a322be41b"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DVAR: {
    description: "Оценивает дисперсию на основе выборки из выбранных записей базы данных",
    abstract: "Оценивает дисперсию на основе выборки из выбранных записей базы данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dvar-function-d6747ca9-99c7-48bb-996e-9d7af00f3ed1"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  },
  DVARP: {
    description: "Вычисляет дисперсию на основе всей совокупности выбранных записей базы данных",
    abstract: "Вычисляет дисперсию на основе всей совокупности выбранных записей базы данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dvarp-function-eb0ba387-9cb7-45c8-81e9-0394912502fc"
    }],
    functionParameter: {
      database: {
        name: "База данных",
        detail: "интервал ячеек, образующих список или базу данных."
      },
      field: {
        name: "поле",
        detail: "столбец, используемый функцией."
      },
      criteria: {
        name: "условия",
        detail: "диапазон ячеек, который содержит задаваемые условия."
      }
    }
  }
};
const locale$12 = {
  DATE: {
    description: "Возвращает порядковый номер определенной даты",
    abstract: "Возвращает порядковый номер определенной даты",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%B0%D1%82%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B0%D1%82%D0%B0-e36c0c8c-4104-49da-ab83-82328b832349"
    }],
    functionParameter: {
      year: {
        name: "год",
        detail: "Значение аргумента год может содержать от одной до четырех цифр. Excel интерпретирует аргумент год в соответствии с используемой системой дат, используемой на вашем компьютере. По умолчанию в Microsoft Excel для Windows используется система дат 1900, то есть первой датой считается 1 января 1900 г."
      },
      month: {
        name: "месяц",
        detail: "Положительное или отрицательное целое число в диапазоне от 1 (январь) до 12 (декабрь), представляющее месяц года."
      },
      day: {
        name: "день",
        detail: "Положительное или отрицательное целое число в диапазоне от 1 до 31, представляющее день месяца."
      }
    }
  },
  DATEDIF: {
    description: "Вычисляет количество дней, месяцев или лет между двумя датами",
    abstract: "Вычисляет количество дней, месяцев или лет между двумя датами",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%80%D0%B0%D0%B7%D0%BD%D0%B4%D0%B0%D1%82-25dba1a4-2812-480b-84dd-8b32a451b35c"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Дата, представляющая первую или начальную дату заданного периода."
      },
      endDate: {
        name: "конечная дата",
        detail: "Дата окончания периода."
      },
      method: {
        name: "тип",
        detail: "Тип возвращаемых сведений."
      }
    }
  },
  DATEVALUE: {
    description: "Преобразует дату, которая хранится в виде текста, в порядковый номер",
    abstract: "Преобразует дату, которая хранится в виде текста, в порядковый номер",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B0%D1%82%D0%B0%D0%B7%D0%BD%D0%B0%D1%87-df8b07d4-7761-4a93-bc33-b7471bbff252"
    }],
    functionParameter: { dateText: {
      name: "дата как текст",
      detail: 'Текст, представляющий дату в формате даты Excel, или ссылка на ячейку с таким текстом. Например, "30.01.2008" и "30-янв-2008" — это текстовые строки в кавычках, представляющие даты.'
    } }
  },
  DAY: {
    description: "Возвращает день даты, заданной в числовом формате. День возвращается как целое число в диапазоне от 1 до 31",
    abstract: "Возвращает день даты, заданной в числовом формате. День возвращается как целое число в диапазоне от 1 до 31",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B5%D0%BD%D1%8C-8a7d1cbb-6c7d-4ba1-8aea-25c134d03101"
    }],
    functionParameter: { serialNumber: {
      name: "дата в числовом формате",
      detail: "Дата, которую необходимо найти. Даты вводятся с использованием функции ДАТА или как результат других формул и функций. Например, для указания даты 23 мая 2008 года следует воспользоваться выражением ДАТА(2008;5;23)."
    } }
  },
  DAYS: {
    description: "Возвращает количество дней между двумя датами",
    abstract: "Возвращает количество дней между двумя датами",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%BD%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BD%D0%B8-57740535-d549-4395-8728-0f07bff0b9df"
    }],
    functionParameter: {
      endDate: {
        name: "конечная дата",
        detail: "Начальная дата и конечная дата — две даты, количество дней между которыми необходимо вычислить."
      },
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата и конечная дата — две даты, количество дней между которыми необходимо вычислить."
      }
    }
  },
  DAYS360: {
    description: "Возвращает количество дней между двумя датами на основе 360-дневного года",
    abstract: "Возвращает количество дней между двумя датами на основе 360-дневного года",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BD%D0%B5%D0%B9360-b9a509fd-49ef-407e-94df-0cbda5718c2a"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата и конечная дата — две даты, количество дней между которыми необходимо вычислить."
      },
      endDate: {
        name: "конечная дата",
        detail: "Начальная дата и конечная дата — две даты, количество дней между которыми необходимо вычислить."
      },
      method: {
        name: "метод",
        detail: "Логическое значение, которое определяет, какой метод, европейский или американский, необходимо использовать при вычислениях."
      }
    }
  },
  EDATE: {
    description: "Возвращает порядковый номер даты, отстоящей на заданное количество месяцев вперед или назад от заданной даты. Функция EDATE используется для вычисления срока погашения или даты платежа, приходящейся на тот же день месяца, что и дата выпуска",
    abstract: "Возвращает порядковый номер даты, отстоящей на заданное количество месяцев вперед или назад от заданной даты",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B0%D1%82%D0%B0%D0%BC%D0%B5%D1%81-3c920eb2-6e66-44e7-a1f5-753ae47ee4f5"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Даты должны быть введены с использованием функции ДАТА или как результат вычисления других формул и функций. Например, для указания даты 23 мая 2008 года следует воспользоваться выражением ДАТА(2008;5;23). Если ввести даты как текст, это может привести к возникновению проблем."
      },
      months: {
        name: "число месяцев",
        detail: 'Количество месяцев до или после даты "нач_дата". Положительное значение аргумента "число_месяцев" означает будущие даты; отрицательное значение — прошедшие даты.'
      }
    }
  },
  EOMONTH: {
    description: 'Возвращает порядковый номер последнего дня месяца, отстоящего на указанное количество месяцев от даты, указанной в аргументе "начальная дата"',
    abstract: 'Возвращает порядковый номер последнего дня месяца, отстоящего на указанное количество месяцев от даты, указанной в аргументе "начальная дата"',
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D0%BD%D0%BC%D0%B5%D1%81%D1%8F%D1%86%D0%B0-7314ffa1-2bc9-4005-9d66-f49db127d628"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата."
      },
      months: {
        name: "число месяцев",
        detail: 'Количество месяцев до или после даты "начальная дата".'
      }
    }
  },
  EPOCHTODATE: {
    description: "Преобразует Unix-время в секундах, миллисекундах или микросекундах в дату и время по всемирному координированному времени (UTC).",
    abstract: "Преобразует Unix-время в секундах, миллисекундах или микросекундах в дату и время по всемирному координированному времени (UTC).",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/13193461?hl=ru"
    }],
    functionParameter: {
      timestamp: {
        name: "временная метка",
        detail: "Unix-время в секундах, миллисекундах или микросекундах."
      },
      unit: {
        name: "единица",
        detail: "Eдиница измерения времени во временной метке (значение по умолчанию: 1): \n1 - секунды. \n2 - миллисекунды.\n3 - микросекунды"
      }
    }
  },
  HOUR: {
    description: "Возвращает час, соответствующий заданному времени. Час определяется как целое число в интервале от 0 до 23",
    abstract: "Возвращает час, соответствующий заданному времени. Час определяется как целое число в интервале от 0 до 23",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B0%D1%81-a3afa879-86cb-4339-b1b5-2dd2d7310ac7"
    }],
    functionParameter: { serialNumber: {
      name: "дата в числовом формате",
      detail: "Дата, которую необходимо найти. Даты вводятся с использованием функции ДАТА или как результат других формул и функций. Например, для указания даты 23 мая 2008 года следует воспользоваться выражением ДАТА(2008;5;23)"
    } }
  },
  ISOWEEKNUM: {
    description: "Возвращает номер недели в году для определенной даты в соответствии со стандартами ISO",
    abstract: "Возвращает номер недели в году для определенной даты в соответствии со стандартами ISO",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/isoweeknum-function-1c2d0afe-d25b-4ab1-8894-8d0520e90e0e"
    }],
    functionParameter: { date: {
      name: "дата",
      detail: "Дата — это код даты и времени, с помощью которого в Microsoft Excel производятся вычисления над датами и промежутками времени."
    } }
  },
  MINUTE: {
    description: "Возвращает минуты, соответствующие аргументу время в числовом формате",
    abstract: "Возвращает минуты, соответствующие аргументу время в числовом формате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B8%D0%BD%D1%83%D1%82%D1%8B-af728df0-05c4-4b07-9eed-a84801a60589"
    }],
    functionParameter: { serialNumber: {
      name: "дата в числовом формате",
      detail: "Дата, которую необходимо найти. Даты вводятся с использованием функции ДАТА или как результат других формул и функций. Например, для указания даты 23 мая 2008 года следует воспользоваться выражением ДАТА(2008;5;23)"
    } }
  },
  MONTH: {
    description: "Возвращает месяц для даты, заданной в числовом формате. Месяц возвращается как целое число в диапазоне от 1 (январь) до 12 (декабрь)",
    abstract: "Возвращает месяц для даты, заданной в числовом формате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%B5%D1%81%D1%8F%D1%86-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B5%D1%81%D1%8F%D1%86-579a2881-199b-48b2-ab90-ddba0eba86e8"
    }],
    functionParameter: { serialNumber: {
      name: "дата в числовом формате",
      detail: "Дата месяца, который необходимо найти. Дата должна быть введена с использованием функции ДАТА либо как результат других формул или функций. Например, для указания даты 23 мая 2008 года следует воспользоваться выражением ДАТА(2008;5;23)."
    } }
  },
  NETWORKDAYS: {
    description: 'Возвращает количество рабочих дней между датами "начальная дата" и "конечная дата"',
    abstract: 'Возвращает количество рабочих дней между датами "начальная дата" и "конечная дата"',
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%87%D0%B8%D1%81%D1%82%D1%80%D0%B0%D0%B1%D0%B4%D0%BD%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D1%82%D1%80%D0%B0%D0%B1%D0%B4%D0%BD%D0%B8-48e717bf-a7a3-495f-969e-5005e3eb18e7"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата."
      },
      endDate: {
        name: "конечная дата",
        detail: "Конечная дата."
      },
      holidays: {
        name: "праздники",
        detail: "Список из одной или нескольких дат, которые требуется исключить из рабочего календаря, например государственные праздники. Список может представлять собой диапазон ячеек, содержащих даты, или константу массива, содержащую числа, которые представляют даты."
      }
    }
  },
  NETWORKDAYS_INTL: {
    description: "Возвращает количество рабочих дней между двумя датами с использованием параметров, определяющих, сколько в неделе выходных и какие дни являются выходными. Выходные и любые праздники не считаются рабочими днями",
    abstract: "Возвращает количество рабочих дней между двумя датами с использованием параметров, определяющих, сколько в неделе выходных и какие дни являются выходными. Выходные и любые праздники не считаются рабочими днями.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D1%82%D1%80%D0%B0%D0%B1%D0%B4%D0%BD%D0%B8-%D0%BC%D0%B5%D0%B6%D0%B4-a9b26239-4f20-46a1-9ab8-4e925bfd5e28"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата."
      },
      endDate: {
        name: "конечная дата",
        detail: "Конечная дата."
      },
      weekend: {
        name: "выходные",
        detail: "Указывает, какие дни недели являются выходными и не включаются в число рабочих дней между начальной и конечной датой."
      },
      holidays: {
        name: "праздники",
        detail: "Список из одной или нескольких дат, которые требуется исключить из рабочего календаря, например государственные праздники. Список может представлять собой диапазон ячеек, содержащих даты, или константу массива, содержащую числа, которые представляют даты."
      }
    }
  },
  NOW: {
    description: "Возвращает текущую дату и время в числовом формате",
    abstract: "Возвращает текущую дату и время в числовом формате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%82%D0%B4%D0%B0%D1%82%D0%B0-3337fd29-145a-4347-b2e6-20c904739c46"
    }],
    functionParameter: {}
  },
  SECOND: {
    description: "Возвращает секунды, соответствующие аргументу время в числовом формате",
    abstract: "Возвращает секунды, соответствующие аргументу время в числовом формате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%B5%D0%BA%D1%83%D0%BD%D0%B4%D1%8B-740d1cfc-553c-4099-b668-80eaa24e8af1"
    }],
    functionParameter: { serialNumber: {
      name: "дата в числовом формате",
      detail: "Дата, которую необходимо найти. Даты вводятся с использованием функции ДАТА или как результат других формул и функций. Например, для указания даты 23 мая 2008 года следует воспользоваться выражением ДАТА(2008;5;23)"
    } }
  },
  TIME: {
    description: "Возвращает десятичное число, представляющее определенное время",
    abstract: "Возвращает десятичное число, представляющее определенное время",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D1%80%D0%B5%D0%BC%D1%8F-9a5aff99-8f7d-4611-845e-747d0b8d5457"
    }],
    functionParameter: {
      hour: {
        name: "часы",
        detail: "Число от нуля (0) до 32767, задающее часы. Если значение больше 23, оно делится на 24; остаток от деления будет соответствовать значению часов. Например, ВРЕМЯ(27;0;0) = ВРЕМЯ(3;0;0) = 0,125, то есть 03:00."
      },
      minute: {
        name: "минуты",
        detail: "Число от 0 до 32767, задающее минуты. Если значение больше 59, оно будет пересчитано в часы и минуты. Например, ВРЕМЯ(0;750;0) = ВРЕМЯ(12;30;0) = 0,520833, то есть 12:30."
      },
      second: {
        name: "секунды",
        detail: "Число от 0 до 32767, задающее секунды. Если значение больше 59, оно будет пересчитано в часы, минуты и секунды. Например, ВРЕМЯ(0;0;2000) = ВРЕМЯ(0;33;22) = 0,023148, то есть 12:33:20."
      }
    }
  },
  TIMEVALUE: {
    description: "Возвращает время в виде десятичного числа, представленное текстовой строкой",
    abstract: "Возвращает время в виде десятичного числа, представленное текстовой строкой",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D1%80%D0%B5%D0%BC%D0%B7%D0%BD%D0%B0%D1%87-0b615c12-33d8-4431-bf3d-f3eb6d186645"
    }],
    functionParameter: { timeText: {
      name: "время как текст",
      detail: ' Текстовая строка, представляющая время в любом из форматов времени Microsoft Excel; Например, текстовые строки "18:45 PM" и "18:45" в кавычках, которые представляют время.'
    } }
  },
  TO_DATE: {
    description: "Преобразует число в значение даты",
    abstract: "Преобразует число в значение даты",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/3094239?hl=ru&sjid=2155433538747546473-AP"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Число, которое необходимо преобразовать в дату, или ссылка на ячейку, содержащую такое число"
    } }
  },
  TODAY: {
    description: "Возвращает серийный номер текущей даты",
    abstract: "Возвращает серийный номер текущей даты",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%B5%D0%B3%D0%BE%D0%B4%D0%BD%D1%8F-5eb3078d-a82c-4736-8930-2f51a028fdd9"
    }],
    functionParameter: {}
  },
  WEEKDAY: {
    description: "Возвращает день недели, соответствующий дате",
    abstract: "Возвращает день недели, соответствующий дате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B5%D0%BD%D1%8C%D0%BD%D0%B5%D0%B4-60e44483-2ed1-439f-8bd0-e404c190949a"
    }],
    functionParameter: {
      serialNumber: {
        name: "дата в числовом формате",
        detail: "Порядковый номер, соответствующий дате, день недели для которой необходимо найти."
      },
      returnType: {
        name: "тип",
        detail: "Число, определяющее тип возвращаемого значения."
      }
    }
  },
  WEEKNUM: {
    description: "Возвращает номер недели для определенной даты",
    abstract: "Возвращает номер недели для определенной даты",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D0%BC%D0%BD%D0%B5%D0%B4%D0%B5%D0%BB%D0%B8-e5c43a03-b4ab-426c-b411-b18c13c75340"
    }],
    functionParameter: {
      serialNumber: {
        name: "дата в числовом формате",
        detail: "Дата в течение недели"
      },
      returnType: {
        name: "тип",
        detail: "Неделя, на которую приходится первый четверг года, считается первой неделей, и для нее возвращается число 1"
      }
    }
  },
  WORKDAY: {
    description: "Возвращает число, которое представляет дату, отстоящую на заданное количество рабочих дней вперед или назад от начальной даты",
    abstract: "Возвращает число, которое представляет дату, отстоящую на заданное количество рабочих дней вперед или назад от начальной даты",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%B0%D0%B1%D0%B4%D0%B5%D0%BD%D1%8C-f764a5b7-05fc-4494-9486-60d494efbf33"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата."
      },
      days: {
        name: "количество дней",
        detail: 'Количество дней до или после начальной даты, не являющихся выходными или праздниками. Положительное значение аргумента "количество_дней" обозначает дату в будущем, отрицательное — дату в прошлом.'
      },
      holidays: {
        name: "праздники",
        detail: "Список из одной или нескольких дат, которые требуется исключить из рабочего календаря, например государственные праздники. Список может представлять собой диапазон ячеек, содержащих даты, или константу массива, содержащую числа, которые представляют даты."
      }
    }
  },
  WORKDAY_INTL: {
    description: "Возвращает серийный номер даты до или после указанного количества рабочих дней с пользовательскими параметрами выходных",
    abstract: "Возвращает серийный номер даты до или после указанного количества рабочих дней с пользовательскими параметрами выходных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%B0%D0%B1%D0%B4%D0%B5%D0%BD%D1%8C-%D0%BC%D0%B5%D0%B6%D0%B4-a378391c-9ba7-4678-8a39-39611a9bf81d"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата."
      },
      days: {
        name: "количество дней",
        detail: 'Количество дней до или после начальной даты, не являющихся выходными или праздниками. Положительное значение аргумента "количество_дней" обозначает дату в будущем, отрицательное — дату в прошлом.'
      },
      weekend: {
        name: "выходные",
        detail: "Указывает, какие дни недели являются выходными и не включаются в число рабочих дней между начальной и конечной датой."
      },
      holidays: {
        name: "праздники",
        detail: "Список из одной или нескольких дат, которые требуется исключить из рабочего календаря, например государственные праздники. Список может представлять собой диапазон ячеек, содержащих даты, или константу массива, содержащую числа, которые представляют даты."
      }
    }
  },
  YEAR: {
    description: "Возвращает год, соответствующий заданной дате. Год определяется как целое число в диапазоне от 1900 до 9999",
    abstract: "Возвращает год, соответствующий заданной дате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%BE%D0%B4-c64f017a-1354-490d-981f-578e8ec8d3b9"
    }],
    functionParameter: { serialNumber: {
      name: "дата в числовом формате",
      detail: "Дата, год которой необходимо найти. Даты должны вводиться с помощью функции ДАТА или как результат вычисления других формул и функций. Например, для указания даты 23 мая 2008 г. воспользуйтесь выражением ДАТА(2008,5,23). Если ввести даты как текст, это может привести к возникновению проблем."
    } }
  },
  YEARFRAC: {
    description: "Возвращает долю года, которую составляет количество дней между двумя датами (начальной и конечной)",
    abstract: "Возвращает долю года, которую составляет количество дней между двумя датами (начальной и конечной)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D0%BB%D1%8F%D0%B3%D0%BE%D0%B4%D0%B0-3844141e-c76d-4143-82b6-208454ddc6a8"
    }],
    functionParameter: {
      startDate: {
        name: "начальная дата",
        detail: "Начальная дата."
      },
      endDate: {
        name: "конечная дата",
        detail: "Конечная дата."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня"
      }
    }
  }
};
const locale$11 = {
  BESSELI: {
    description: "Возвращает модифицированную функцию Бесселя",
    abstract: "Возвращает модифицированную функцию Бесселя",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B5%D1%81%D1%81%D0%B5%D0%BB%D1%8C-i-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%81%D1%81%D0%B5%D0%BB%D1%8C-i-8d33855c-9a8d-444b-98e0-852267b1c0df"
    }],
    functionParameter: {
      x: {
        name: "X",
        detail: "Значение, для которого вычисляется функция."
      },
      n: {
        name: "N",
        detail: "Порядок функции Бесселя. Если n не является целым числом, оно усекается."
      }
    }
  },
  BESSELJ: {
    description: "Возвращает функцию Бесселя",
    abstract: "Возвращает функцию Бесселя",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%81%D1%81%D0%B5%D0%BB%D1%8C-j-839cb181-48de-408b-9d80-bd02982d94f7"
    }],
    functionParameter: {
      x: {
        name: "X",
        detail: "Значение, для которого вычисляется функция."
      },
      n: {
        name: "N",
        detail: "Порядок функции Бесселя. Если n не является целым числом, оно усекается."
      }
    }
  },
  BESSELK: {
    description: "Возвращает модифицированную функцию Бесселя",
    abstract: "Возвращает модифицированную функцию Бесселя",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%81%D1%81%D0%B5%D0%BB%D1%8C-k-606d11bc-06d3-4d53-9ecb-2803e2b90b70"
    }],
    functionParameter: {
      x: {
        name: "X",
        detail: "Значение, для которого вычисляется функция."
      },
      n: {
        name: "N",
        detail: "Порядок функции Бесселя. Если n не является целым числом, оно усекается."
      }
    }
  },
  BESSELY: {
    description: "Возвращает функцию Бесселя, также называемую функцией Вебера или функцией Неймана",
    abstract: "Возвращает функцию Бесселя, также называемую функцией Вебера или функцией Неймана",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%81%D1%81%D0%B5%D0%BB%D1%8C-y-f3a356b3-da89-42c3-8974-2da54d6353a2"
    }],
    functionParameter: {
      x: {
        name: "X",
        detail: "Значение, для которого вычисляется функция."
      },
      n: {
        name: "N",
        detail: "Порядок функции Бесселя. Если n не является целым числом, оно усекается."
      }
    }
  },
  BIN2DEC: {
    description: "Преобразует двоичное число в десятичное",
    abstract: "Преобразует двоичное число в десятичное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B2-%D0%B2-%D0%B4%D0%B5%D1%81-63905b57-b3a0-453d-99f4-647bb519cd6c"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Преобразуемое двоичное число."
    } }
  },
  BIN2HEX: {
    description: "Преобразует двоичное число в шестнадцатеричное",
    abstract: "Преобразует двоичное число в шестнадцатеричное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B2-%D0%B2-%D1%88%D0%B5%D1%81%D1%82%D0%BD-0375e507-f5e5-4077-9af8-28d84f9f41cc"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое двоичное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  BIN2OCT: {
    description: "Преобразует двоичное число в восьмеричное",
    abstract: "Преобразует двоичное число в восьмеричное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B2-%D0%B2-%D0%B2%D0%BE%D1%81%D1%8C%D0%BC-0a4e01ba-ac8d-4158-9b29-16c25c4c23fd"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое двоичное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  BITAND: {
    description: "Возвращает результат операции поразрядного И для двух чисел",
    abstract: "Возвращает результат операции поразрядного И для двух чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B8%D1%82-%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D1%82-%D0%B8-8a2be3d7-91c3-4b48-9517-64548008563a"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Должен быть в десятичной форме и больше 0."
      },
      number2: {
        name: "число2",
        detail: "Должен быть в десятичной форме и больше 0."
      }
    }
  },
  BITLSHIFT: {
    description: "Возвращает число со сдвигом влево на указанное число бит",
    abstract: "Возвращает число со сдвигом влево на указанное число бит",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B8%D1%82-%D1%81%D0%B4%D0%B2%D0%B8%D0%B3%D0%BB-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D1%82-%D1%81%D0%B4%D0%B2%D0%B8%D0%B3%D0%BB-c55bb27e-cacd-4c7c-b258-d80861a03c9c"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Должен быть целым числом, большим или равным 0."
      },
      shiftAmount: {
        name: "число бит",
        detail: "Число бит должно быть целым"
      }
    }
  },
  BITOR: {
    description: "Возвращает результат операции поразрядного ИЛИ для двух чисел",
    abstract: "Возвращает результат операции поразрядного ИЛИ для двух чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B8%D1%82-%D0%B8%D0%BB%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D1%82-%D0%B8%D0%BB%D0%B8-f6ead5c8-5b98-4c9e-9053-8ad5234919b2"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Должен быть в десятичной форме и больше 0."
      },
      number2: {
        name: "число2",
        detail: "Должен быть в десятичной форме и больше 0."
      }
    }
  },
  BITRSHIFT: {
    description: "Возвращает число со сдвигом вправо на указанное число бит",
    abstract: "Возвращает число со сдвигом вправо на указанное число бит",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B8%D1%82-%D1%81%D0%B4%D0%B2%D0%B8%D0%B3%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D1%82-%D1%81%D0%B4%D0%B2%D0%B8%D0%B3%D0%BF-274d6996-f42c-4743-abdb-4ff95351222c"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Должен быть целым числом, большим или равным 0."
      },
      shiftAmount: {
        name: "число бит",
        detail: "Число бит должно быть целым"
      }
    }
  },
  BITXOR: {
    description: "Возвращает результат операции поразрядного исключающего ИЛИ для двух чисел",
    abstract: "Возвращает результат операции поразрядного исключающего ИЛИ для двух чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B8%D1%82-%D0%B8%D1%81%D0%BA%D0%BB%D0%B8%D0%BB%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D1%82-%D0%B8%D1%81%D0%BA%D0%BB%D0%B8%D0%BB%D0%B8-c81306a1-03f9-4e89-85ac-b86c3cba10e4"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Должен быть в десятичной форме и больше 0."
      },
      number2: {
        name: "число2",
        detail: "Должен быть в десятичной форме и больше 0."
      }
    }
  },
  COMPLEX: {
    description: "Преобразует коэффициенты при вещественной и мнимой частях комплексного числа в комплексное число",
    abstract: "Преобразует коэффициенты при вещественной и мнимой частях комплексного числа в комплексное число",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D0%BC%D0%BF%D0%BB%D0%B5%D0%BA%D1%81%D0%BD-f0b8f3a9-51cc-4d6d-86fb-3a9362fa4128"
    }],
    functionParameter: {
      realNum: {
        name: "действительная часть",
        detail: "Действительная часть комплексного числа."
      },
      iNum: {
        name: "мнимая часть",
        detail: "Мнимая часть комплексного числа."
      },
      suffix: {
        name: "мнимая единица",
        detail: 'Обозначение мнимой единицы в комплексном числе. Если аргумент "мнимая_единица" опущен, используется суффикс "i".'
      }
    }
  },
  CONVERT: {
    description: "Преобразует число из одной системы мер в другую",
    abstract: "Преобразует число из одной системы мер в другую",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%B5%D0%BE%D0%B1%D1%80-d785bef1-808e-4aac-bdcd-666c810f9af2"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Значение в исходных единицах измерения, которое нужно преобразовать."
      },
      fromUnit: {
        name: "исходная единица измерения",
        detail: 'Единицы измерения аргумента "число".'
      },
      toUnit: {
        name: "конечная единица измерения",
        detail: 'Единицы измерения результата. CONVERT допускает указанные ниже текстовые значения (в кавычках) для аргументов "исходная единица измерения" и "конечная единица измерения".'
      }
    }
  },
  DEC2BIN: {
    description: "Преобразует десятичное число в двоичное",
    abstract: "Преобразует десятичное число в двоичное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B5%D1%81-%D0%B2-%D0%B4%D0%B2-0f63dd0e-5d1a-42d8-b511-5bf5c6d43838"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое десятичное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  DEC2HEX: {
    description: "Преобразует десятичное число в шестнадцатеричное",
    abstract: "Преобразует десятичное число в шестнадцатеричное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B5%D1%81-%D0%B2-%D1%88%D0%B5%D1%81%D1%82%D0%BD-6344ee8b-b6b5-4c6a-a672-f64666704619"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое десятичное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  DEC2OCT: {
    description: "Преобразует десятичное число в восьмеричное",
    abstract: "Преобразует десятичное число в восьмеричное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B5%D1%81-%D0%B2-%D0%B2%D0%BE%D1%81%D1%8C%D0%BC-c9d835ca-20b7-40c4-8a9e-d3be351ce00f"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое десятичное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  DELTA: {
    description: "Проверяет равенство двух значений",
    abstract: "Проверяет равенство двух значений",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B5%D0%BB%D1%8C%D1%82%D0%B0-2f763672-c959-4e07-ac33-fe03220ba432"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число."
      },
      number2: {
        name: "число2",
        detail: "Второе число. Если этот параметр опущен, число2 считается равным нулю."
      }
    }
  },
  ERF: {
    description: "Возвращает функцию ошибки",
    abstract: "Возвращает функцию ошибки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D0%BE%D1%88-c53c7e7b-5482-4b6c-883e-56df3c9af349"
    }],
    functionParameter: {
      lowerLimit: {
        name: "нижний предел",
        detail: "Нижний предел интегрирования ERF."
      },
      upperLimit: {
        name: "верхний предел",
        detail: 'Верхний предел интегрирования ERF. Если аргумент "верхний предел" опущен, функция ERF выполняет интегрирование в пределах от 0 до значения аргумента "нижний предел".'
      }
    }
  },
  ERF_PRECISE: {
    description: "Возвращает функцию ошибки",
    abstract: "Возвращает функцию ошибки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/erf-precise-function-9a349593-705c-4278-9a98-e4122831a8e0"
    }],
    functionParameter: { x: {
      name: "x",
      detail: "Нижний предел интегрирования функции ERF.PRECISE."
    } }
  },
  ERFC: {
    description: "Возвращает дополнительную функцию ERF, проинтегрированную в пределах от x до бесконечности",
    abstract: "Возвращает дополнительную функцию ERF, проинтегрированную в пределах от x до бесконечности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D1%84%D0%BE%D1%88-736e0318-70ba-4e8b-8d08-461fe68b71b3"
    }],
    functionParameter: { x: {
      name: "x",
      detail: "Нижний предел интегрирования функции ERFC."
    } }
  },
  ERFC_PRECISE: {
    description: "Возвращает дополнительную функцию ERF, проинтегрированную в пределах от x до бесконечности",
    abstract: "Возвращает дополнительную функцию ERF, проинтегрированную в пределах от x до бесконечности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D1%84%D0%BE%D1%88-%D1%82%D0%BE%D1%87%D0%BD-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D1%84%D0%BE%D1%88-%D1%82%D0%BE%D1%87%D0%BD-e90e6bab-f45e-45df-b2ac-cd2eb4d4a273"
    }],
    functionParameter: { x: {
      name: "x",
      detail: "Нижний предел интегрирования функции ERFC.PRECISE."
    } }
  },
  GESTEP: {
    description: "Используется для фильтрации множества значений",
    abstract: "Используется для фильтрации множества значений",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%BE%D1%80%D0%BE%D0%B3-f37e7d2a-41da-4129-be95-640883fca9df"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Проверяемое значение."
      },
      step: {
        name: "шаг",
        detail: ' Пороговое значение. Если аргумент "порог" опущен, функция GESTEP предполагает, что он равен нулю.'
      }
    }
  },
  HEX2BIN: {
    description: "Преобразует шестнадцатеричное число в двоичное",
    abstract: "Преобразует шестнадцатеричное число в двоичное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%88%D0%B5%D1%81%D1%82%D0%BD-%D0%B2-%D0%B4%D0%B2-a13aafaa-5737-4920-8424-643e581828c1"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое шестнадцатеричное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  HEX2DEC: {
    description: "Преобразует шестнадцатеричное число в десятичное",
    abstract: "Преобразует шестнадцатеричное число в десятичное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%88%D0%B5%D1%81%D1%82%D0%BD-%D0%B2-%D0%B4%D0%B5%D1%81-8c8c3155-9f37-45a5-a3ee-ee5379ef106e"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Преобразуемое шестнадцатеричное число."
    } }
  },
  HEX2OCT: {
    description: "Преобразует шестнадцатеричное число в восьмеричное",
    abstract: "Преобразует шестнадцатеричное число в восьмеричное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%88%D0%B5%D1%81%D1%82%D0%BD-%D0%B2-%D0%B2%D0%BE%D1%81%D1%8C%D0%BC-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%88%D0%B5%D1%81%D1%82%D0%BD-%D0%B2-%D0%B2%D0%BE%D1%81%D1%8C%D0%BC-54d52808-5d19-4bd0-8a63-1096a5d11912"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое шестнадцатеричное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  IMABS: {
    description: "Возвращает абсолютную величину (модуль) комплексного числа, представленного в текстовом формате",
    abstract: "Возвращает абсолютную величину (модуль) комплексного числа, представленного в текстовом формате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-abs-b31e73c6-d90c-4062-90bc-8eb351d765a1"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется найти абсолютную величину."
    } }
  },
  IMAGINARY: {
    description: "Возвращает коэффициент при мнимой части комплексного числа",
    abstract: "Возвращает коэффициент при мнимой части комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D1%87%D0%B0%D1%81%D1%82%D1%8C-dd5952fd-473d-44d9-95a1-9a17b23e428a"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить коэффициент при мнимой части."
    } }
  },
  IMARGUMENT: {
    description: "Возвращает аргумент Тета(theta), угол, выраженный в радианах",
    abstract: "Возвращает аргумент Тета(theta), угол, выраженный в радианах,",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D0%B0%D1%80%D0%B3%D1%83%D0%BC%D0%B5%D0%BD%D1%82-eed37ec1-23b3-4f59-b9f3-d340358a034a"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется аргумент Тета."
    } }
  },
  IMCONJUGATE: {
    description: "Возвращает комплексно-сопряженное число для комплексного числа",
    abstract: "Возвращает комплексно-сопряженное число для комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-%D1%81%D0%BE%D0%BF%D1%80%D1%8F%D0%B6-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D1%81%D0%BE%D0%BF%D1%80%D1%8F%D0%B6-2e2fc1ea-f32b-4f9b-9de6-233853bafd42"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить сопряженное комплексное число."
    } }
  },
  IMCOS: {
    description: "Возвращает косинус комплексного числа",
    abstract: "Возвращает косинус комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-cos-dad75277-f592-4a6b-ad6c-be93a808a53c"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить косинус."
    } }
  },
  IMCOSH: {
    description: "Возвращает гиперболический косинус комплексного числа",
    abstract: "Возвращает гиперболический косинус комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-cosh-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-cosh-053e4ddb-4122-458b-be9a-457c405e90ff"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить гиперболический косинус."
    } }
  },
  IMCOT: {
    description: "Возвращает котангенс комплексного числа",
    abstract: "Возвращает котангенс комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-cot-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-cot-dc6a3607-d26a-4d06-8b41-8931da36442c"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить котангенс."
    } }
  },
  IMCOTH: {
    description: "Возвращает гиперболический котангенс заданного комплексного числа.",
    abstract: "Возвращает гиперболический котангенс заданного комплексного числа.",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/9366256?hl=ru&sjid=1719420110567985051-AP"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, гиперболический котангенс которого нужно вычислить."
    } }
  },
  IMCSC: {
    description: "Возвращает косеканс комплексного числа",
    abstract: "Возвращает косеканс комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-csc-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-csc-9e158d8f-2ddf-46cd-9b1d-98e29904a323"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить косеканс."
    } }
  },
  IMCSCH: {
    description: "Возвращает гиперболический косеканс комплексного числа",
    abstract: "Возвращает гиперболический косеканс комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-csch-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-csch-c0ae4f54-5f09-4fef-8da0-dc33ea2c5ca9"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить гиперболический косеканс."
    } }
  },
  IMDIV: {
    description: "Возвращает частное от деления двух комплексных чисел",
    abstract: "Возвращает частное от деления двух комплексных чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D0%B4%D0%B5%D0%BB-a505aff7-af8a-4451-8142-77ec3d74d83f"
    }],
    functionParameter: {
      inumber1: {
        name: "комлексное число1",
        detail: "Комплексный числитель (делимое)."
      },
      inumber2: {
        name: "комлексное число2",
        detail: "Комплексный знаменатель (делитель)."
      }
    }
  },
  IMEXP: {
    description: "Возвращает экспоненту комплексного числа",
    abstract: "Возвращает экспоненту комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-exp-c6f8da1f-e024-4c0c-b802-a60e7147a95f"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить экспоненту."
    } }
  },
  IMLN: {
    description: "Возвращает натуральный логарифм комплексного числа",
    abstract: "Возвращает натуральный логарифм комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-ln-32b98bcf-8b81-437c-a636-6fb3aad509d8"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить натуральный логарифм."
    } }
  },
  IMLOG: {
    description: "Возвращает логарифм комплексного числа по указанному основанию",
    abstract: "Возвращает логарифм комплексного числа по указанному основанию",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/9366486?hl=ru-Hans&sjid=1719420110567985051-AP"
    }],
    functionParameter: {
      inumber: {
        name: "комлексное число",
        detail: "Значение логарифмической функции, которое нужно указать."
      },
      base: {
        name: "основание",
        detail: "Основание для вычисления логарифма."
      }
    }
  },
  IMLOG10: {
    description: "Возвращает десятичный логарифм комплексного числа",
    abstract: "Возвращает десятичный логарифм комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-log10-58200fca-e2a2-4271-8a98-ccd4360213a5"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется общий логарифм."
    } }
  },
  IMLOG2: {
    description: "Возвращает двоичный логарифм комплексного числа",
    abstract: "Возвращает двоичный логарифм комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-log2-152e13b4-bc79-486c-a243-e6a676878c51"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить двоичный логарифм."
    } }
  },
  IMPOWER: {
    description: "Возвращает комплексное число возведенное в степень",
    abstract: "Возвращает комплексное число возведенное в степень",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D1%81%D1%82%D0%B5%D0%BF%D0%B5%D0%BD%D1%8C-210fd2f5-f8ff-4c6a-9d60-30e34fbdef39"
    }],
    functionParameter: {
      inumber: {
        name: "комлексное число",
        detail: "Комплексное число, возводимое в степень."
      },
      number: {
        name: "число",
        detail: " Степень, в которую необходимо возвести комплексное число."
      }
    }
  },
  IMPRODUCT: {
    description: "Возвращает произведение от 1 до 255 комплексных чисел",
    abstract: "Возвращает произведение от 1 до 255 комплексных чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D0%BF%D1%80%D0%BE%D0%B8%D0%B7%D0%B2%D0%B5%D0%B4-2fb8651a-a4f2-444f-975e-8ba7aab3a5ba"
    }],
    functionParameter: {
      inumber1: {
        name: "комлексное число1",
        detail: "От 1 до 255 перемножаемых комплексных чисел."
      },
      inumber2: {
        name: "комлексное число2",
        detail: "От 1 до 255 перемножаемых комплексных чисел."
      }
    }
  },
  IMREAL: {
    description: "Возвращает коэффициент при вещественной части комплексного числа ",
    abstract: "Возвращает коэффициент при вещественной части комплексного числа ",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D0%B2%D0%B5%D1%89-d12bc4c0-25d0-4bb3-a25f-ece1938bf366"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить коэффициент при вещественной (действительной) части."
    } }
  },
  IMSEC: {
    description: "Возвращает секанс комплексного числа",
    abstract: "Возвращает секанс комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-sec-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-sec-6df11132-4411-4df4-a3dc-1f17372459e0"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить секанс."
    } }
  },
  IMSECH: {
    description: "Возвращает гиперболический секанс комплексного числа",
    abstract: "Возвращает гиперболический секанс комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-sech-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-sech-f250304f-788b-4505-954e-eb01fa50903b"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить гиперболический секанс."
    } }
  },
  IMSIN: {
    description: "Возвращает синус комплексного числа",
    abstract: "Возвращает синус комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/imsin-function-1ab02a39-a721-48de-82ef-f52bf37859f6"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить синус."
    } }
  },
  IMSINH: {
    description: "Возвращает гиперболический синус комплексного числа",
    abstract: "Возвращает гиперболический синус комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-sinh-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-sinh-dfb9ec9e-8783-4985-8c42-b028e9e8da3d"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить гиперболический синус."
    } }
  },
  IMSQRT: {
    description: "Возвращает значение квадратного корня из комплексного числа",
    abstract: "Возвращает значение квадратного корня из комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-%D0%BA%D0%BE%D1%80%D0%B5%D0%BD%D1%8C-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D0%BA%D0%BE%D1%80%D0%B5%D0%BD%D1%8C-e1753f80-ba11-4664-a10e-e17368396b70"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, из которого требуется извлечь квадратный корень."
    } }
  },
  IMSUB: {
    description: "Возвращает разность двух комплексных чисел,",
    abstract: "Возвращает разность двух комплексных чисел,",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D1%80%D0%B0%D0%B7%D0%BD-2e404b4d-4935-4e85-9f52-cb08b9a45054"
    }],
    functionParameter: {
      inumber1: {
        name: "комлексное число1",
        detail: "Уменьшаемое комплексное число."
      },
      inumber2: {
        name: "комлексное число2",
        detail: "Вычитаемое комплексное число.."
      }
    }
  },
  IMSUM: {
    description: "Возвращает сумму двух или более комплексных чисел",
    abstract: "Возвращает сумму двух или более комплексных чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-%D1%81%D1%83%D0%BC%D0%BC-81542999-5f1c-4da6-9ffe-f1d7aaa9457f"
    }],
    functionParameter: {
      inumber1: {
        name: "комлексное число1",
        detail: "От 1 до 255 суммируемых комплексных чисел."
      },
      inumber2: {
        name: "комлексное число2",
        detail: "От 1 до 255 суммируемых комплексных чисел."
      }
    }
  },
  IMTAN: {
    description: "Возвращает тангенс комплексного числа",
    abstract: "Возвращает тангенс комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BD%D0%B8%D0%BC-tan-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BD%D0%B8%D0%BC-tan-8478f45d-610a-43cf-8544-9fc0b553a132"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, для которого требуется определить тангенс."
    } }
  },
  IMTANH: {
    description: "Возвращает гиперболический тангенс комплексного числа",
    abstract: "Возвращает гиперболический тангенс комплексного числа",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/9366655?hl=ru&sjid=1719420110567985051-AP"
    }],
    functionParameter: { inumber: {
      name: "комлексное число",
      detail: "Комплексное число, гиперболический тангенс которого нужно вычислить."
    } }
  },
  OCT2BIN: {
    description: "Преобразует восьмеричное число в двоичное",
    abstract: "Преобразует восьмеричное число в двоичное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D0%BE%D1%81%D1%8C%D0%BC-%D0%B2-%D0%B4%D0%B2-55383471-3c56-4d27-9522-1a8ec646c589"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое восьмеричное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  },
  OCT2DEC: {
    description: "Преобразует восьмеричное число в десятичное",
    abstract: "Преобразует восьмеричное число в десятичное.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D0%BE%D1%81%D1%8C%D0%BC-%D0%B2-%D0%B4%D0%B5%D1%81-87606014-cb98-44b2-8dbb-e48f8ced1554"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Преобразуемое восьмеричное число."
    } }
  },
  OCT2HEX: {
    description: "Преобразует восьмеричное число в шестнадцатеричное",
    abstract: "Преобразует восьмеричное число в шестнадцатеричное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D0%BE%D1%81%D1%8C%D0%BC-%D0%B2-%D1%88%D0%B5%D1%81%D1%82%D0%BD-912175b4-d497-41b4-a029-221f051b858f"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое восьмеричное число."
      },
      places: {
        name: "разрядность",
        detail: "Количество знаков в записи числа."
      }
    }
  }
};
const locale$10 = {
  ACCRINT: {
    description: "Возвращает накопленный процент по ценным бумагам с периодической выплатой процентов",
    abstract: "Возвращает накопленный процент по ценным бумагам с периодической выплатой процентов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B0%D0%BA%D0%BE%D0%BF%D0%B4%D0%BE%D1%85%D0%BE%D0%B4-fe45d089-6722-4fb3-9379-e1f911d8dc74"
    }],
    functionParameter: {
      issue: {
        name: "дата выпуска",
        detail: "Дата выпуска ценных бумаг."
      },
      firstInterest: {
        name: "первый доход",
        detail: "Дата первой выплаты по ценным бумагам."
      },
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги (дата продажи ценных бумаг покупателю, более поздняя, чем дата выпуска)."
      },
      rate: {
        name: "ставка",
        detail: "Годовая процентная ставка для купонов по ценным бумагам."
      },
      par: {
        name: "номинал",
        detail: "Номинальная стоимость ценных бумаг."
      },
      frequency: {
        name: "частота",
        detail: " Количество выплат по купонам за год. Для ежегодных выплат частота равна 1, для полугодовых — 2, для ежеквартальных — 4."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      },
      calcMethod: {
        name: "способ расчета",
        detail: "Логическое значение: проценты начисляются с даты выпуска = ИСТИНА или игнорируется; проценты начисляются с даты последней выплаты купона = ЛОЖЬ."
      }
    }
  },
  ACCRINTM: {
    description: "Возвращает накопленный процент по ценным бумагам, процент по которым выплачивается в срок погашения.",
    abstract: "Возвращает накопленный процент по ценным бумагам, процент по которым выплачивается в срок погашения.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BD%D0%B0%D0%BA%D0%BE%D0%BF%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BF%D0%BE%D0%B3%D0%B0%D1%88-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B0%D0%BA%D0%BE%D0%BF%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BF%D0%BE%D0%B3%D0%B0%D1%88-f62f01f9-5754-4cc4-805b-0e70199328a7"
    }],
    functionParameter: {
      issue: {
        name: "дата выпуска",
        detail: "Дата выпуска ценных бумаг."
      },
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      rate: {
        name: "cтавка",
        detail: "Годовая процентная ставка для купонов по ценным бумагам."
      },
      par: {
        name: "номинал",
        detail: "Номинальная стоимость ценных бумаг"
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  AMORDEGRC: {
    description: "Возвращает амортизацию за каждый учетный период, используя коэффициент амортизации",
    abstract: "Возвращает амортизацию за каждый учетный период, используя коэффициент амортизации.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B0%D0%BC%D0%BE%D1%80%D1%83%D0%BC-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B0%D0%BC%D0%BE%D1%80%D1%83%D0%BC-a14d0ca1-64a4-42eb-9b3d-b0dededf9e51"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "first"
      },
      number2: {
        name: "number2",
        detail: "second"
      }
    }
  },
  AMORLINC: {
    description: "Возвращает величину амортизации для каждого периода",
    abstract: "Возвращает величину амортизации для каждого периода",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B0%D0%BC%D0%BE%D1%80%D1%83%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B0%D0%BC%D0%BE%D1%80%D1%83%D0%B2-7d417b45-f7f5-4dba-a0a5-3451a81079a8"
    }],
    functionParameter: {
      cost: {
        name: "стоимость",
        detail: "Стоимость актива."
      },
      datePurchased: {
        name: "дата приобретения",
        detail: "Дата приобретения актива."
      },
      firstPeriod: {
        name: "первый период ",
        detail: "Дата окончания первого периода."
      },
      salvage: {
        name: "остаточная стоимость",
        detail: "Остаточная стоимость актива в конце периода амортизации."
      },
      period: {
        name: "период",
        detail: "Период."
      },
      rate: {
        name: "cтавка",
        detail: "Ставка амортизации."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дат."
      }
    }
  },
  COUPDAYBS: {
    description: "Возвращает количество дней от начала действия купона до даты соглашения",
    abstract: "Возвращает количество дней от начала действия купона до даты соглашения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BD%D0%B5%D0%B9%D0%BA%D1%83%D0%BF%D0%BE%D0%BD%D0%B4%D0%BE-eb9a8dfb-2fb2-4c61-8e5d-690b320cf872"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  COUPDAYS: {
    description: "Возвращает число дней в периоде купона, содержащем дату расчета.",
    abstract: "Возвращает число дней в периоде купона, содержащем дату расчета.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%BD%D0%B5%D0%B9%D0%BA%D1%83%D0%BF%D0%BE%D0%BD-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BD%D0%B5%D0%B9%D0%BA%D1%83%D0%BF%D0%BE%D0%BD-cc64380b-315b-4e7b-950c-b30b0a76f671"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  COUPDAYSNC: {
    description: "Возвращает число дней от даты расчета до срока следующего купона",
    abstract: "Возвращает число дней от даты расчета до срока следующего купона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BD%D0%B5%D0%B9%D0%BA%D1%83%D0%BF%D0%BE%D0%BD%D0%BF%D0%BE%D1%81%D0%BB%D0%B5-5ab3f0b2-029f-4a8b-bb65-47d525eea547"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  COUPNCD: {
    description: "Возвращает число, представляющее дату следующего купона от даты соглашения",
    abstract: "Возвращает число, представляющее дату следующего купона от даты соглашения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B0%D1%82%D0%B0%D0%BA%D1%83%D0%BF%D0%BE%D0%BD%D0%BF%D0%BE%D1%81%D0%BB%D0%B5-fd962fef-506b-4d9d-8590-16df5393691f"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  COUPNUM: {
    description: "Возвращает количество купонов, которые могут быть оплачены между датой соглашения и датой погашения, округленное до ближайшего целого купона",
    abstract: "Возвращает количество купонов, которые могут быть оплачены между датой соглашения и датой погашения, округленное до ближайшего целого купона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D0%BB%D0%BA%D1%83%D0%BF%D0%BE%D0%BD-a90af57b-de53-4969-9c99-dd6139db2522"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  COUPPCD: {
    description: "Возвращает число, представляющее дату предыдущего купона до даты соглашения",
    abstract: "Возвращает число, представляющее дату предыдущего купона до даты соглашения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B0%D1%82%D0%B0%D0%BA%D1%83%D0%BF%D0%BE%D0%BD%D0%B4%D0%BE-2eb50473-6ee9-4052-a206-77a9a385d5b3"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  CUMIPMT: {
    description: "Возвращает кумулятивную величину процентов, выплачиваемых по займу в промежутке между двумя периодами выплат",
    abstract: "Возвращает кумулятивную величину процентов, выплачиваемых по займу в промежутке между двумя периодами выплат",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%B1%D1%89%D0%BF%D0%BB%D0%B0%D1%82-61067bb0-9016-427d-b95b-1a752af0e606"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка."
      },
      nper: {
        name: "кпер",
        detail: "Общее количество периодов выплат."
      },
      pv: {
        name: "пс",
        detail: "Текущее значение."
      },
      startPeriod: {
        name: "нач период",
        detail: "Номер первого периода, включенного в вычисления. Нумерация периодов выплат начинается с 1."
      },
      endPeriod: {
        name: "кон период",
        detail: "Номер последнего периода, включенного в вычисления."
      },
      type: {
        name: "тип",
        detail: "Сроки оплаты."
      }
    }
  },
  CUMPRINC: {
    description: "Возвращает кумулятивную сумму, выплачиваемую в погашение основной суммы займа в промежутке между двумя периодами",
    abstract: "Возвращает кумулятивную сумму, выплачиваемую в погашение основной суммы займа в промежутке между двумя периодами",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%B1%D1%89%D0%B4%D0%BE%D1%85%D0%BE%D0%B4-94a4516d-bd65-41a1-bc16-053a6af4c04d"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка."
      },
      nper: {
        name: "кпер",
        detail: "Общее количество периодов выплат."
      },
      pv: {
        name: "пс",
        detail: "Текущее значение."
      },
      startPeriod: {
        name: "нач период",
        detail: "Номер первого периода, включенного в вычисления. Нумерация периодов выплат начинается с 1."
      },
      endPeriod: {
        name: "кон период",
        detail: "Номер последнего периода, включенного в вычисления."
      },
      type: {
        name: "тип",
        detail: "Сроки оплаты."
      }
    }
  },
  DB: {
    description: "Возвращает величину амортизации актива для заданного периода, рассчитанную методом фиксированного уменьшения остатка",
    abstract: "Возвращает величину амортизации актива для заданного периода, рассчитанную методом фиксированного уменьшения остатка",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D1%83%D0%BE-354e7d28-5f93-4ff1-8a52-eb4ee549d9d7"
    }],
    functionParameter: {
      cost: {
        name: "стоимость",
        detail: "Начальная стоимость актива."
      },
      salvage: {
        name: "остаточная стоимость",
        detail: "Стоимость в конце периода амортизации (иногда называемая остаточной стоимостью имущества)."
      },
      life: {
        name: "время эксплуатации",
        detail: "Количество периодов, за которые собственность амортизируется (иногда называемое периодом амортизации)."
      },
      period: {
        name: "период",
        detail: "Период, для которого требуется вычислить амортизацию."
      },
      month: {
        name: "месяцы",
        detail: 'Количество месяцев в первом году. Если аргумент "месяцы" опущен, то предполагается, что он равен 12.'
      }
    }
  },
  DDB: {
    description: "Возвращает значение амортизации актива за указанный период, используя метод двойного уменьшения остатка или иной явно указанный метод",
    abstract: "Возвращает значение амортизации актива за указанный период, используя метод двойного уменьшения остатка или иной явно указанный метод",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B4%D0%BE%D0%B1-519a7a37-8772-4c96-85c0-ed2c209717a5"
    }],
    functionParameter: {
      cost: {
        name: "стоимость",
        detail: "Начальная стоимость актива."
      },
      salvage: {
        name: "остаточная стоимость",
        detail: "Стоимость в конце периода амортизации (иногда называемая остаточной стоимостью имущества)."
      },
      life: {
        name: "время эксплуатации",
        detail: "Количество периодов, за которые собственность амортизируется (иногда называемое периодом амортизации)."
      },
      period: {
        name: "период",
        detail: "Период, для которого требуется вычислить амортизацию."
      },
      factor: {
        name: "коэффициент",
        detail: "Коэффициент уменьшения остатка. Если коэффициент опущен, он полагается равным 2 (метод удвоенного процента со снижающегося остатка)."
      }
    }
  },
  DISC: {
    description: "Возвращает ставку дисконтирования для ценных бумаг",
    abstract: "Возвращает ставку дисконтирования для ценных бумаг",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BA%D0%B8%D0%B4%D0%BA%D0%B0-71fce9f3-3f05-4acf-a5a3-eac6ef4daa53"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      pr: {
        name: "цена",
        detail: "Цена ценных бумаг на 100 рублей номинальной стоимости."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  DOLLARDE: {
    description: "Преобразует цену в рублях, представленную в виде целой и дробной части, например 1,01, в цену в рублях, выраженную десятичным числом",
    abstract: "Преобразует цену в рублях, представленную в виде целой и дробной части, например 1,01, в цену в рублях, выраженную десятичным числом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%80%D1%83%D0%B1%D0%BB%D1%8C-%D0%B4%D0%B5%D1%81-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D1%83%D0%B1%D0%BB%D1%8C-%D0%B4%D0%B5%D1%81-db85aab0-1677-428a-9dfd-a38476693427"
    }],
    functionParameter: {
      fractionalDollar: {
        name: "дроб руб",
        detail: "Число, состоящее из целой и дробной частей, разделенных десятичным разделителем."
      },
      fraction: {
        name: "дроб",
        detail: "Целое число, которое нужно использовать в качестве знаменателя."
      }
    }
  },
  DOLLARFR: {
    description: "Используется для преобразования десятичных чисел, например стоимости ценных бумаг, в дробные значения",
    abstract: "Используется для преобразования десятичных чисел, например стоимости ценных бумаг, в дробные значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D1%83%D0%B1%D0%BB%D1%8C-%D0%B4%D1%80%D0%BE%D0%B1%D1%8C-0835d163-3023-4a33-9824-3042c5d4f495"
    }],
    functionParameter: {
      decimalDollar: {
        name: "дес руб",
        detail: "Десятичное число."
      },
      fraction: {
        name: "дроб",
        detail: "Целое число, которое нужно использовать в качестве знаменателя."
      }
    }
  },
  DURATION: {
    description: "Возвращает годовую продолжительность ценной бумаги с периодическими выплатами процентов.",
    abstract: "Возвращает годовую продолжительность ценной бумаги с периодическими выплатами процентов.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BB%D0%B8%D1%82-b254ea57-eadc-4602-a86a-c8e369334038"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      coupon: {
        name: "купон",
        detail: "Годовая процентная ставка для купонов по ценным бумагам."
      },
      yld: {
        name: "доход",
        detail: "Годовой доход по ценным бумагам."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  EFFECT: {
    description: "Возвращает фактическую (эффективную) годовую процентную ставку",
    abstract: "Возвращает фактическую (эффективную) годовую процентную ставку",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%8D%D1%84%D1%84%D0%B5%D0%BA%D1%82-910d4e4c-79e2-4009-95e6-507e04f11bc4"
    }],
    functionParameter: {
      nominalRate: {
        name: "номинальная ставка",
        detail: "Номинальная процентная ставка."
      },
      npery: {
        name: "количество периодов",
        detail: "Количество периодов в году."
      }
    }
  },
  FV: {
    description: "Возвращает будущую стоимость инвестиции на основе постоянной процентной ставки",
    abstract: "Возвращает будущую стоимость инвестиции на основе постоянной процентной ставки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D1%81-2eef9f44-a084-4c61-bdd8-4fe4bb1b71b3"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка за период."
      },
      nper: {
        name: "кпер",
        detail: "Общее количество периодов платежей по аннуитету."
      },
      pmt: {
        name: "плт",
        detail: "Выплата, производимая в каждый период; это значение не может меняться в течение всего периода выплат."
      },
      pv: {
        name: "пс",
        detail: "Приведенная к текущему моменту стоимость, т. е. общая сумма, которая на текущий момент равноценна ряду будущих платежей."
      },
      type: {
        name: "тип",
        detail: "Число 0 или 1, обозначающее срок выплаты."
      }
    }
  },
  FVSCHEDULE: {
    description: "Возвращает будущую стоимость первоначальной основной суммы после применения ряда (плана) ставок сложных процентов",
    abstract: "Возвращает будущую стоимость первоначальной основной суммы после применения ряда (плана) ставок сложных процентов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B7%D1%80%D0%B0%D1%81%D0%BF%D0%B8%D1%81-bec29522-bd87-4082-bab9-a241f3fb251d"
    }],
    functionParameter: {
      principal: {
        name: "первичное",
        detail: "Стоимость инвестиции на текущий момент."
      },
      schedule: {
        name: "план",
        detail: "Массив применяемых процентных ставок."
      }
    }
  },
  INTRATE: {
    description: "Возвращает процентную ставку для полностью инвестированных ценных бумаг",
    abstract: "Возвращает процентную ставку для полностью инвестированных ценных бумаг",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8%D0%BD%D0%BE%D1%80%D0%BC%D0%B0-5cb34dde-a221-4cb6-b3eb-0b9e55e1316f"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      investment: {
        name: "инвестиция",
        detail: "Объем инвестиции в ценные бумаги."
      },
      redemption: {
        name: "погашение",
        detail: "Сумма, которая должна быть получена на момент погашения ценных бумаг."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  IPMT: {
    description: "Возвращает сумму платежей по процентам для инвестиции за данный период на основе постоянства сумм периодических платежей и постоянства процентной ставки",
    abstract: "Возвращает сумму платежей по процентам для инвестиции за данный период на основе постоянства сумм периодических платежей и постоянства процентной ставки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BF%D0%BB%D1%82-5cce0ad6-8402-4a41-8d29-61a0b054cb6f"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка за период."
      },
      per: {
        name: "период",
        detail: 'Период, для которого требуется найти платежи по процентам; число в интервале от 1 до "кпер".'
      },
      nper: {
        name: "кпер",
        detail: "Общее количество периодов платежей по аннуитету."
      },
      pv: {
        name: "пс",
        detail: "Приведенная к текущему моменту стоимость, т. е. общая сумма, которая на текущий момент равноценна ряду будущих платежей."
      },
      fv: {
        name: "бс",
        detail: "Значение будущей стоимости, то есть желаемого остатка средств после последней выплаты."
      },
      type: {
        name: "тип",
        detail: "Число 0 или 1, обозначающее срок выплаты."
      }
    }
  },
  IRR: {
    description: "Возвращает внутреннюю ставку доходности для ряда потоков денежных средств, представленных их численными значениями",
    abstract: "Возвращает внутреннюю ставку доходности для ряда потоков денежных средств, представленных их численными значениями",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D1%81%D0%B4-64925eaa-9988-495b-b290-3ad0c163c1bc"
    }],
    functionParameter: {
      values: {
        name: "значения",
        detail: "Массив или ссылка на ячейки, содержащие числа, для которых требуется подсчитать внутреннюю ставку доходности."
      },
      guess: {
        name: "догадка",
        detail: "A number that you guess is close to the result of IRR."
      }
    }
  },
  ISPMT: {
    description: "Вычисляет проценты, выплаченные (или полученные) за указанный период кредита (или инвестиции) с четными основными платежами",
    abstract: "Вычисляет проценты, выплаченные (или полученные) за указанный период кредита (или инвестиции) с четными основными платежами",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%BF%D0%BB%D0%B0%D1%82-fa58adb6-9d39-4ce0-8f43-75399cea56cc"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для инвестиции."
      },
      per: {
        name: "период",
        detail: "Период, в течение которого вы хотите найти интерес, и должен быть в диапазоне от 1 до Кпер."
      },
      nper: {
        name: "кпер",
        detail: "Общее число периодов выплат для данной инвестиции."
      },
      pv: {
        name: "пс",
        detail: "Стоимость инвестиции на текущий момент. Для кредита, Пс является суммой кредита."
      }
    }
  },
  MDURATION: {
    description: "Возвращает модифицированную продолжительность Макалея для ценных бумаг с предполагаемой номинальной стоимостью 100 р",
    abstract: "Возвращает модифицированную продолжительность Макалея для ценных бумаг с предполагаемой номинальной стоимостью 100 р",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B4%D0%BB%D0%B8%D1%82-b3786a69-4f20-469a-94ad-33e5b90a763c"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      coupon: {
        name: "купон",
        detail: "Годовая процентная ставка для купонов по ценным бумагам."
      },
      yld: {
        name: "доход",
        detail: "Годовой доход по ценным бумагам."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  MIRR: {
    description: "Возвращает модифицированную внутреннюю ставку доходности для ряда периодических денежных потоков",
    abstract: "Возвращает модифицированную внутреннюю ставку доходности для ряда периодических денежных потоков",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B2%D1%81%D0%B4-b020f038-7492-4fb4-93c1-35c345b53524"
    }],
    functionParameter: {
      values: {
        name: "значения",
        detail: "Массив или ссылка на ячейки, содержащие числа. Эти числа представляют ряд денежных выплат (отрицательные значения) и поступлений (положительные значения), происходящих в регулярные периоды времени."
      },
      financeRate: {
        name: "cтавка финанс",
        detail: "Ставка процента, выплачиваемого за деньги, находящиеся в обороте."
      },
      reinvestRate: {
        name: "cтавка реинвест",
        detail: "Ставка процента, получаемого при реинвестировании денежных средств."
      }
    }
  },
  NOMINAL: {
    description: "Возвращает номинальную годовую ставку, если заданы эффективная (фактическая) ставка и число периодов в году, за которые начисляются сложные проценты",
    abstract: "Возвращает номинальную годовую ставку, если заданы эффективная (фактическая) ставка и число периодов в году, за которые начисляются сложные проценты",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D0%BC%D0%B8%D0%BD%D0%B0%D0%BB-7f1ae29b-6b92-435e-b950-ad8b190ddd2b"
    }],
    functionParameter: {
      effectRate: {
        name: "эффект ставка",
        detail: "Фактическая процентная ставка"
      },
      npery: {
        name: "количество периодов",
        detail: "Количество периодов в году."
      }
    }
  },
  NPER: {
    description: "Возвращает общее количество периодов выплаты для инвестиции на основе периодических постоянных выплат и постоянной процентной ставки",
    abstract: "Возвращает общее количество периодов выплаты для инвестиции на основе периодических постоянных выплат и постоянной процентной ставки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BF%D0%B5%D1%80-240535b5-6653-4d2d-bfcf-b6a38151d815"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка за период."
      },
      pmt: {
        name: "плт",
        detail: "Выплата, производимая в каждый период; это значение не может меняться в течение всего периода выплат."
      },
      pv: {
        name: "пс",
        detail: "Приведенная к текущему моменту стоимость, т. е. общая сумма, которая на текущий момент равноценна ряду будущих платежей."
      },
      fv: {
        name: "бс",
        detail: "Значение будущей стоимости, то есть желаемого остатка средств после последней выплаты."
      },
      type: {
        name: "тип",
        detail: "Число 0 или 1, обозначающее срок выплаты."
      }
    }
  },
  NPV: {
    description: "Возвращает величину чистой приведенной стоимости инвестиции, используя ставку дисконтирования, а также последовательность будущих выплат (отрицательные значения) и поступлений (положительные значения)",
    abstract: "Возвращает величину чистой приведенной стоимости инвестиции, используя ставку дисконтирования, а также последовательность будущих выплат (отрицательные значения) и поступлений (положительные значения)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%87%D0%BF%D1%81-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%BF%D1%81-8672cb67-2576-4d07-b67b-ac28acf2a568"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Ставка дисконтирования за один период."
      },
      value1: {
        name: "значение1",
        detail: "От 1 до 254 аргументов, представляющих выплаты и поступления."
      },
      value2: {
        name: "значение2",
        detail: "От 1 до 254 аргументов, представляющих выплаты и поступления."
      }
    }
  },
  ODDFPRICE: {
    description: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг для нерегулярного (короткого или длинного) первого периода",
    abstract: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг для нерегулярного (короткого или длинного) первого периода",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%86%D0%B5%D0%BD%D0%B0%D0%BF%D0%B5%D1%80%D0%B2%D0%BD%D0%B5%D1%80%D0%B5%D0%B3-d7d664a8-34df-4233-8d2b-922bcf6a69e1"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      issue: {
        name: "дата выпуска ",
        detail: "Дата выпуска ценных бумаг."
      },
      firstCoupon: {
        name: "первый купон",
        detail: "Дата первой купонной выплаты для ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      yld: {
        name: "доход",
        detail: "Годовой доход по ценным бумагам."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год. Для ежегодных выплат частота равна 1, для полугодовых — 2, для ежеквартальных — 4."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  ODDFYIELD: {
    description: "Возвращает доход по ценным бумагам с нерегулярным (коротким или длинным) первым периодом",
    abstract: "Возвращает доход по ценным бумагам с нерегулярным (коротким или длинным) первым периодом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BF%D0%B5%D1%80%D0%B2%D0%BD%D0%B5%D1%80%D0%B5%D0%B3-66bc8b7b-6501-4c93-9ce3-2fd16220fe37"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      issue: {
        name: "дата выпуска ",
        detail: "Дата выпуска ценных бумаг."
      },
      firstCoupon: {
        name: "первый купон",
        detail: "Дата первой купонной выплаты для ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      pr: {
        name: "цена",
        detail: "Стоимость ценных бумаг."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год. Для ежегодных выплат частота равна 1, для полугодовых — 2, для ежеквартальных — 4."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  ODDLPRICE: {
    description: "Возвращает цену за 100 рублей нарицательной стоимости ценных бумаг для нерегулярного (короткого или длинного) последнего периода купона",
    abstract: "Возвращает цену за 100 рублей нарицательной стоимости ценных бумаг для нерегулярного (короткого или длинного) последнего периода купона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%86%D0%B5%D0%BD%D0%B0%D0%BF%D0%BE%D1%81%D0%BB%D0%BD%D0%B5%D1%80%D0%B5%D0%B3-fb657749-d200-4902-afaf-ed5445027fc4"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      lastInterest: {
        name: "последняя выплата",
        detail: "Дата последней купонной выплаты для ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      yld: {
        name: "доход",
        detail: "Годовой доход по ценным бумагам."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год. Для ежегодных выплат частота равна 1, для полугодовых — 2, для ежеквартальных — 4."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  ODDLYIELD: {
    description: "Возвращает доход по ценным бумагам с нерегулярным (коротким или длинным) последним периодом",
    abstract: "Возвращает доход по ценным бумагам с нерегулярным (коротким или длинным) последним периодом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BF%D0%BE%D1%81%D0%BB%D0%BD%D0%B5%D1%80%D0%B5%D0%B3-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BF%D0%BE%D1%81%D0%BB%D0%BD%D0%B5%D1%80%D0%B5%D0%B3-c873d088-cf40-435f-8d41-c8232fee9238"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      lastInterest: {
        name: "последняя выплата",
        detail: "Дата последней купонной выплаты для ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      pr: {
        name: "цена",
        detail: "Стоимость ценных бумаг."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год. Для ежегодных выплат частота равна 1, для полугодовых — 2, для ежеквартальных — 4."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  PDURATION: {
    description: "Возвращает количество периодов, которые необходимы инвестиции для достижения заданного значения",
    abstract: "Возвращает количество периодов, которые необходимы инвестиции для достижения заданного значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D0%B4%D0%BB%D0%B8%D1%82-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%B4%D0%BB%D0%B8%D1%82-44f33460-5be5-4c90-b857-22308892adaf"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Ставка — процентная ставка за период."
      },
      pv: {
        name: "пс",
        detail: "Пс — стоимость инвестиции на текущий момент."
      },
      fv: {
        name: "бс",
        detail: "Бс — желательная стоимость инвестиции в будущем."
      }
    }
  },
  PMT: {
    description: "Возвращает сумму периодического платежа для аннуитета на основе постоянства сумм платежей и постоянной процентной ставки",
    abstract: "Возвращает сумму периодического платежа для аннуитета на основе постоянства сумм платежей и постоянной процентной ставки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%BB%D1%82-0214da64-9a63-4996-bc20-214433fa6441"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка за период."
      },
      nper: {
        name: "кпер",
        detail: "Общее количество периодов платежей по аннуитету."
      },
      pv: {
        name: "пс",
        detail: "Приведенная к текущему моменту стоимость, т. е. общая сумма, которая на текущий момент равноценна ряду будущих платежей."
      },
      fv: {
        name: "бс",
        detail: "Значение будущей стоимости, то есть желаемого остатка средств после последней выплаты."
      },
      type: {
        name: "тип",
        detail: "Число 0 или 1, обозначающее срок выплаты."
      }
    }
  },
  PPMT: {
    description: "Возвращает величину платежа в погашение основной суммы по инвестиции за данный период на основе постоянных периодических платежей и постоянной процентной ставки",
    abstract: "Возвращает величину платежа в погашение основной суммы по инвестиции за данный период на основе постоянных периодических платежей и постоянной процентной ставки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%81%D0%BF%D0%BB%D1%82-c370d9e3-7749-4ca4-beea-b06c6ac95e1b"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка за период."
      },
      per: {
        name: "период",
        detail: 'Период, для которого требуется найти платежи по процентам; число в интервале от 1 до "кпер".'
      },
      nper: {
        name: "кпер",
        detail: "Общее количество периодов платежей по аннуитету."
      },
      pv: {
        name: "пс",
        detail: "Приведенная к текущему моменту стоимость, т. е. общая сумма, которая на текущий момент равноценна ряду будущих платежей."
      },
      fv: {
        name: "бс",
        detail: "Значение будущей стоимости, то есть желаемого остатка средств после последней выплаты."
      },
      type: {
        name: "тип",
        detail: "Число 0 или 1, обозначающее срок выплаты."
      }
    }
  },
  PRICE: {
    description: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг, по которым выплачивается периодический процент",
    abstract: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг, по которым выплачивается периодический процент",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%86%D0%B5%D0%BD%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%86%D0%B5%D0%BD%D0%B0-3ea9deac-8dfa-436f-a7c8-17ea02c21b0a"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      yld: {
        name: "доход",
        detail: "Годовой доход по ценным бумагам."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год. Для ежегодных выплат частота равна 1, для полугодовых — 2, для ежеквартальных — 4."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  PRICEDISC: {
    description: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг, на которые сделана скидка",
    abstract: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг, на которые сделана скидка",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%86%D0%B5%D0%BD%D0%B0%D1%81%D0%BA%D0%B8%D0%B4%D0%BA%D0%B0-d06ad7c1-380e-4be7-9fd9-75e3079acfd3"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      discount: {
        name: "cкидка",
        detail: "Скидка для ценной бумаги."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  PRICEMAT: {
    description: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг, по которым процент выплачивается в срок погашения",
    abstract: "Возвращает цену за 100 рублей номинальной стоимости ценных бумаг, по которым процент выплачивается в срок погашения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%86%D0%B5%D0%BD%D0%B0%D0%BF%D0%BE%D0%B3%D0%B0%D1%88-52c3b4da-bc7e-476a-989f-a95f675cae77"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      issue: {
        name: "дата выпуска ",
        detail: "Дата выпуска ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      yld: {
        name: "доход",
        detail: "Годовой доход по ценным бумагам."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  PV: {
    description: "Возвращающая приведенную стоимость займа или инвестиции на основе постоянной процентной ставки",
    abstract: "Возвращающая приведенную стоимость займа или инвестиции на основе постоянной процентной ставки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%81-23879d31-0e02-4321-be01-da16e8168cbd"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Процентная ставка за период."
      },
      nper: {
        name: "кпер",
        detail: "Общее количество периодов платежей по аннуитету."
      },
      pmt: {
        name: "плт",
        detail: "Выплата, производимая в каждый период; это значение не может меняться в течение всего периода выплат."
      },
      fv: {
        name: "бс",
        detail: "Значение будущей стоимости, то есть желаемого остатка средств после последней выплаты."
      },
      type: {
        name: "тип",
        detail: "Число 0 или 1, обозначающее срок выплаты."
      }
    }
  },
  RATE: {
    description: "Возвращает процентную ставку за период аннуитета",
    abstract: "Возвращает процентную ставку за период аннуитета",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B0%D0%B2%D0%BA%D0%B0-9f665657-4a7e-4bb7-a030-83fc59e748ce"
    }],
    functionParameter: {
      nper: {
        name: "кпер",
        detail: "Общее количество периодов платежей по аннуитету."
      },
      pmt: {
        name: "плт",
        detail: "Выплата, производимая в каждый период; это значение не может меняться в течение всего периода выплат."
      },
      pv: {
        name: "пс",
        detail: "Приведенная к текущему моменту стоимость, т. е. общая сумма, которая на текущий момент равноценна ряду будущих платежей."
      },
      fv: {
        name: "бс",
        detail: "Значение будущей стоимости, то есть желаемого остатка средств после последней выплаты."
      },
      type: {
        name: "тип",
        detail: "Число 0 или 1, обозначающее срок выплаты."
      },
      guess: {
        name: "догадка",
        detail: "Величина, предположительно близкая к результату"
      }
    }
  },
  RECEIVED: {
    description: "Возвращает сумму, полученную к сроку погашения полностью обеспеченных ценных бумаг",
    abstract: "Возвращает сумму, полученную к сроку погашения полностью обеспеченных ценных бумаг",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%BE%D0%BB%D1%83%D1%87%D0%B5%D0%BD%D0%BE-7a3f8b93-6611-4f81-8576-828312c9b5e5"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      investment: {
        name: "инвестиция",
        detail: "Объем инвестиции в ценные бумаги."
      },
      discount: {
        name: "cкидка",
        detail: "Скидка для ценной бумаги."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  RRI: {
    description: "Возвращает эквивалентную процентную ставку для роста инвестиции",
    abstract: "Возвращает эквивалентную процентную ставку для роста инвестиции",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%8D%D0%BA%D0%B2-%D1%81%D1%82%D0%B0%D0%B2%D0%BA%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%8D%D0%BA%D0%B2-%D1%81%D1%82%D0%B0%D0%B2%D0%BA%D0%B0-6f5822d8-7ef1-4233-944c-79e8172930f4"
    }],
    functionParameter: {
      nper: {
        name: "кпер",
        detail: "Кпер — это количество периодов для инвестиций."
      },
      pv: {
        name: "пс",
        detail: "Пс — стоимость инвестиции на текущий момент."
      },
      fv: {
        name: "бс",
        detail: "Бс — стоимость инвестиции в будущем."
      }
    }
  },
  SLN: {
    description: "Возвращает величину амортизации актива за один период, рассчитанную линейным методом",
    abstract: "Возвращает величину амортизации актива за один период, рассчитанную линейным методом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B0%D0%BF%D0%BB-cdb666e5-c1c6-40a7-806a-e695edc2f1c8"
    }],
    functionParameter: {
      cost: {
        name: "стоимость",
        detail: "Начальная стоимость актива."
      },
      salvage: {
        name: "остаточная стоимость",
        detail: "Стоимость в конце периода амортизации (иногда называемая остаточной стоимостью имущества)."
      },
      life: {
        name: "время эксплуатации",
        detail: "Число периодов амортизации актива (часто называется сроком полезного использования актива)."
      }
    }
  },
  SYD: {
    description: "Возвращает величину амортизации актива за данный период, рассчитанную по сумме чисел лет срока полезного использования",
    abstract: "Возвращает величину амортизации актива за данный период, рассчитанную по сумме чисел лет срока полезного использования",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B0%D1%81%D1%87-069f8106-b60b-4ca2-98e0-2a0f206bdb27"
    }],
    functionParameter: {
      cost: {
        name: "стоимость",
        detail: "Начальная стоимость актива."
      },
      salvage: {
        name: "остаточная стоимость",
        detail: "Стоимость в конце периода амортизации (иногда называемая остаточной стоимостью имущества)."
      },
      life: {
        name: "время эксплуатации",
        detail: "Число периодов амортизации актива (часто называется сроком полезного использования актива)."
      },
      per: {
        name: "период",
        detail: 'Период, измеряемый в тех же единицах, что и аргумент "срок эксплуатации".'
      }
    }
  },
  TBILLEQ: {
    description: "Возвращает эквивалентный облигации доход по казначейскому векселю",
    abstract: "Возвращает эквивалентный облигации доход по казначейскому векселю",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%B0%D0%B2%D0%BD%D0%BE%D0%BA%D1%87%D0%B5%D0%BA-2ab72d90-9b4d-4efe-9fc2-0f81f2c19c8c"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за казначейский вексель."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения казначейского векселя."
      },
      discount: {
        name: "cкидка",
        detail: "Скидка для казначейского векселя."
      }
    }
  },
  TBILLPRICE: {
    description: "Возвращает цену на 100 рублей номинальной стоимости для казначейского векселя",
    abstract: "Возвращает цену на 100 рублей номинальной стоимости для казначейского векселя",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%86%D0%B5%D0%BD%D0%B0%D0%BA%D1%87%D0%B5%D0%BA-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%86%D0%B5%D0%BD%D0%B0%D0%BA%D1%87%D0%B5%D0%BA-eacca992-c29d-425a-9eb8-0513fe6035a2"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за казначейский вексель."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения казначейского векселя."
      },
      discount: {
        name: "cкидка",
        detail: "Скидка для казначейского векселя."
      }
    }
  },
  TBILLYIELD: {
    description: "Возвращает доходность по казначейскому векселю",
    abstract: "Возвращает доходность по казначейскому векселю",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BA%D1%87%D0%B5%D0%BA-6d381232-f4b0-4cd5-8e97-45b9c03468ba"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за казначейский вексель."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения казначейского векселя."
      },
      pr: {
        name: "цена",
        detail: "Цена казначейского векселя в расчете на 100 рублей номинальной стоимости."
      }
    }
  },
  VDB: {
    description: "Возвращает величину амортизации актива для любого выбранного периода, в том числе для частичных периодов, с использованием метода двойного уменьшения остатка или иного указанного метода",
    abstract: "Возвращает величину амортизации актива для любого выбранного периода, в том числе для частичных периодов, с использованием метода двойного уменьшения остатка или иного указанного метода",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%83%D0%BE-dde4e207-f3fa-488d-91d2-66d55e861d73"
    }],
    functionParameter: {
      cost: {
        name: "стоимость",
        detail: "Начальная стоимость актива."
      },
      salvage: {
        name: "остаточная стоимость",
        detail: "Стоимость в конце периода амортизации (иногда называемая остаточной стоимостью имущества)."
      },
      life: {
        name: "время эксплуатации",
        detail: "Количество периодов, за которые собственность амортизируется (иногда называемое периодом амортизации)."
      },
      startPeriod: {
        name: "нач период",
        detail: "Начальный период, для которого вычисляется амортизация."
      },
      endPeriod: {
        name: "кон период",
        detail: "Конечный период, для которого вычисляется амортизация."
      },
      factor: {
        name: "коэффициент",
        detail: "Коэффициент уменьшения остатка. Если коэффициент опущен, он полагается равным 2 (метод удвоенного процента со снижающегося остатка)."
      },
      noSwitch: {
        name: "no_switch",
        detail: "Логическое значение, определяющее, следует ли использовать линейную амортизацию в том случае, когда амортизация превышает величину, рассчитанную методом уменьшающегося остатка."
      }
    }
  },
  XIRR: {
    description: "Возвращает внутреннюю ставку доходности для графика денежных потоков, которые не обязательно носят периодический характер",
    abstract: "Возвращает внутреннюю ставку доходности для графика денежных потоков, которые не обязательно носят периодический характер",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D1%82%D0%B2%D0%BD%D0%B4%D0%BE%D1%85-de1242ec-6477-445b-b11b-a303ad9adc9d"
    }],
    functionParameter: {
      values: {
        name: "значения",
        detail: 'Ряд денежных потоков, соответствующий графику платежей, приведенному в аргументе "даты". Первый платеж является необязательным и соответствует затратам или выплате в начале инвестиции. Если первое значение является затратами или выплатой, оно должно быть отрицательным. Все последующие выплаты дисконтируются на основе 365-дневного года. Ряд значений должен содержать по крайней мере одно положительное и одно отрицательное значение.'
      },
      dates: {
        name: "даты",
        detail: "График дат платежей, который соответствует платежам для денежных потоков. Даты могут встречаться в любом порядке. "
      },
      guess: {
        name: "догадка",
        detail: "Величина, предположительно близкая к результату."
      }
    }
  },
  XNPV: {
    description: "Возвращает чистую приведенную стоимость для денежных потоков, которые не обязательно являются периодическими",
    abstract: "Возвращает чистую приведенную стоимость для денежных потоков, которые не обязательно являются периодическими",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D1%82%D0%BD%D0%B7-1b42bbf6-370f-4532-a0eb-d67c16b664b7"
    }],
    functionParameter: {
      rate: {
        name: "cтавка",
        detail: "Ставка дисконтирования, применяемая к денежным потокам."
      },
      values: {
        name: "значения",
        detail: 'Ряд денежных потоков, соответствующий графику платежей, приведенному в аргументе "даты". Первый платеж является необязательным и соответствует затратам или выплате в начале инвестиции. Если первое значение является затратами или выплатой, оно должно быть отрицательным. Все последующие выплаты дисконтируются на основе 365-дневного года. Ряд значений должен содержать по крайней мере одно положительное и одно отрицательное значение.'
      },
      dates: {
        name: "даты",
        detail: "График дат платежей, который соответствует платежам для денежных потоков. Даты могут встречаться в любом порядке. "
      }
    }
  },
  YIELD: {
    description: "Возвращает доходность ценных бумаг, по которым производятся периодические выплаты процентов",
    abstract: "Возвращает доходность ценных бумаг, по которым производятся периодические выплаты процентов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D1%85%D0%BE%D0%B4-f5f5ca43-c4bd-434f-8bd2-ed3c9727a4fe"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      pr: {
        name: "цена",
        detail: "Цена ценных бумаг на 100 рублей номинальной стоимости."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      frequency: {
        name: "частота",
        detail: "Количество выплат по купонам за год. Для ежегодных выплат частота равна 1, для полугодовых — 2, для ежеквартальных — 4."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  YIELDDISC: {
    description: "Возвращает годовую доходность по ценным бумагам, на которые сделана скидка",
    abstract: "Возвращает годовую доходность по ценным бумагам, на которые сделана скидка",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D1%81%D0%BA%D0%B8%D0%B4%D0%BA%D0%B0-a9dbdbae-7dae-46de-b995-615faffaaed7"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      pr: {
        name: "цена",
        detail: "Цена ценных бумаг на 100 рублей номинальной стоимости."
      },
      redemption: {
        name: "погашение",
        detail: "Выкупная стоимость ценных бумаг на 100 рублей номинальной стоимости."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  },
  YIELDMAT: {
    description: "Возвращает годовую доходность ценных бумаг, по которым проценты выплачиваются при наступлении срока погашения",
    abstract: "Возвращает годовую доходность ценных бумаг, по которым проценты выплачиваются при наступлении срока погашения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BF%D0%BE%D0%B3%D0%B0%D1%88-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D1%85%D0%BE%D0%B4%D0%BF%D0%BE%D0%B3%D0%B0%D1%88-ba7d1809-0d33-4bcb-96c7-6c56ec62ef6f"
    }],
    functionParameter: {
      settlement: {
        name: "дата согл",
        detail: "Дата расчета за ценные бумаги."
      },
      maturity: {
        name: "дата вступления в силу",
        detail: "Срок погашения ценных бумаг."
      },
      issue: {
        name: "дата выпуска ",
        detail: "Дата выпуска ценных бумаг."
      },
      rate: {
        name: "cтавка",
        detail: "Процентная ставка для ценных бумаг."
      },
      pr: {
        name: "цена",
        detail: "Цена ценных бумаг на 100 рублей номинальной стоимости."
      },
      basis: {
        name: "базис",
        detail: "Используемый способ вычисления дня."
      }
    }
  }
};
const locale$9 = {
  CELL: {
    description: "Возвращает сведения о форматировании, расположении или содержимом ячейки",
    abstract: "Возвращает сведения о форматировании, расположении или содержимом ячейки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%8F%D1%87%D0%B5%D0%B9%D0%BA%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%8F%D1%87%D0%B5%D0%B9%D0%BA%D0%B0-51bd39a5-f338-4dbe-a33f-955d67c2b2cf"
    }],
    functionParameter: {
      infoType: {
        name: "тип сведений",
        detail: "Текстовое значение, задающее тип сведений о ячейке при возвращении."
      },
      reference: {
        name: "ссылка",
        detail: "Ячейка, сведения о которой требуется получить."
      }
    }
  },
  ERROR_TYPE: {
    description: "Возвращает номер, соответствующий одному из возможных значений ошибок ",
    abstract: "Возвращает номер, соответствующий одному из возможных значений ошибок ",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%82%D0%B8%D0%BF-%D0%BE%D1%88%D0%B8%D0%B1%D0%BA%D0%B8-10958677-7c8d-44f7-ae77-b9a9ee6eefaa"
    }],
    functionParameter: { errorVal: {
      name: "значение ошибки",
      detail: "Значение ошибки, для которого определяется номер."
    } }
  },
  INFO: {
    description: "Возвращает информацию о текущей операционной среде",
    abstract: "Возвращает информацию о текущей операционной среде",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8%D0%BD%D1%84%D0%BE%D1%80%D0%BC-725f259a-0e4b-49b3-8b52-58815c69acae"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "first"
      },
      number2: {
        name: "число2",
        detail: "second"
      }
    }
  },
  ISBETWEEN: {
    description: "Проверяет, относится ли указанное значение к интервалу между двумя числами (включительно или не включительно)",
    abstract: "Проверяет, относится ли указанное значение к интервалу между двумя числами (включительно или не включительно)",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/10538337?hl=ru&sjid=7730820672019533290-AP"
    }],
    functionParameter: {
      valueToCompare: {
        name: "значение для сравнения",
        detail: 'Значение, которое нужно проверить на принадлежность к интервалу от "наименьшее значение" до "наибольшее значение".'
      },
      lowerValue: {
        name: "наименьшее значение",
        detail: 'Нижняя граница диапазона значений, к которому может относиться значение "значение для сравнения".'
      },
      upperValue: {
        name: "наибольшее значение",
        detail: 'Верхняя граница диапазона значений, к которому может относиться значение "значение для сравнения".'
      },
      lowerValueIsInclusive: {
        name: "наименьшее значение вклюительно",
        detail: 'Указывает, входит ли в диапазон значение "наименьшее значение". Значение по умолчанию: TRUE.'
      },
      upperValueIsInclusive: {
        name: "наибольшее значение вклюительно",
        detail: 'Указывает, входит ли в диапазон значение "наибольшее значение". Значение по умолчанию: TRUE.'
      }
    }
  },
  ISBLANK: {
    description: "Возвращает TRUE, если значение пустое",
    abstract: "Возвращает TRUE, если значение пустое.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISDATE: {
    description: "Определяет, является ли указанное значение датой",
    abstract: "Определяет, является ли указанное значение датой",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/9061381?hl=ru&sjid=2155433538747546473-AP"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое необходимо проверить."
    } }
  },
  ISEMAIL: {
    description: "Проверяет, является ли значение допустимым адресом электронной почты",
    abstract: "Проверяет, является ли значение допустимым адресом электронной почты",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/3256503?hl=ru&sjid=2155433538747546473-AP"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, для которого необходимо проверить, является ли оно адресом электронной почты."
    } }
  },
  ISERR: {
    description: "Возвращает значение TRUE, если значение представляет собой любое значение ошибки, кроме #N/A",
    abstract: "Возвращает значение TRUE, если значение представляет собой любое значение ошибки, кроме #N/A",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISERROR: {
    description: "Возвращает TRUE, если значение является любым значением ошибки.",
    abstract: "Возвращает TRUE, если значение является любым значением ошибки.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISEVEN: {
    description: "Возвращает значение TRUE, если число четное.",
    abstract: "Возвращает значение TRUE, если число четное.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B5%D1%87%D1%91%D1%82%D0%BD-aa15929a-d77b-4fbb-92f4-2f479af55356"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Проверяемое значение. Если число не является целым, оно усекается."
    } }
  },
  ISFORMULA: {
    description: "Возвращает значение TRUE, если значение является формулой",
    abstract: "Возвращает значение TRUE, если значение является формулой",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5%D1%84%D0%BE%D1%80%D0%BC%D1%83%D0%BB%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B5%D1%84%D0%BE%D1%80%D0%BC%D1%83%D0%BB%D0%B0-e4d1355f-7121-4ef2-801e-3839bfd6b1e5"
    }],
    functionParameter: { reference: {
      name: "ссылка",
      detail: 'Аргумент "ссылка" представляет ссылку на ячейку, которую необходимо проверить.'
    } }
  },
  ISLOGICAL: {
    description: "Возвращает TRUE, если значение является логическим значением",
    abstract: "Возвращает TRUE, если значение является логическим значением",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISNA: {
    description: "Возвращает значение TRUE, если значение равно значению ошибки #N/A",
    abstract: "Возвращает значение TRUE, если значение равно значению ошибки #N/A",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISNONTEXT: {
    description: "Возвращает TRUE, если значение не является текстом",
    abstract: "Возвращает TRUE, если значение не является текстом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISNUMBER: {
    description: "Возвращает TRUE, если значение является числом",
    abstract: "Возвращает TRUE, если значение является числом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISODD: {
    description: "Возвращает ИСТИНА, если число нечетное",
    abstract: "Возвращает ИСТИНА, если число нечетное",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B5%D0%BD%D0%B5%D1%87%D1%91%D1%82-1208a56d-4f10-4f44-a5fc-648cafd6c07a"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Проверяемое значение. Если число не является целым, оно усекается."
    } }
  },
  ISOMITTED: {
    description: "Проверяет, отсутствует ли значение в ЛЯМБДА, и возвращает значение True или False",
    abstract: "Проверяет, отсутствует ли значение в ЛЯМБДА, и возвращает значение True или False",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-isomitted-831d6fbc-0f07-40c4-9c5b-9c73fd1d60c1"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "first"
      },
      number2: {
        name: "число2",
        detail: "second"
      }
    }
  },
  ISREF: {
    description: "Возвращает TRUE, если значение является ссылкой",
    abstract: "Возвращает TRUE, если значение является ссылкой",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISTEXT: {
    description: "Возвращает TRUE, если значение является текстом",
    abstract: "Возвращает TRUE, если значение является текстом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-%D0%B5-0f2d7971-6019-40a0-a171-f2d869135665"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое вы хотите проверить. Аргументом «Значение» может быть пустая ячейка, ошибка, логическое значение, текст, число, ссылочное значение или имя, ссылающееся на любой из них."
    } }
  },
  ISURL: {
    description: "Проверяет, является ли значение допустимым URL",
    abstract: "Проверяет, является ли значение допустимым URL.",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/3256501?hl=ru&sjid=7312884847858065932-AP"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, для которого необходимо проверить, является ли оно URL."
    } }
  },
  N: {
    description: "Возвращает значение, преобразованное в число",
    abstract: "Возвращает значение, преобразованное в число",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87-a624cad1-3635-4208-b54a-29733d1278c9"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Значение, которое требуется преобразовать"
    } }
  },
  NA: {
    description: "Возвращает значение ошибки #N/A",
    abstract: "Возвращает значение ошибки #N/A",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B4-5469c2d1-a90c-4fb5-9bbc-64bd9bb6b47c"
    }],
    functionParameter: {}
  },
  SHEET: {
    description: "Возвращает номер листа указанного листа или другой ссылки",
    abstract: "Возвращает номер листа указанного листа или другой ссылки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BB%D0%B8%D1%81%D1%82-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%B8%D1%81%D1%82-44718b6f-8b87-47a1-a9d6-b701c06cff24"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Используйте его, чтобы указать имя листа или ссылку, для которой требуется получить номер листа. В противном случае функция вернет номер листа, содержащего функцию SHEET."
    } }
  },
  SHEETS: {
    description: "Возвращает количество листов в ссылке",
    abstract: "Возвращает количество листов в ссылке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BB%D0%B8%D1%81%D1%82%D1%8B-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%B8%D1%81%D1%82%D1%8B-770515eb-e1e8-45ce-8066-b557e5e4b80b"
    }],
    functionParameter: {}
  },
  TYPE: {
    description: "Возвращает тип значения",
    abstract: "Возвращает тип значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%82%D0%B8%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%82%D0%B8%D0%BF-45b4e688-4bc3-48b3-a105-ffa892995899"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Любое значение, например число, текст, логическое значение и т.д."
    } }
  }
};
const locale$8 = {
  AND: {
    description: "Возвращает TRUE если все проверяемые значения TRUE",
    abstract: "Возвращает TRUE если все проверяемые значения TRUE",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8-5f19b2e8-e1df-4408-897a-ce285a19e9d9"
    }],
    functionParameter: {
      logical1: {
        name: "логическое1",
        detail: "Первое условие, которое вы хотите проверить и которое может быть оценено как TRUE или FALSE."
      },
      logical2: {
        name: "логическое2",
        detail: "Дополнительные условия, которые вы хотите проверить и которые могут быть оценены как TRUE или FALSE, максимум до 255 условий."
      }
    }
  },
  BYCOL: {
    description: "Применяет функцию ЛЯМБДА к каждому столбцу и возвращает массив результатов",
    abstract: "Применяет функцию ЛЯМБДА к каждому столбцу и возвращает массив результатов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-bycol-58463999-7de5-49ce-8f38-b7f7a2192bfb"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, разделенный на столбцы."
      },
      lambda: {
        name: "лямбда",
        detail: "ЛЯМБДА, которая принимает столбец в качестве одного параметра и вычисляет один результат. ЛЯМБДА принимает один параметр: столбец из массива."
      }
    }
  },
  BYROW: {
    description: "Применяет ЛЯМБДА-функцию к каждой строке и возвращает массив результатов",
    abstract: "Применяет ЛЯМБДА-функцию к каждой строке и возвращает массив результатов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-byrow-2e04c677-78c8-4e6b-8c10-a4602f2602bb"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, который будет разделен на строки."
      },
      lambda: {
        name: "лямбда",
        detail: "Функция ЛЯМБДА, которая принимает столбец как единственный параметр и вычисляет один результат. ЛЯМБДА принимает один параметр: строка из массива."
      }
    }
  },
  FALSE: {
    description: "Возвращает логическое значение FALSE.",
    abstract: "Возвращает логическое значение FALSE.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%BE%D0%B6%D1%8C-2d58dfa5-9c03-4259-bf8f-f0ae14346904"
    }],
    functionParameter: {}
  },
  IF: {
    description: "Указывает логический тест для выполнения",
    abstract: "Указывает логический тест для выполнения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5%D1%81%D0%BB%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B5%D1%81%D0%BB%D0%B8-69aed7c9-4e8a-4755-a9bc-aa8bbff73be2"
    }],
    functionParameter: {
      logicalTest: {
        name: "логический тест",
        detail: "Условие, которое вы хотите проверить."
      },
      valueIfTrue: {
        name: "значение истина",
        detail: 'Значение, которое вы хотите вернуть, если результат "логический тест" равен TRUE.'
      },
      valueIfFalse: {
        name: "значение ложь",
        detail: 'Значение, которое вы хотите вернуть, если результат "логический тест" равен FALSE.'
      }
    }
  },
  IFERROR: {
    description: "Возвращает указанное значение, если формула принимает ошибку; в противном случае возвращается результат формулы.",
    abstract: "Возвращает указанное значение, если формула принимает ошибку; в противном случае возвращается результат формулы.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B5%D1%81%D0%BB%D0%B8%D0%BE%D1%88%D0%B8%D0%B1%D0%BA%D0%B0-c526fd07-caeb-47b8-8bb6-63f3e417f611"
    }],
    functionParameter: {
      value: {
        name: "значение",
        detail: "Аргумент, проверяемый на наличие ошибки."
      },
      valueIfError: {
        name: "значение ошибка",
        detail: "Значение, возвращаемое, если формула принимает ошибку. Вычисляются следующие типы ошибок: #N/A, #VALUE!, #REF!, #DIV/0!, #NUM!, #NAME?, или #NULL!."
      }
    }
  },
  IFNA: {
    description: "Функция IFNA возвращает указанное значение, если формула возвращает значение ошибки #N/A; в противном случае возвращается результат формулы",
    abstract: "Функция IFNA возвращает указанное значение, если формула возвращает значение ошибки #N/A; в противном случае возвращается результат формулы",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B5%D1%81%D0%BD%D0%B4-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B5%D1%81%D0%BD%D0%B4-6626c961-a569-42fc-a49d-79b4951fd461"
    }],
    functionParameter: {
      value: {
        name: "значение",
        detail: "Аргумент, проверяемый на наличие ошибки со значением #N/A."
      },
      valueIfNa: {
        name: "значение не применимо",
        detail: "Значение, которое будет возвращено, если в результате выполнения формулы будет получено значение ошибки #N/A."
      }
    }
  },
  IFS: {
    description: "Проверяет соответствие одному или нескольким условиям и возвращает значение для первого условия, принимающего значение TRUE",
    abstract: "Проверяет соответствие одному или нескольким условиям и возвращает значение для первого условия, принимающего значение TRUE",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%83%D1%81%D0%BB%D0%BE%D0%B2%D0%B8%D1%8F-36329a26-37b2-467c-972b-4a39bd951d45"
    }],
    functionParameter: {
      logicalTest1: {
        name: "логический тест1",
        detail: "Условие, которое оценивается как TRUE или FALSE."
      },
      valueIfTrue1: {
        name: "значение истина1",
        detail: 'Результат возвращается, если "логический тест1" имеет значение TRUE. Может быть пустым.'
      },
      logicalTest2: {
        name: "логический тест2",
        detail: "Условие, которое оценивается как TRUE или FALSE."
      },
      valueIfTrue2: {
        name: "значение истина2",
        detail: 'Результат возвращается, если "логический тест1" имеет значение TRUE. Каждое "значение истинаN" соответствует условию "значение истинаN". Может быть пустым.'
      }
    }
  },
  LAMBDA: {
    description: "С помощью функции ЛЯМБДА можно создавать пользовательские функции для повторного использования и вызывать их по понятным именам. Новая функция доступна во всей книге и вызывается так же, как и основные функции Excel.",
    abstract: "С помощью функции ЛЯМБДА можно создавать пользовательские функции для повторного использования и вызывать их по понятным именам",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-lambda-bd212d27-1cd1-4321-a34a-ccbf254b8b67"
    }],
    functionParameter: {
      parameter: {
        name: "параметр",
        detail: "Значение, которое вы хотите передать функции, например ссылку на ячейку, строку или число. Вы можете ввести до 253 параметров."
      },
      calculation: {
        name: "вычисление",
        detail: "Формула, которую необходимо выполнить и вывести в качестве результата выполнения функции. Это должен быть последний аргумент и он должен возвращать результат."
      }
    }
  },
  LET: {
    description: "Присваивает имена результатам вычисления",
    abstract: "Присваивает имена результатам вычисления",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-let-34842dd8-b92b-4d3f-b325-b8b8f9908999"
    }],
    functionParameter: {
      name1: {
        name: "имя1",
        detail: "Первое имя для назначения. Должно начинаться с буквы. Не может быть результатом формулы или конфликтовать с синтаксисом диапазона."
      },
      nameValue1: {
        name: "имя значения1",
        detail: 'Значение, которое присваивается "имя1".'
      },
      calculationOrName2: {
        name: "вычисление или имя2",
        detail: 'Одно из следующих:\n1. Вычисление, использующее все имена в функции LET. Это должен быть последний аргумент функции LET.\n2. Второе имя для присвоения второму аргументу "имя значения". Если имя указано, то "имя значения2" и "вычисление или имя3" становятся обязательными.'
      },
      nameValue2: {
        name: "имя значения2",
        detail: 'Значение, которое присваивается "вычисление или имя2".'
      },
      calculationOrName3: {
        name: "вычисление или имя3",
        detail: 'Одно из следующих:\n1. Вычисление, использующее все имена в функции LET. Последний аргумент функции LET должен быть вычислением.\n2. Третье имя для присвоения третьему "имя значения". Если имя указано, "имя значения3" и "вычисление или имя4" становятся обязательными.'
      }
    }
  },
  MAKEARRAY: {
    description: "Возвращает вычисляемый массив указанной строки и столбца, применяя функцию LAMBDA",
    abstract: "Возвращает вычисляемый массив указанной строки и столбца, применяя функцию LAMBDA",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-makearray-b80da5ad-b338-4149-a523-5b221da09097"
    }],
    functionParameter: {
      number1: {
        name: "строки",
        detail: "Количество строк в массиве. Должно быть больше нуля."
      },
      number2: {
        name: "столбцы",
        detail: "Количество столбцов в массиве. Должно быть больше нуля."
      },
      value3: {
        name: "лямбда",
        detail: "Функция ЛЯМБДА, вызываемая для создания массива. ЛЯМБДА принимает два параметра: индекс строки массива и индекс столбца массива."
      }
    }
  },
  MAP: {
    description: "Возвращает массив, сформированный путем сопоставления каждого значения в массивах с новым значением путем применения функции ЛЯМБДА для создания нового значения",
    abstract: "Возвращает массив, сформированный путем сопоставления каждого значения в массивах с новым значением путем применения функции ЛЯМБДА для создания нового значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-map-48006093-f97c-47c1-bfcc-749263bb1f01"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Массив, который нужно сопоставить."
      },
      array2: {
        name: "массив2",
        detail: "Массив, который нужно сопоставить."
      },
      lambda: {
        name: "лямбда",
        detail: "Функция ЛЯМБДА, которая должна быть последним аргументом и должна содержать параметр для каждого переданного массива или другой массив для сопоставления."
      }
    }
  },
  NOT: {
    description: "Переворачивает логику своего аргумента",
    abstract: "Переворачивает логику своего аргумента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B5-9cfc6011-a054-40c7-a140-cd4ba2d87d77"
    }],
    functionParameter: { logical: {
      name: "логическое",
      detail: "Условие, для которого вы хотите изменить логику, которое может быть оценено как TRUE или FALSE."
    } }
  },
  OR: {
    description: "Возвращает TRUE, если хотя бы один из его аргументов оценивается как TRUE, и возвращает FALSE, если все его аргументы оцениваются как FALSE",
    abstract: "Возвращает TRUE, если хотя бы один из его аргументов оценивается как TRUE",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B8%D0%BB%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8%D0%BB%D0%B8-7d17ad14-8700-4281-b308-00b131e22af0"
    }],
    functionParameter: {
      logical1: {
        name: "логическое1",
        detail: "Первое условие, которое вы хотите проверить и которое может принимать значения TRUE или FALSE."
      },
      logical2: {
        name: "логическое2",
        detail: "Дополнительные условия, которые вы хотите проверить и которые могут быть оценены как TRUE или FALSE, максимум до 255 условий."
      }
    }
  },
  REDUCE: {
    description: "Уменьшает массив до накопленного значения, применяя ЛЯМБДА к каждому значению и возвращая общее значение в аккумулятор",
    abstract: "Уменьшает массив до накопленного значения, применяя ЛЯМБДА к каждому значению и возвращая общее значение в аккумулятор",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-reduce-42e39910-b345-45f3-84b8-0642b568b7cb"
    }],
    functionParameter: {
      initialValue: {
        name: "начальное значение",
        detail: "Задает начальное значение для аккумулятора."
      },
      array: {
        name: "массив",
        detail: "Массив, который нужно сократить."
      },
      lambda: {
        name: "лямбда",
        detail: "Функция ЛЯМБДА, вызываемая для создания массива. ЛЯМБДА принимает три параметра: 1.Суммируемое значение, возвращаемое в качестве конечного результата. 2.The current value from the array. 3.The calculation applied to each element in the array."
      }
    }
  },
  SCAN: {
    description: "Сканирует массив путем применения функции ЛЯМБДА к каждому значению и возвращает массив, содержащий все промежуточные значения",
    abstract: "Сканирует массив путем применения функции ЛЯМБДА к каждому значению и возвращает массив, содержащий все промежуточные значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-scan-d58dfd11-9969-4439-b2dc-e7062724de29"
    }],
    functionParameter: {
      initialValue: {
        name: "начальное значение",
        detail: "Задает начальное значение для аккумулятора."
      },
      array: {
        name: "массив",
        detail: "Массив, который нужно просканировать."
      },
      lambda: {
        name: "лямбда",
        detail: "Функция ЛЯМБДА, вызываемая для создания массива. ЛЯМБДА принимает три параметра: 1.Суммируемое значение, возвращаемое в качестве конечного результата. 2.The current value from the array. 3.The calculation applied to each element in the array."
      }
    }
  },
  SWITCH: {
    description: "Вычисляет значение (которое называют выражением) на основе списка значений и возвращает результат, соответствующий первому совпадающему значению. Если совпадения не обнаружены, может быть возвращено необязательное стандартное значение",
    abstract: "Вычисляет значение (которое называют выражением) на основе списка значений и возвращает результат, соответствующий первому совпадающему значению. Если совпадения не обнаружены, может быть возвращено необязательное стандартное значение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/switch-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-switch-47ab33c0-28ce-4530-8a45-d532ec4aa25e"
    }],
    functionParameter: {
      expression: {
        name: "выражение",
        detail: "Выражение — это значение (например, число, дата или текст), которое будет сравниваться со значением1-значением126."
      },
      value1: {
        name: "значение1",
        detail: "ЗначениеN — это значение, которое будет сравниваться с выражением."
      },
      result1: {
        name: "результат1",
        detail: "РезультатN — это значение, которое возвращается, когда соответствующий аргумент значениеN совпадает с выражением. ResultN должен быть указан для каждого соответствующего аргумента значениеN."
      },
      defaultOrValue2: {
        name: "по умолчанию или значение2",
        detail: 'Значение по умолчанию возвращается, если в выражениях значениеN не найдено совпадений. Аргумент "значение по умолчанию" определяется отсутствием соответствующего выражения значениеN. Значение по умолчанию должно быть последним аргументом функции.'
      },
      result2: {
        name: "результат2",
        detail: "РезультатN — это значение, которое возвращается, когда соответствующий аргумент значениеN совпадает с выражением. ResultN должен быть указан для каждого соответствующего аргумента значениеN."
      }
    }
  },
  TRUE: {
    description: "Возвращает логическое значение TRUE",
    abstract: "Возвращает логическое значение TRUE",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8%D1%81%D1%82%D0%B8%D0%BD%D0%B0-7652c6e3-8987-48d0-97cd-ef223246b3fb"
    }],
    functionParameter: {}
  },
  XOR: {
    description: "Возвращает логический исключающий или всех аргументов",
    abstract: "Возвращает логический исключающий или всех аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B8%D1%81%D0%BA%D0%BB%D0%B8%D0%BB%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8%D1%81%D0%BA%D0%BB%D0%B8%D0%BB%D0%B8-1548d4c2-5e47-4f77-9a92-0533bba14f37"
    }],
    functionParameter: {
      logical1: {
        name: "логическое1",
        detail: "Первое условие, которое вы хотите проверить и которое может принимать значения TRUE или FALSE."
      },
      logical2: {
        name: "логическое2",
        detail: "Дополнительные условия, которые вы хотите проверить и которые могут принимать значения TRUE или FALSE, максимум до 255 условий."
      }
    }
  }
};
const locale$7 = {
  ADDRESS: {
    description: "Можно использовать для получения адреса ячейки на листе по номерам строки и столбца. Например, функция ADDRESS(2;3) возвращает значение $C$2. Еще один пример: функция ADDRESS(77;300) возвращает значение $KN$77. Чтобы передать функции ADDRESS номера строки и столбца в качестве ее аргументов, можно использовать другие функции.",
    abstract: "Можно использовать для получения адреса ячейки на листе по номерам строки и столбца",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B0%D0%B4%D1%80%D0%B5%D1%81-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B0%D0%B4%D1%80%D0%B5%D1%81-d0c26c0d-3991-446b-8de4-ab46431d4f89"
    }],
    functionParameter: {
      row_num: {
        name: "номер строки",
        detail: "Номер строки, используемый в ссылке на ячейку."
      },
      column_num: {
        name: "номер столбца",
        detail: "Номер столбца, используемый в ссылке на ячейку."
      },
      abs_num: {
        name: "тип ссылки",
        detail: "Задает тип возвращаемой ссылки."
      },
      a1: {
        name: "стиль ссылки",
        detail: "Логическое значение, которое определяет тип ссылок: А1 или R1C1. При использовании ссылок типа А1 столбцы обозначаются буквами, а строки — цифрами. При использовании ссылок типа R1C1 и столбцы, и строки обозначаются цифрами. Если аргумент А1 имеет значение TRUE или опущен, то функция ADDRESS возвращает ссылку типа А1; если этот аргумент имеет значение FALSE, функция ADDRESS возвращает ссылку типа R1C1."
      },
      sheet_text: {
        name: "имя листа",
        detail: 'Текстовое значение, определяющее имя листа, которое используется для формирования внешней ссылки. Например, формула =ADDRESS(1;1;;;"Лист2") возвращает значение Лист2!$A$1. Если аргумент имя_листа отсутствует, имя листа не используется, и адрес, возвращаемый функцией, ссылается на ячейку текущего листа.'
      }
    }
  },
  AREAS: {
    description: "Возвращает количество областей в ссылке",
    abstract: "Возвращает количество областей в ссылке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D0%B8-8392ba32-7a41-43b3-96b0-3695d2ec6152"
    }],
    functionParameter: { reference: {
      name: "ссылка",
      detail: "Ссылка на ячейку или диапазон ячеек, которая может указывать на несколько областей."
    } }
  },
  CHOOSE: {
    description: "Использует номер_индекса, чтобы выбрать и вернуть значение из списка аргументов-значений",
    abstract: "Использует номер_индекса, чтобы выбрать и вернуть значение из списка аргументов-значений",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D1%8B%D0%B1%D0%BE%D1%80-fc5c184f-cb62-4ec7-a46e-38653b98f5bc"
    }],
    functionParameter: {
      indexNum: {
        name: "номер индекса",
        detail: "Номер выбираемого аргумента-значения. Номер индекса должен быть числом от 1 до 254, формулой или ссылкой на ячейку, содержащую число в диапазоне от 1 до 254."
      },
      value1: {
        name: "значение1",
        detail: 'Функция CHOOSE выбирает значение или действие для выполнения на основе аргумента "номер индекса". Аргументами могут быть числа, ссылки на ячейки, определённые имена, формулы, функции или текст.'
      },
      value2: {
        name: "значение2",
        detail: "От 1 до 254 аргументов значений."
      }
    }
  },
  CHOOSECOLS: {
    description: "Возвращает указанные столбцы из массива",
    abstract: "Возвращает указанные столбцы из массива",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D1%8B%D0%B1%D0%BE%D1%80%D1%81%D1%82%D0%BE%D0%BB%D0%B1%D1%86-bf117976-2722-4466-9b9a-1c01ed9aebff"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, содержащий столбцы, которые должны быть возвращены в новом массиве."
      },
      colNum1: {
        name: "номер столбца1",
        detail: "Первый возвращаемый столбец."
      },
      colNum2: {
        name: "номер столбца2",
        detail: "Дополнительные столбцы, которые необходимо вернуть."
      }
    }
  },
  CHOOSEROWS: {
    description: "Возвращает указанные строки из массива",
    abstract: "Возвращает указанные строки из массива",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-chooserows-51ace882-9bab-4a44-9625-7274ef7507a3"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, содержащий столбцы, которые должны быть возвращены в новом массиве."
      },
      rowNum1: {
        name: "номер строки1",
        detail: "Первый возвращаемый номер строки."
      },
      rowNum2: {
        name: "номер строки2",
        detail: "Номера дополнительных возвращаемых строк."
      }
    }
  },
  COLUMN: {
    description: "Возвращает номер столбца заданного ссылка на ячейку",
    abstract: "Возвращает номер столбца заданного ссылка на ячейку",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%82%D0%BE%D0%BB%D0%B1%D0%B5%D1%86-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%BE%D0%BB%D0%B1%D0%B5%D1%86-44e8c754-711c-4df3-9da4-47a55042554b"
    }],
    functionParameter: { reference: {
      name: "ссылка",
      detail: "чейка или диапазон ячеек, для которого требуется возвратить номер столбца."
    } }
  },
  COLUMNS: {
    description: "Возвращает количество столбцов в массив или ссылке",
    abstract: "Возвращает количество столбцов в массив или ссылке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%87%D0%B8%D1%81%D0%BB%D1%81%D1%82%D0%BE%D0%BB%D0%B1-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D0%BB%D1%81%D1%82%D0%BE%D0%BB%D0%B1-4e8e7b4e-e603-43e8-b177-956088fa48ca"
    }],
    functionParameter: { array: {
      name: "массив",
      detail: "Массив, формула массива или ссылка на диапазон ячеек, для которых требуется определить количество столбцов."
    } }
  },
  DROP: {
    description: "Исключает указанное количество строк или столбцов из начала или конца массива",
    abstract: "Исключает указанное количество строк или столбцов из начала или конца массива",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-drop-1cb4e151-9e17-4838-abe5-9ba48d8c6a34"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, из которого нужно удалить строки или столбцы."
      },
      rows: {
        name: "строки",
        detail: "Количество строк для удаления. Отрицательное значение означает удаление с конца массива."
      },
      columns: {
        name: "столбцы",
        detail: "Количество столбцов для исключения. Отрицательное значение означает удаление с конца массива."
      }
    }
  },
  EXPAND: {
    description: "Расширяет или заполняет массив до указанных размеров строк и столбцов",
    abstract: "Расширяет или заполняет массив до указанных размеров строк и столбцов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-expand-7433fba5-4ad1-41da-a904-d5d95808bc38"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, который нужно расширить."
      },
      rows: {
        name: "строки",
        detail: "Количество строк в расширенном массиве. Если аргумент отсутствует, строки не расширяются."
      },
      columns: {
        name: "столбцы",
        detail: "Количество столбцов в расширенном массиве. Если аргумент отсутствует, столбцы не расширяются."
      },
      padWith: {
        name: "заполняющее значение",
        detail: "Значение, используемое для заполнения. Значение по умолчанию — #N/A."
      }
    }
  },
  FILTER: {
    description: "Позволяет выполнять фильтрацию диапазона данных на основе условий, которые вы определяете",
    abstract: "Позволяет выполнять фильтрацию диапазона данных на основе условий, которые вы определяете",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D0%B8%D0%BB%D1%8C%D1%82%D1%80-f4f7cb66-82eb-4767-8f7c-4877ad80c759"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон для фильтрации."
      },
      include: {
        name: "включить",
        detail: "Массив логических переменных с аналогичной высотой или шириной, что и массив."
      },
      ifEmpty: {
        name: "если пусто",
        detail: "Значение, возвращаемое, если все значения во включенном массиве пустые."
      }
    }
  },
  FORMULATEXT: {
    description: "Возвращает формулу в виде строки",
    abstract: "Возвращает формулу в виде строки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84-%D1%82%D0%B5%D0%BA%D1%81%D1%82-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84-%D1%82%D0%B5%D0%BA%D1%81%D1%82-0a786771-54fd-4ae2-96ee-09cda35439c8"
    }],
    functionParameter: { reference: {
      name: "ссылка",
      detail: "Ссылка на ячейку или диапазон ячеек."
    } }
  },
  GETPIVOTDATA: {
    description: "Возвращает видимые данные из сводной таблицы",
    abstract: "Возвращает видимые данные из сводной таблицы",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%BE%D0%BB%D1%83%D1%87%D0%B8%D1%82%D1%8C-%D0%B4%D0%B0%D0%BD%D0%BD%D1%8B%D0%B5-%D1%81%D0%B2%D0%BE%D0%B4%D0%BD%D0%BE%D0%B9-%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86%D1%8B-8c083b99-a922-4ca0-af5e-3af55960761f"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  HLOOKUP: {
    description: "Выполняет поиск значения в первой строке таблицы или массив значений и возвращает значение, находящееся в том же столбце в заданной строке таблицы или массива",
    abstract: "Выполняет поиск значения в первой строке таблицы или массив значений и возвращает значение, находящееся в том же столбце в заданной строке таблицы или массива.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B3%D0%BF%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%BF%D1%80-a3034eec-b719-4ba3-bb65-e1ad662ed95f"
    }],
    functionParameter: {
      lookupValue: {
        name: "искомое значение",
        detail: 'Значение, которое требуется найти в первой строке таблицы. "искомое значение" может быть значением, ссылкой или текстовой строкой.'
      },
      tableArray: {
        name: "таблица",
        detail: "Таблица, в которой производится поиск данных. Можно использовать ссылку на диапазон или имя диапазона."
      },
      rowIndexNum: {
        name: "номер строки",
        detail: 'Номер строки в аргументе "таблица", из которой будет возвращено соответствующее значение.'
      },
      rangeLookup: {
        name: "интервальный просмотр",
        detail: "Логическое значение, которое определяет, какое соответствие должна искать функция ГПР — точное или приблизительное."
      }
    }
  },
  HSTACK: {
    description: "Добавляет массивы последовательно по горизонтали, чтобы вернуть больший массив",
    abstract: "Добавляет массивы последовательно по горизонтали, чтобы вернуть больший массив",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D1%81%D1%82%D0%BE%D0%BB%D0%B1%D0%B8%D0%BA-98c4ab76-10fe-4b4f-8d5f-af1c125fe8c2"
    }],
    functionParameter: {
      array1: {
        name: "массив",
        detail: "Массивы, которые нужно добавить."
      },
      array2: {
        name: "массив",
        detail: "Массивы, которые нужно добавить."
      }
    }
  },
  HYPERLINK: {
    description: "Создает гиперссылку в ячейке.",
    abstract: "Создает гиперссылку в ячейке.",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/3093313?sjid=14131674310032162335-NC&hl=ru"
    }],
    functionParameter: {
      url: {
        name: "ссылка",
        detail: "Полный URL-адрес, заключенный в кавычки, или адрес ячейки, содержащей URL-адрес."
      },
      linkLabel: {
        name: "текст ссылки",
        detail: "Заключенный в кавычки текст, отображаемый в ячейке в виде гиперссылки, или ссылка на ячейку, содержащую такой текст."
      }
    }
  },
  IMAGE: {
    description: "Вставляет изображения в ячейки из источника вместе с замещающим текстом",
    abstract: "Вставляет изображения в ячейки из источника вместе с замещающим текстом",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8%D0%B7%D0%BE%D0%B1%D1%80%D0%B0%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5-7e112975-5e52-4f2a-b9da-1d913d51f5d5"
    }],
    functionParameter: {
      source: {
        name: "источник",
        detail: "Путь в виде URL-адреса с использованием протокола HTTPS к файлу изображения."
      },
      altText: {
        name: "замещающий_текст",
        detail: "Замещающий текст, описывающий изображение для специальных возможностей."
      },
      sizing: {
        name: "размер",
        detail: "Указывает размеры изображения."
      },
      height: {
        name: "высота",
        detail: "Настраиваемая высота изображения в пикселях."
      },
      width: {
        name: "ширина",
        detail: "Настраиваемая ширина изображения в пикселях."
      }
    }
  },
  INDEX: {
    description: "Возвращает значение элемента в таблице или массиве, выбранное по индексам номеров строк и столбцов",
    abstract: "Возвращает значение элемента в таблице или массиве, выбранное по индексам номеров строк и столбцов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B8%D0%BD%D0%B4%D0%B5%D0%BA%D1%81-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B8%D0%BD%D0%B4%D0%B5%D0%BA%D1%81-a5dcf0dd-996d-40a4-a822-b56b061328bd"
    }],
    functionParameter: {
      reference: {
        name: "ссылка",
        detail: "Ссылка на один или несколько диапазонов ячеек."
      },
      rowNum: {
        name: "номер строки",
        detail: 'Номер строки в диапазоне, заданном аргументом "ссылка", из которого требуется возвратить ссылку.'
      },
      columnNum: {
        name: "номер столбца",
        detail: 'Номер столбца в диапазоне, заданном аргументом "ссылка", из которого требуется возвратить ссылку.'
      },
      areaNum: {
        name: "номер зоны",
        detail: 'Выбирает диапазон в ссылке, из которого возвращается пересечение "номер строки" и "номер столбца".'
      }
    }
  },
  INDIRECT: {
    description: "Возвращает ссылку, заданную текстовой строкой. Ссылки немедленно вычисляются для вывода их содержимого.",
    abstract: "Возвращает ссылку, заданную текстовой строкой",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B2%D1%81%D1%81%D1%8B%D0%BB-474b3a3a-8a26-4f44-b491-92b6306fa261"
    }],
    functionParameter: {
      refText: {
        name: "ссыока на текст",
        detail: "Ссылка на ячейку, которая содержит ссылку в стиле А1 или R1C1, имя, определенное как ссылка, или ссылку на ячейку в виде текстовой строки."
      },
      a1: {
        name: "a1",
        detail: 'Логическое значение, определяющее тип ссылки, содержащейся в ячейке "ссылка на текст".'
      }
    }
  },
  LOOKUP: {
    description: "Используется когда нужно взять одну строку или столбец и найти значение, находящееся в той же позиции в другой строке или столбце",
    abstract: "Ищет значения в векторе или массиве",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%BE%D1%81%D0%BC%D0%BE%D1%82%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%81%D0%BC%D0%BE%D1%82%D1%80-446d94af-663b-451d-8251-369d5e3864cb"
    }],
    functionParameter: {
      lookupValue: {
        name: "искомое значение",
        detail: 'Значение, которое функция ПРОСМОТР ищет в первом векторе. "искомое значение" может быть числом, текстом, логическим значением, именем или ссылкой на значение.'
      },
      lookupVectorOrArray: {
        name: "просматриваемый вектор",
        detail: "Диапазон, состоящий из одной строки или одного столбца."
      },
      resultVector: {
        name: "результат вектора",
        detail: "Диапазон, содержащий только одну строку или столбец."
      }
    }
  },
  MATCH: {
    description: "Выполняет поиск указанного элемента в диапазоне ячеек и возвращает относительную позицию этого элемента в диапазоне",
    abstract: "Ищет значения в ссылке или массиве",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%BE%D0%B8%D1%81%D0%BA%D0%BF%D0%BE%D0%B7-e8dffd45-c762-47d6-bf89-533f4a37673a"
    }],
    functionParameter: {
      lookupValue: {
        name: "искомое значение",
        detail: 'Значение, которое сопоставляется со значениями в аргументе "просматриваемый массив".'
      },
      lookupArray: {
        name: "просматриваемый массив",
        detail: "Диапазон ячеек, в которых производится поиск."
      },
      matchType: {
        name: "тип сопоставления",
        detail: "Число -1, 0 или 1."
      }
    }
  },
  OFFSET: {
    description: "Возвращает ссылку на диапазон, отстоящий от ячейки или диапазона ячеек на заданное число строк и столбцов",
    abstract: "Возвращает ссылку на диапазон, отстоящий от ячейки или диапазона ячеек на заданное число строк и столбцов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D0%BC%D0%B5%D1%89-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BC%D0%B5%D1%89-c8de19ae-dd79-4b9b-a14e-b4d906d11b66"
    }],
    functionParameter: {
      reference: {
        name: "ссылка",
        detail: "Ссылка, от которой вычисляется смещение."
      },
      rows: {
        name: "строки",
        detail: "Количество строк, которые требуется отсчитать вверх или вниз, чтобы левая верхняя ячейка результата ссылалась на нужную ячейку."
      },
      cols: {
        name: "столбцы",
        detail: "Количество столбцов, которые требуется отсчитать влево или вправо, чтобы левая верхняя ячейка результата ссылалась на нужную ячейку."
      },
      height: {
        name: "высота",
        detail: 'Высота возвращаемой ссылки. Значение аргумента "высота" должно быть положительным числом.'
      },
      width: {
        name: "ширина",
        detail: ' Ширина возвращаемой ссылки. Значение аргумента "ширина" должно быть положительным числом.'
      }
    }
  },
  ROW: {
    description: "Возвращает номер строки, определяемой ссылкой",
    abstract: "Возвращает номер строки, определяемой ссылкой",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%80%D0%BE%D0%BA%D0%B0-3a63b74a-c4d0-4093-b49a-e76eb49a6d8d"
    }],
    functionParameter: { reference: {
      name: "ссылка",
      detail: "Ячейка или диапазон ячеек, для которых требуется вернуть номер строки."
    } }
  },
  ROWS: {
    description: "Возвращает количество строк в ссылке или массив",
    abstract: "Возвращает количество строк в ссылке или массив",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%87%D1%81%D1%82%D1%80%D0%BE%D0%BA-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D1%81%D1%82%D1%80%D0%BE%D0%BA-b592593e-3fc2-47f2-bec1-bda493811597"
    }],
    functionParameter: { array: {
      name: "массив",
      detail: "Массив, формула массива или ссылка на диапазон ячеек, для которых требуется определить число строк."
    } }
  },
  RTD: {
    description: "Получает данные реального времени из программы, поддерживающей автоматизацию COM",
    abstract: "Получает данные реального времени из программы, поддерживающей автоматизацию COM.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D1%80%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D1%80%D0%B2-e0cc001a-56f0-470a-9b19-9455dc0eb593"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  SORT: {
    description: "Сортирует содержимое диапазона или массива",
    abstract: "Сортирует содержимое диапазона или массива",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BE%D1%80%D1%82-22f63bd0-ccc8-492f-953d-c20e8e44b86c"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Диапазон или массив для сортировки."
      },
      sortIndex: {
        name: "индекс сортировки",
        detail: "Число, указывающее строку или столбец, по которым нужно выполнить сортировку."
      },
      sortOrder: {
        name: "порядок сортировки",
        detail: "Число, указывающее нужный порядок сортировки: 1 для сортировки по возрастанию (по умолчанию), -1 для сортировки по убыванию."
      },
      byCol: {
        name: "по столбцу",
        detail: "Логическое значение, указывающее нужное направление сортировки: FALSE для сортировки по строкам (по умолчанию), TRUE для сортировки по столбцам."
      }
    }
  },
  SORTBY: {
    description: "Cортирует содержимое диапазона или массива на основе значений в соответствующем диапазоне или массиве",
    abstract: "Cортирует содержимое диапазона или массива на основе значений в соответствующем диапазоне или массиве",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D0%BE%D1%80%D1%82%D0%BF%D0%BE-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BE%D1%80%D1%82%D0%BF%D0%BE-cd2d7a62-1b93-435c-b561-d6a35134f28f"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон для сортировки."
      },
      byArray1: {
        name: "по массиву1",
        detail: "Массив или диапазон для сортировки."
      },
      sortOrder1: {
        name: "порядок сортировки1",
        detail: "Порядок, используемый для сортировки. 1 — для сортировки по возрастанию, -1 для сортировки по убыванию. Значение по умолчанию — по возрастанию."
      },
      byArray2: {
        name: "по массиву2",
        detail: "Массив или диапазон для сортировки."
      },
      sortOrder2: {
        name: "порядок сортировки2",
        detail: "Порядок, используемый для сортировки. 1 — для сортировки по возрастанию, -1 для сортировки по убыванию. Значение по умолчанию — по возрастанию."
      }
    }
  },
  TAKE: {
    description: "Возвращает указанное количество непрерывных строк или столбцов с начала или конца массива",
    abstract: "Возвращает указанное количество непрерывных строк или столбцов с начала или конца массива",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-take-25382ff1-5da1-4f78-ab43-f33bd2e4e003"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, из которого нужно взять строки или столбцы."
      },
      rows: {
        name: "строки",
        detail: "Количество строк, которые нужно взять. Отрицательное значение означает взятие с конца массива."
      },
      columns: {
        name: "столбцы",
        detail: "Количество столбцов, которые нужно взять. Отрицательное значение означает взятие с конца массива."
      }
    }
  },
  TOCOL: {
    description: "Возвращает массив в одном столбце",
    abstract: "Возвращает массив в одном столбце",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-tocol-22839d9b-0b55-4fc1-b4e6-2761f8f122ed"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или ссылка, возвращаемая в виде столбца."
      },
      ignore: {
        name: "игнорировать",
        detail: "Следует ли игнорировать определенные типы значений. По умолчанию значения не игнорируются. Укажите один из следующих вариантов:\n0 Сохранить все значения (по умолчанию)\n1 Игнорировать пустые ячейки\n2 Игнорировать ошибки\n3 Игнорировать пустые ячейки и ошибки"
      },
      scanByColumn: {
        name: "сканировать по столбцам",
        detail: "Сканировать массив по столбцам. По умолчанию массив сканируется по строкам. Сканирование определяет, упорядочены ли значения по строке или по столбцу."
      }
    }
  },
  TOROW: {
    description: "Возвращает массив в одной строке",
    abstract: "Возвращает массив в одной строке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D1%81%D1%82%D1%80%D0%BE%D0%BA%D1%83-b90d0964-a7d9-44b7-816b-ffa5c2fe2289"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: " Массив или ссылка, возвращаемая в виде строки."
      },
      ignore: {
        name: "игнорировать",
        detail: "Следует ли игнорировать определенные типы значений. По умолчанию значения не игнорируются. Укажите один из следующих вариантов:\n0 Сохранить все значения (по умолчанию)\n1 Игнорировать пустые ячейки\n2 Игнорировать ошибки\n3 Игнорировать пустые ячейки и ошибки"
      },
      scanByColumn: {
        name: "сканировать по столбцам",
        detail: "Сканировать массив по столбцам. По умолчанию массив сканируется по строкам. Сканирование определяет, упорядочены ли значения по строке или по столбцу."
      }
    }
  },
  TRANSPOSE: {
    description: "Возвращает транспонированный массив",
    abstract: "Возвращает транспонированный массив",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%82%D1%80%D0%B0%D0%BD%D1%81%D0%BF-ed039415-ed8a-4a81-93e9-4b6dfac76027"
    }],
    functionParameter: { array: {
      name: "массив",
      detail: "Массив (диапазон ячеек) на листе, который нужно транспонировать."
    } }
  },
  UNIQUE: {
    description: "Возвращение уникальных значений из списка значений",
    abstract: "Возвращение уникальных значений из списка значений",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%83%D0%BD%D0%B8%D0%BA-c5ab87fd-30a3-4ce9-9d1a-40204fb85e1e"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Диапазон или массив, из которого возвращаются уникальные строки или столбцы."
      },
      byCol: {
        name: "по столбцу",
        detail: "Логическое значение: сравнивает строки друг с другом и возвращает уникальные значения = FALSE, или опускается; сравнивает столбцы друг с другом и возвращает уникальные значения = TRUE."
      },
      exactlyOnce: {
        name: "ровно один раз",
        detail: "Логическое значение: возвращает строки или столбцы из массива, которые встречаются только один раз = TRUE; возвращает все отдельные строки или столбцы из массива = FALSE или было пропущено."
      }
    }
  },
  VLOOKUP: {
    description: "Находите данные по строкам в таблице или диапазоне с помощью функции VLOOKUP. Например, можно найти цену автомобильной детали по ее номеру или найти имя сотрудника по его идентификатору.",
    abstract: "Просматривает первый столбец массива и перемещается по строке, чтобы вернуть значение ячейки.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D0%BF%D1%80-0bbc8083-26fe-4963-8ab8-93a18ad188a1"
    }],
    functionParameter: {
      lookupValue: {
        name: "искомое значение",
        detail: 'Значение для поиска. Искомое значение должно находиться в первом столбце диапазона ячеек, указанного в аргументе "таблица".'
      },
      tableArray: {
        name: "таблица",
        detail: 'Диапазон ячеек, в котором будет выполнен поиск "искомого значения" и возвращаемого значения с помощью функции VLOOKUP.'
      },
      colIndexNum: {
        name: "номер столбца",
        detail: 'Номер столбца (начиная с 1 для крайнего левого столбца "таблицы"), содержащий возвращаемое значение.'
      },
      rangeLookup: {
        name: "интервальный просмотр",
        detail: "Логическое значение, которое указывает, нужно ли, чтобы функция VLOOKUP нашла приблизительное или точное совпадение: приблизительное совпадение — 1/TRUE, точное совпадение — 0/FALSE"
      }
    }
  },
  VSTACK: {
    description: "Добавляет массивы по вертикали и последовательно, чтобы вернуть больший массив",
    abstract: "Добавляет массивы по вертикали и последовательно, чтобы вернуть больший массив",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D1%81%D1%82%D0%BE%D0%BB%D0%B1%D0%B8%D0%BA-a4b86897-be0f-48fc-adca-fcc10d795a9c"
    }],
    functionParameter: {
      array1: {
        name: "массив",
        detail: "Массивы, которые нужно добавить."
      },
      array2: {
        name: "массив",
        detail: "Массивы, которые нужно добавить."
      }
    }
  },
  WRAPCOLS: {
    description: "Оборачивает заданную строку или столбец значений столбцами после указанного количества элементов, чтобы сформировать новый массив",
    abstract: "Оборачивает заданную строку или столбец значений столбцами после указанного количества элементов, чтобы сформировать новый массив",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-wrapcols-d038b05a-57b7-4ee0-be94-ded0792511e2"
    }],
    functionParameter: {
      vector: {
        name: "вектор",
        detail: "Вектор или ссылка для переноса."
      },
      wrapCount: {
        name: "количество для переноса",
        detail: " Максимальное количество значений для каждого столбца."
      },
      padWith: {
        name: "заполняющее значение",
        detail: "Значение, используемое для заполнения. Значение по умолчанию: #N/A."
      }
    }
  },
  WRAPROWS: {
    description: "Переносит предоставленную строку или столбец значений по строкам после указанного количества элементов, чтобы сформировать новый массив",
    abstract: "Переносит предоставленную строку или столбец значений по строкам после указанного количества элементов, чтобы сформировать новый массив",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-wraprows-796825f3-975a-4cee-9c84-1bbddf60ade0"
    }],
    functionParameter: {
      vector: {
        name: "вектор",
        detail: "Вектор или ссылка для переноса."
      },
      wrapCount: {
        name: "количество для переноса",
        detail: "Максимальное количество значений для каждой строки."
      },
      padWith: {
        name: "заполняющее значение",
        detail: "Значение, используемое для заполнения. Значение по умолчанию: #N/A."
      }
    }
  },
  XLOOKUP: {
    description: "Находите данные по строкам в таблице или диапазоне с помощью функции XLOOKUP. Например, можно найти цену автомобильной детали по ее номеру или найти имя сотрудника по его идентификатору",
    abstract: "Находите данные по строкам в таблице или диапазоне с помощью функции XLOOKUP. Например, можно найти цену автомобильной детали по ее номеру или найти имя сотрудника по его идентификатору",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%81%D0%BC%D0%BE%D1%82%D1%80x-b7fd680e-6d10-43e6-84f9-88eae8bf5929"
    }],
    functionParameter: {
      lookupValue: {
        name: "искомое значение",
        detail: 'Значение для поиска. Если этот параметр опущен, функция XLOOKUP возвращает пустые ячейки, которые он находит в "просматриваемый массив".'
      },
      lookupArray: {
        name: "просматриваемый массив",
        detail: "Массив или диапазон для поиска."
      },
      returnArray: {
        name: "возвращаемый массив",
        detail: "Возвращаемый массив или диапазон."
      },
      ifNotFound: {
        name: "если не найдено",
        detail: 'Если допустимое совпадение не найдено, верните текст "если не найдено", который вы указали. Если допустимое совпадение не найдено и "если не найдено" отсутствует, возвращается #N/A.'
      },
      matchMode: {
        name: "режим сопоставления",
        detail: "Укажите тип соответствия: 0 — Точное совпадение. Если ничего не найдено, вернуть #N/A. Это значение по умолчанию. -1 — Точное совпадение. Если ничего не найдено, вернуть следующий меньший элемент. 1 — Точное совпадение. Если ничего не найдено, вернуть следующий больший элемент. 2 — Подстановочное совпадение, где *, ? и ~ имеют особое значение."
      },
      searchMode: {
        name: "режим поиска",
        detail: 'Укажите используемый режим поиска: 1 — Выполнить поиск, начиная с первого элемента. Это значение по умолчанию. -1 — Выполнить обратный поиск, начиная с последнего элемента. 2 — Выполнить бинарный поиск, основанный на сортировке "просматриваемый массив" по возрастанию. Если не отсортировано, будут возвращены недействительные результаты. -2 — Выполнить бинарный поиск, основанный на сортировке "просматриваемый массив" по убыванию. Если не отсортировано, будут возвращены недействительные результаты.'
      }
    }
  },
  XMATCH: {
    description: "Выполняет поиск указанного элемента в массиве или диапазоне ячеек и возвращает относительную позицию элемента",
    abstract: "Возвращает относительную позицию элемента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%BE%D0%B8%D1%81%D0%BA%D0%BF%D0%BE%D0%B7x-d966da31-7a6b-4a13-a1c6-5a33ed6a0312"
    }],
    functionParameter: {
      lookupValue: {
        name: "искомое значение",
        detail: "Искомое значение."
      },
      lookupArray: {
        name: "просматриваемый массив",
        detail: "Массив или диапазон для поиска."
      },
      matchMode: {
        name: "режим сопоставления",
        detail: "Укажите тип соответствия:\n0 — Точное совпадение (по умолчанию)\n-1 — Точное совпадение или следующий наименьший элемент\n1 — Точное совпадение или следующий наибольший элемент\n2 — Подстановочное совпадение, где *, ? и ~ имеют особое значение."
      },
      searchMode: {
        name: "режим поиска",
        detail: "Укажите тип поиска:\n1 — Поиск от первого к последнему (по умолчанию).\n-1 — Поиск от последнего к первому (обратный поиск).\n2 — Выполнить двоичный поиск, основанный на сортировке lookup_array по возрастанию. Если не отсортировано, будут возвращены недействительные результаты.\n-2 — Выполнить двоичный поиск, основанный на сортировке lookup_array по убыванию. Если не отсортировано, будут возвращены недействительные результаты."
      }
    }
  }
};
const locale$6 = {
  ABS: {
    description: "Возвращает абсолютную величину числа. Абсолютная величина числа  — это число без знака",
    abstract: "Возвращает абсолютную величину числа. ",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-abs-3420200f-5628-4e8c-99da-c99d7c87713c"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Вещественное число, абсолютное значение которого необходимо найти."
    } }
  },
  ACOS: {
    description: 'Возвращает арккосинус числа. Арккосинус числа — это угол, косинус которого равен числу. Угол определяется в радианах в интервале от 0 до "пи"',
    abstract: "Возвращает арккосинус числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-acos-cb73173f-d089-4582-afa1-76e5524b5d5b"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Косинус искомого угла; значение должно находиться в диапазоне от -1 до 1."
    } }
  },
  ACOSH: {
    description: "Возвращает гиперболический арккосинус числа. Число должно быть больше или равно 1. Гиперболический арккосинус числа — это значение, гиперболический косинус которого равен числу, следовательно, ACOSH(COSH(число)) равняется числу",
    abstract: "Возвращает гиперболический арккосинус числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-acosh-e3992cc1-103f-4e72-9f04-624b9ef5ebfe"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественное число, большее или равное 1."
    } }
  },
  ACOT: {
    description: "Возвращает главное значение арккотангенса, или обратного котангенса, числа",
    abstract: "Возвращает главное значение арккотангенса, или обратного котангенса, числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/acot-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-acot-dc7e5008-fe6b-402e-bdd6-2eea8383d905"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Число ― это котангенс искомого угла. Он должен быть действительным числом."
    } }
  },
  ACOTH: {
    description: "Возвращает гиперболический арккотангенс числа",
    abstract: "Возвращает гиперболический арккотангенс числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/acoth-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-acoth-cc49480f-f684-4171-9fc5-73e4e852300f"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Абсолютное значение Числа должно быть больше 1."
    } }
  },
  AGGREGATE: {
    description: "Возвращает агрегатный результат вычислений по списку или базе данных",
    abstract: "Возвращает агрегатный результат вычислений по списку или базе данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B0%D0%B3%D1%80%D0%B5%D0%B3%D0%B0%D1%82-43b9278e-6aa7-4f17-92b6-e19993fa26df"
    }],
    functionParameter: {
      functionNum: {
        name: "номер_функции",
        detail: "Число от 1 до 19, определяющее функцию, которую необходимо использовать."
      },
      options: {
        name: "параметры",
        detail: "Числовое значение, определяющее, какие значения при вычислении функции следует пропускать."
      },
      ref1: {
        name: "ссылка1",
        detail: "Первый числовой аргумент для функций, которые принимают несколько числовых аргументов, для которых требуется агрегированное значение."
      },
      ref2: {
        name: "ссылка2",
        detail: "Числовые аргументы от 2 до 252, для которых необходимо вычислить агрегатное значение."
      }
    }
  },
  ARABIC: {
    description: "Преобразует римское число в арабское",
    abstract: "Преобразует римское число в арабское",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B0%D1%80%D0%B0%D0%B1%D1%81%D0%BA%D0%BE%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B0%D1%80%D0%B0%D0%B1%D1%81%D0%BA%D0%BE%D0%B5-9a8da418-c17b-4ef9-a657-9370a30a674f"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: 'Строка, ограниченная кавычками, пустая строка ("") или ссылка на ячейку, содержащую текст.'
    } }
  },
  ASIN: {
    description: "Возвращает арксинус числа",
    abstract: "Возвращает арксинус числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-asin-81fb95e5-6d6f-48c4-bc45-58f955c6d347"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Синус искомого угла; значение должно находиться в диапазоне от -1 до 1."
    } }
  },
  ASINH: {
    description: "Возвращает гиперболический арксинус числа",
    abstract: "Возвращает гиперболический арксинус числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-asinh-4e00475a-067a-43cf-926a-765b0249717c"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественное число."
    } }
  },
  ATAN: {
    description: "Возвращает арктангенс числа",
    abstract: "Возвращает арктангенс числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-atan-50746fa8-630a-406b-81d0-4a2aed395543"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Тангенс искомого угла."
    } }
  },
  ATAN2: {
    description: "Возвращает арктангенс для заданных координат x и y",
    abstract: "Возвращает арктангенс для заданных координат x и y",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-atan2-c04592ab-b9e3-4908-b428-c96b3a565033"
    }],
    functionParameter: {
      xNum: {
        name: "x",
        detail: "X-координата точки."
      },
      yNum: {
        name: "y",
        detail: "Y-координата точки."
      }
    }
  },
  ATANH: {
    description: "Возвращает гиперболический арктангенс числа",
    abstract: "Возвращает гиперболический арктангенс числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-atanh-3cd65768-0de7-4f1d-b312-d01c8c930d90"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественное число в интервале от -1 до 1."
    } }
  },
  BASE: {
    description: "Преобразует число в текстовое представление с указанным основанием системы счисления",
    abstract: "Преобразует число в текстовое представление с указанным основанием системы счисления",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%81%D0%BD%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5-2ef61411-aee9-4f29-a811-1c42456c6342"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, которое нужно преобразовать. Должен быть целым числом, большим или равным 0, но меньшим 2^53."
      },
      radix: {
        name: "основание",
        detail: "Основание системы счисления, в которую нужно преобразовать число. Должен быть целым числом, большим или равным 2, но меньшим 36."
      },
      minLength: {
        name: "минимальная длина.",
        detail: "Минимальная длина возвращаемой строки. Должен быть целым числом, меньшим или равным 0."
      }
    }
  },
  CEILING: {
    description: "Возвращает результат округления с избытком до ближайшего числа, кратного значению точности",
    abstract: "Возвращает результат округления с избытком до ближайшего числа, кратного значению точности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D0%B2%D0%B2%D0%B5%D1%80%D1%85-0a5cd7c8-0720-4f0a-bd2c-c943e510899f"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое значение."
      },
      significance: {
        name: "точность",
        detail: "Кратное, до которого требуется округлить значение."
      }
    }
  },
  CEILING_MATH: {
    description: "Округляет число до ближайшего целого числа или, при необходимости, до ближайшего кратного значения",
    abstract: "Округляет число до ближайшего целого числа или, при необходимости, до ближайшего кратного значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BE%D0%BA%D1%80%D0%B2%D0%B2%D0%B5%D1%80%D1%85-%D0%BC%D0%B0%D1%82-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D0%B2%D0%B2%D0%B5%D1%80%D1%85-%D0%BC%D0%B0%D1%82-80f95d2f-b499-4eee-9f16-f795a8e306c8"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое значение."
      },
      significance: {
        name: "точность",
        detail: "Кратное, до которого требуется округлить значение."
      },
      mode: {
        name: "режим",
        detail: "Определяет, округляются ли отрицательные числа к нулю или от них. "
      }
    }
  },
  CEILING_PRECISE: {
    description: "Округляет число вверх до ближайшего целого или до ближайшего кратного указанному значению. Число округляется до большего значения вне зависимости от его знака",
    abstract: "Округляет число вверх до ближайшего целого или до ближайшего кратного указанному значению. Число округляется до большего значения вне зависимости от его знака",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D0%B2%D0%B2%D0%B5%D1%80%D1%85-%D1%82%D0%BE%D1%87%D0%BD-f366a774-527a-4c92-ba49-af0a196e66cb"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое значение."
      },
      significance: {
        name: "точность",
        detail: "Кратное, до которого требуется округлить значение."
      }
    }
  },
  COMBIN: {
    description: "Возвращает количество комбинаций для заданного числа элементов",
    abstract: "Возвращает количество комбинаций для заданного числа элементов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D0%BB%D0%BA%D0%BE%D0%BC%D0%B1-12a3f276-0a21-423a-8de6-06990aaf638a"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Количество элементов."
      },
      numberChosen: {
        name: "число выбранных",
        detail: "Количество элементов в каждой комбинации."
      }
    }
  },
  COMBINA: {
    description: "Возвращает количество комбинаций (с повторениями) для заданного числа элементов",
    abstract: "Возвращает количество комбинаций (с повторениями) для заданного числа элементов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%87%D0%B8%D1%81%D0%BB%D0%BA%D0%BE%D0%BC%D0%B1%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B8%D1%81%D0%BB%D0%BA%D0%BE%D0%BC%D0%B1%D0%B0-efb49eaa-4f4c-4cd2-8179-0ddfcf9d035d"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Количество элементов."
      },
      numberChosen: {
        name: "число выбранных",
        detail: "Количество элементов в каждой комбинации."
      }
    }
  },
  COS: {
    description: "Возвращает косинус заданного угла",
    abstract: "Возвращает косинус заданного угла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-cos-0fb808a5-95d6-4553-8148-22aebdce5f05"
    }],
    functionParameter: { number: {
      name: "число",
      detail: " Угол в радианах, для которого определяется косинус."
    } }
  },
  COSH: {
    description: "Возвращает гиперболический косинус числа",
    abstract: "Возвращает гиперболический косинус числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-cosh-e460d426-c471-43e8-9540-a57ff3b70555"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественное число, для которого требуется найти гиперболический косинус."
    } }
  },
  COT: {
    description: "Возвращает значение котангенса заданного угла в радианах",
    abstract: "Возвращает значение котангенса заданного угла в радианах",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/cot-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-cot-c446f34d-6fe4-40dc-84f8-cf59e5f5e31a"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Угол в радианах, для которого определяется котангенс."
    } }
  },
  COTH: {
    description: "Возвращает гиперболический котангенс гиперболического угла",
    abstract: "Возвращает гиперболический котангенс гиперболического угла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/coth-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-coth-2e0b4cb6-0ba0-403e-aed4-deaa71b49df5"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественные число, для которого вы хотите найти гиперболический котангенс."
    } }
  },
  CSC: {
    description: "Возвращает значение косеканса заданного угла в радианах",
    abstract: "Возвращает значение косеканса заданного угла в радианах",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/csc-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-csc-07379361-219a-4398-8675-07ddc4f135c1"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Угол в радианах, для которого требуется вычислить косеканс"
    } }
  },
  CSCH: {
    description: "Возвращает значение гиперболического косеканса заданного угла в радианах",
    abstract: "Возвращает значение гиперболического косеканса заданного угла в радианах",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/csch-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-csch-f58f2c22-eb75-4dd6-84f4-a503527f8eeb"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Угол в радианах, для которого требуется найти гиперболический косеканс."
    } }
  },
  DECIMAL: {
    description: "Преобразует текстовое представление числа с указанным основанием в десятичное число",
    abstract: "Преобразует текстовое представление числа с указанным основанием в десятичное число",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%B5%D1%81-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B5%D1%81-ee554665-6176-46ef-82de-0a283658da2e"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Длина строки текста должна быть меньше или равна 255 символам."
      },
      radix: {
        name: "основание",
        detail: "Основание системы счисления, в которую нужно преобразовать число. Должен быть целым числом, большим или равным 2, но меньшим 36."
      }
    }
  },
  DEGREES: {
    description: "Преобразует радианы в градусы",
    abstract: "Преобразует радианы в градусы",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D1%80%D0%B0%D0%B4%D1%83%D1%81%D1%8B-4d6ec4db-e694-4b94-ace0-1cc3f61f9ba1"
    }],
    functionParameter: { angle: {
      name: "угол",
      detail: "Угол в радианах, который необходимо преобразовать в градусы."
    } }
  },
  EVEN: {
    description: "Возвращает число, округленное до ближайшего четного целого",
    abstract: "Возвращает число, округленное до ближайшего четного целого.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D1%91%D1%82%D0%BD-197b5f06-c795-4c1e-8696-3c3b8a646cf9"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Округляемое значение."
    } }
  },
  EXP: {
    description: "Возвращает число e, возведенное в указанную степень",
    abstract: "Возвращает число e, возведенное в указанную степень",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-exp-c578f034-2c45-4c37-bc8c-329660a63abe"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Показатель степени, в которую возводится основание e."
    } }
  },
  FACT: {
    description: "Возвращает факториал числа",
    abstract: "Возвращает факториал числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D0%B0%D0%BA%D1%82%D1%80-ca8588c2-15f2-41c0-8e8c-c11bd471a4f3"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Неотрицательное число, для которого вычисляется факториал. Если число не является целым, оно усекается."
    } }
  },
  FACTDOUBLE: {
    description: "Возвращает двойной факториал числа",
    abstract: "Возвращает двойной факториал числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B2%D1%84%D0%B0%D0%BA%D1%82%D1%80-e67697ac-d214-48eb-b7b7-cce2589ecac8"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Значение, для которого вычисляется двойной факториал. Если число не является целым, оно усекается."
    } }
  },
  FLOOR: {
    description: "Округляет указанное число до ближайшего указанного кратного значения",
    abstract: "Округляет указанное число до ближайшего указанного кратного значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D0%B2%D0%BD%D0%B8%D0%B7-14bb497c-24f2-4e04-b327-b0b4de5a8886"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое значение."
      },
      significance: {
        name: "точность",
        detail: "Кратное, до которого требуется округлить значение."
      }
    }
  },
  FLOOR_MATH: {
    description: "Округляет число в меньшую сторону до ближайшего целого или до ближайшего кратного указанному значению",
    abstract: "Округляет число в меньшую сторону до ближайшего целого или до ближайшего кратного указанному значению",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BE%D0%BA%D1%80%D0%B2%D0%BD%D0%B8%D0%B7-%D0%BC%D0%B0%D1%82-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D0%B2%D0%BD%D0%B8%D0%B7-%D0%BC%D0%B0%D1%82-c302b599-fbdb-4177-ba19-2c2b1249a2f5"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое значение."
      },
      significance: {
        name: "точность",
        detail: "Кратное, до которого требуется округлить значение."
      },
      mode: {
        name: "режим",
        detail: "Определяет, округляются ли отрицательные числа к нулю или от них. "
      }
    }
  },
  FLOOR_PRECISE: {
    description: "Возвращает число, округленное с недостатком до ближайшего целого или до ближайшего кратного разрядности. Число округляется с недостатком независимо от знака",
    abstract: "Возвращает число, округленное с недостатком до ближайшего целого или до ближайшего кратного разрядности.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D0%B2%D0%BD%D0%B8%D0%B7-%D1%82%D0%BE%D1%87%D0%BD-f769b468-1452-4617-8dc3-02f842a0702e"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое значение."
      },
      significance: {
        name: "точность",
        detail: "Кратное, до которого требуется округлить значение."
      }
    }
  },
  GCD: {
    description: "Возвращает наибольший общий делитель двух или более целых чисел",
    abstract: "Возвращает наибольший общий делитель двух или более целых чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D0%B4-d5107a51-69e3-461f-8e4c-ddfc21b5073a"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Чтобы найти первое число наибольшего общего делителя, вы также можете использовать один массив или ссылку на массив вместо параметров, разделенных запятыми."
      },
      number2: {
        name: "число2",
        detail: "Второе число, наибольший общий делитель которого требуется найти. Таким образом можно указать до 255 чисел."
      }
    }
  },
  INT: {
    description: "Округляет число до ближайшего меньшего целого",
    abstract: "Округляет число до ближайшего меньшего целого",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%86%D0%B5%D0%BB%D0%BE%D0%B5-a6c4af9e-356d-4369-ab6a-cb1fd9d343ef"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Вещественное число, округляемое до ближайшего меньшего целого."
    } }
  },
  ISO_CEILING: {
    description: "Округляет число вверх до ближайшего целого или до ближайшего кратного указанному значению",
    abstract: "Округляет число вверх до ближайшего целого или до ближайшего кратного указанному значению",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/iso-%D0%BE%D0%BA%D1%80%D0%B2%D0%B2%D0%B5%D1%80%D1%85-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-iso-%D0%BE%D0%BA%D1%80%D0%B2%D0%B2%D0%B5%D1%80%D1%85-e587bb73-6cc2-4113-b664-ff5b09859a83"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  LCM: {
    description: "Возвращает наименьшее общее кратное целых чисел",
    abstract: "Возвращает наименьшее общее кратное целых чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D0%BA-7152b67a-8bb5-4075-ae5c-06ede5563c94"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Чтобы найти первое число наименьшего общего кратного, вы также можете использовать один массив или ссылку на массив вместо параметров, разделенных запятыми."
      },
      number2: {
        name: "число2",
        detail: "Второе число, наименьшее общее кратное которого требуется найти. Таким образом можно указать до 255 чисел."
      }
    }
  },
  LET: {
    description: "Функция LET присваивает имена результатам вычисления. Это позволяет сохранять промежуточные расчеты, значения и определять имена в формуле",
    abstract: "Функция LET присваивает имена результатам вычисления",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-let-34842dd8-b92b-4d3f-b325-b8b8f9908999"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  LN: {
    description: "Возвращает натуральный логарифм числа",
    abstract: "Возвращает натуральный логарифм числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-ln-81fe1ed7-dac9-4acd-ba1d-07a142c6118f"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Положительное вещественное число, для которого вычисляется натуральный логарифм."
    } }
  },
  LOG: {
    description: "Возвращает логарифм числа по заданному основанию",
    abstract: "Возвращает логарифм числа по заданному основанию",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-log-4e82f196-1ca9-4747-8fb0-6c4a3abb3280"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Положительное вещественное число, для которого вычисляется логарифм."
      },
      base: {
        name: "base",
        detail: 'Основание логарифма. Если аргумент "основание" опущен, предполагается, что он равен 10.'
      }
    }
  },
  LOG10: {
    description: "Возвращает десятичный логарифм числа",
    abstract: "Возвращает десятичный логарифм числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-log10-c75b881b-49dd-44fb-b6f4-37e3486a0211"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Положительное вещественное число, для которого вычисляется десятичный логарифм."
    } }
  },
  MDETERM: {
    description: "Возвращает определитель матрицы",
    abstract: "Возвращает определитель матрицы",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BE%D0%BF%D1%80%D0%B5%D0%B4-e7bfa857-3834-422b-b871-0ffd03717020"
    }],
    functionParameter: { array: {
      name: "массив",
      detail: "Числовой массив с равным количеством строк и столбцов."
    } }
  },
  MINVERSE: {
    description: "Возвращает обратную матрицу для матрицы, хранящейся в массиве.",
    abstract: "Возвращает обратную матрицу для матрицы, хранящейся в массиве.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BE%D0%B1%D1%80-11f55086-adde-4c9f-8eb9-59da2d72efc6"
    }],
    functionParameter: { array: {
      name: "массив",
      detail: "Числовой массив с равным количеством строк и столбцов."
    } }
  },
  MMULT: {
    description: "Возвращает матричное произведение двух массивов",
    abstract: "Возвращает матричное произведение двух массивов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D1%83%D0%BC%D0%BD%D0%BE%D0%B6-40593ed7-a3cd-4b6b-b9a3-e4ad3c7245eb"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Перемножаемые массивы."
      },
      array2: {
        name: "массив2",
        detail: "Перемножаемые массивы."
      }
    }
  },
  MOD: {
    description: 'Возвращает остаток от деления аргумента "число" на значение аргумента "делитель". Результат имеет тот же знак, что и делитель',
    abstract: 'Возвращает остаток от деления аргумента "число" на значение аргумента "делитель"',
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%81%D1%82%D0%B0%D1%82-9b6cd169-b6ee-406a-a97b-edf2a9dc24f3"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, остаток от деления которого требуется определить."
      },
      divisor: {
        name: "делитель",
        detail: "Число, на которое нужно разделить (делитель)."
      }
    }
  },
  MROUND: {
    description: "Возвращает число, округленное до нужного кратного",
    abstract: "Возвращает число, округленное до нужного кратного",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D1%83%D0%B3%D0%BB%D1%82-c299c3b0-15a5-426d-aa4b-d2d5b3baf427"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое значение."
      },
      multiple: {
        name: "точность",
        detail: "Точность, с которой требуется округлить число."
      }
    }
  },
  MULTINOMIAL: {
    description: "Возвращает отношение факториала суммы значений к произведению факториалов",
    abstract: "Возвращает отношение факториала суммы значений к произведению факториалов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D1%83%D0%BB%D1%8C%D1%82%D0%B8%D0%BD%D0%BE%D0%BC-6fa6373c-6533-41a2-a45e-a56db1db1bf6"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое значение или диапазон для использования в расчетах."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные значения или диапазоны для использования в расчетах."
      }
    }
  },
  MUNIT: {
    description: "Возвращает матрицу единиц измерения для указанного измерения",
    abstract: "Возвращает матрицу единиц измерения для указанного измерения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%B5%D0%B4%D0%B8%D0%BD-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B5%D0%B4%D0%B8%D0%BD-c9fe916a-dc26-4105-997d-ba22799853a3"
    }],
    functionParameter: { dimension: {
      name: "измерение",
      detail: "Размерность — это целое число, определяющее размерность единичной матрицы, которую необходимо возвратить. Она возвращает массив. Размерность должна быть больше нуля."
    } }
  },
  ODD: {
    description: "Возвращает число, округленное до ближайшего нечетного целого",
    abstract: "Возвращает число, округленное до ближайшего нечетного целого.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B5%D1%87%D1%91%D1%82-deae64eb-e08a-4c88-8b40-6d0b42575c98"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Округляемое значение."
    } }
  },
  PI: {
    description: 'Возвращает число "пи"',
    abstract: 'Возвращает число "пи"',
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%B8-264199d0-a3ba-46b8-975a-c4a04608989b"
    }],
    functionParameter: {}
  },
  POWER: {
    description: "Возвращает результат возведения числа в степень",
    abstract: "Возвращает результат возведения числа в степень",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B5%D0%BF%D0%B5%D0%BD%D1%8C-d3f2908b-56f4-4c3f-895a-07fb519c362a"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Базовый номер. Это может быть любое реальное число."
      },
      power: {
        name: "power",
        detail: "Показатель степени, в которую возводится основание."
      }
    }
  },
  PRODUCT: {
    description: "Перемножает все числа, переданные как аргументы, и возвращает произведение",
    abstract: "Перемножает все числа, переданные как аргументы",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D0%B8%D0%B7%D0%B2%D0%B5%D0%B4-8e6b5b24-90ee-4650-aeec-80982a0512ce"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый множитель или диапазон множителей."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные множители или диапазоны множителей. Аргументов может быть не более 255."
      }
    }
  },
  QUOTIENT: {
    description: "Возвращает целую часть результата деления с остатком",
    abstract: "Возвращает целую часть результата деления с остатком",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%87%D0%B0%D1%81%D1%82%D0%BD%D0%BE%D0%B5-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B0%D1%81%D1%82%D0%BD%D0%BE%D0%B5-9f7bf099-2a18-4282-8fa4-65290cc99dee"
    }],
    functionParameter: {
      numerator: {
        name: "числитель",
        detail: "Делимое."
      },
      denominator: {
        name: "знаменатель",
        detail: "Делитель."
      }
    }
  },
  RADIANS: {
    description: "Преобразует градусы в радианы",
    abstract: "Преобразует градусы в радианы",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%B0%D0%B4%D0%B8%D0%B0%D0%BD%D1%8B-ac409508-3d48-45f5-ac02-1497c92de5bf"
    }],
    functionParameter: { angle: {
      name: "угол",
      detail: "Величина угла в градусах, которую требуется преобразовать."
    } }
  },
  RAND: {
    description: "Возвращает равномерно распределенное случайное вещественное число, большее или равное 0, но меньшее 1",
    abstract: "Возвращает равномерно распределенное случайное вещественное число, большее или равное 0, но меньшее 1",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BB%D1%87%D0%B8%D1%81-4cbfa695-8869-4788-8d90-021ea9f5be73"
    }],
    functionParameter: {}
  },
  RANDARRAY: {
    description: "Возвращает массив случайных чисел. Вы можете указать количество заполняемых строк и столбцов, минимальное и максимальное значения, а также какие значения необходимо возвращать: целые или десятичные",
    abstract: "Возвращает массив случайных чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D0%BB%D1%83%D1%87%D0%BC%D0%B0%D1%81%D1%81%D0%B8%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BB%D1%83%D1%87%D0%BC%D0%B0%D1%81%D1%81%D0%B8%D0%B2-21261e55-3bec-4885-86a6-8b0a47fd4d33"
    }],
    functionParameter: {
      rows: {
        name: "строки",
        detail: "Количество возвращаемых строк."
      },
      columns: {
        name: "столбцы",
        detail: "Количество возвращаемых столбцов."
      },
      min: {
        name: "минимум",
        detail: "Минимальное число, которое нужно вернуть."
      },
      max: {
        name: "максимум",
        detail: "Максимальное число, которое нужно вернуть."
      },
      wholeNumber: {
        name: "целое число",
        detail: "Возврат целого числа или десятичного значения"
      }
    }
  },
  RANDBETWEEN: {
    description: "Возвращает случайное целое число, находящееся в диапазоне между двумя заданными числами",
    abstract: "Возвращает случайное целое число, находящееся в диапазоне между двумя заданными числами",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BB%D1%83%D1%87%D0%BC%D0%B5%D0%B6%D0%B4%D1%83-4cc7f0d1-87dc-4eb7-987f-a469ab381685"
    }],
    functionParameter: {
      bottom: {
        name: "нижняя граница",
        detail: "Наименьшее целое число, которое возвращает функция RANDBETWEEN"
      },
      top: {
        name: "верхняя граница ",
        detail: "Наибольшее целое число, которое возвращает функция RANDBETWEEN"
      }
    }
  },
  ROMAN: {
    description: "Преобразует арабское число в римское в текстовом формате",
    abstract: "Преобразует арабское число в римское в текстовом формате",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%B8%D0%BC%D1%81%D0%BA%D0%BE%D0%B5-d6b0b99e-de46-4704-a518-b45a0f8b56f5"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Преобразуемое арабское число."
      },
      form: {
        name: "форма",
        detail: "Число, указывающее нужный тип римской цифры. Римский стиль числовых значений варьируется от классического до упрощенного, становясь более кратким по мере увеличения значения формы."
      }
    }
  },
  ROUND: {
    description: "Округляет число до указанного количества дробных разрядов",
    abstract: "Округляет число до указанного количества дробных разрядов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D1%83%D0%B3%D0%BB-c018c5d8-40fb-4053-90b1-b3e7f61a213c"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое числовое значение."
      },
      numDigits: {
        name: "число разрядов",
        detail: "Количество дробных разрядов, до которого требуется округлить число."
      }
    }
  },
  ROUNDBANK: {
    description: "Округляет число по банковскому методу",
    abstract: "Округляет число по банковскому методу",
    links: [{
      title: "Инструкция",
      url: ""
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, которое вы хотите округлить по банковскому методу."
      },
      numDigits: {
        name: "число разрядов",
        detail: "Количество цифр, до которого вы хотите округлить число при банковском округлении."
      }
    }
  },
  ROUNDDOWN: {
    description: "Округляет число до ближайшего меньшего по модулю значения",
    abstract: "Округляет число до ближайшего меньшего по модулю значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BE%D0%BA%D1%80%D1%83%D0%B3%D0%BB%D0%B2%D0%BD%D0%B8%D0%B7-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D1%83%D0%B3%D0%BB%D0%B2%D0%BD%D0%B8%D0%B7-2ec94c73-241f-4b01-8c6f-17e6d7968f53"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое числовое значение."
      },
      numDigits: {
        name: "число разрядов",
        detail: "Количество дробных разрядов, до которого требуется округлить число."
      }
    }
  },
  ROUNDUP: {
    description: "Округляет число до ближайшего большего по модулю",
    abstract: "Округляет число до ближайшего большего по модулю",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BE%D0%BA%D1%80%D1%83%D0%B3%D0%BB%D0%B2%D0%B2%D0%B5%D1%80%D1%85-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D0%BA%D1%80%D1%83%D0%B3%D0%BB%D0%B2%D0%B2%D0%B5%D1%80%D1%85-f8bc9b23-e795-47db-8703-db171d0c42a7"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Округляемое числовое значение."
      },
      numDigits: {
        name: "число разрядов",
        detail: "Количество дробных разрядов, до которого требуется округлить число."
      }
    }
  },
  SEC: {
    description: "Возвращает секанс угла",
    abstract: "Возвращает секанс угла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/sec-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-sec-ff224717-9c87-4170-9b58-d069ced6d5f7"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Число — угол в радианах, для которого определяется секанс."
    } }
  },
  SECH: {
    description: "Возвращает гиперболический секанс угла",
    abstract: "Возвращает гиперболический секанс угла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/sech-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-sech-e05a789f-5ff7-4d7f-984a-5edb9b09556f"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Число — угол в радианах, для которого определяется гиперболический секанс."
    } }
  },
  SERIESSUM: {
    description: "Возвращает сумму степенного ряда, вычисленную по формуле",
    abstract: "Возвращает сумму степенного ряда, вычисленную по формуле",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%80%D1%8F%D0%B4-%D1%81%D1%83%D0%BC%D0%BC-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D1%8F%D0%B4-%D1%81%D1%83%D0%BC%D0%BC-a3ab25b5-1093-4f5b-b084-96c49087f637"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение переменной степенного ряда."
      },
      n: {
        name: "n",
        detail: "Показатель степени x для первого члена степенного ряда."
      },
      m: {
        name: "m",
        detail: "Шаг, на который увеличивается показатель степени n для каждого следующего члена степенного ряда."
      },
      coefficients: {
        name: "коэффициенты",
        detail: "Набор коэффициентов при соответствующих степенях x."
      }
    }
  },
  SEQUENCE: {
    description: "Позволяет создать список последовательных чисел в массиве, например 1, 2, 3, 4.",
    abstract: "Позволяет создать список последовательных чисел в массиве, например 1, 2, 3, 4.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2-57467a98-57e0-4817-9f14-2eb78519ca90"
    }],
    functionParameter: {
      rows: {
        name: "строки",
        detail: "Количество возвращаемых строк."
      },
      columns: {
        name: "столбцы",
        detail: "Количество возвращаемых столбцов."
      },
      start: {
        name: "начало",
        detail: "Первое число в последовательности."
      },
      step: {
        name: "шаг",
        detail: "Величина приращения каждого последующего значения в массиве."
      }
    }
  },
  SIGN: {
    description: "Определяет знак числа",
    abstract: "Определяет знак числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B7%D0%BD%D0%B0%D0%BA-109c932d-fcdc-4023-91f1-2dd0e916a1d8"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественное число."
    } }
  },
  SIN: {
    description: "Возвращает синус заданного угла",
    abstract: "Возвращает синус заданного угла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/sin-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-sin-cf0e3432-8b9e-483c-bc55-a76651c95602"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Угол в радианах, для которого вычисляется синус."
    } }
  },
  SINH: {
    description: "Возвращает гиперболический синус числа",
    abstract: "Возвращает гиперболический синус числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-sinh-1e4e8b9f-2b65-43fc-ab8a-0a37f4081fa7"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественное число."
    } }
  },
  SQRT: {
    description: "Возвращает положительное значение квадратного корня",
    abstract: "Возвращает положительное значение квадратного корня",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D1%80%D0%B5%D0%BD%D1%8C-654975c2-05c4-4831-9a24-2c65e4040fdf"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Число, для которого вычисляется квадратный корень."
    } }
  },
  SQRTPI: {
    description: "Возвращает квадратный корень из значения выражения (число * пи).",
    abstract: "Возвращает квадратный корень из значения выражения (число * пи).",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D1%80%D0%B5%D0%BD%D1%8C%D0%BF%D0%B8-1fb4e63f-9b51-46d6-ad68-b3e7a8b519b4"
    }],
    functionParameter: { number: {
      name: "число",
      detail: 'Число, которое умножается на число "пи".'
    } }
  },
  SUBTOTAL: {
    description: "Возвращает промежуточный итог в список или базу данных",
    abstract: "Возвращает промежуточный итог в список или базу данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D0%BC%D0%B5%D0%B6%D1%83%D1%82%D0%BE%D1%87%D0%BD%D1%8B%D0%B5-%D0%B8%D1%82%D0%BE%D0%B3%D0%B8-7b027003-f060-4ade-9040-e478765b9939"
    }],
    functionParameter: {
      functionNum: {
        name: "номер функции",
        detail: "Число от 1 до 11 или от 101 до 111, которое обозначает функцию, используемую для расчета промежуточных итогов. Функции с 1 по 11 учитывают строки, скрытые вручную, в то время как функции с 101 по 111 пропускают такие строки; отфильтрованные ячейки всегда исключаются."
      },
      ref1: {
        name: "ссылка1",
        detail: "Первый именованный диапазон или ссылка, для которых требуется вычислить промежуточные итоги."
      },
      ref2: {
        name: "ссылка2",
        detail: "Именованные диапазоны или ссылки 2—254, для которых требуется вычислить промежуточные итоги."
      }
    }
  },
  SUM: {
    description: "Вы можете складывать отдельные значения, диапазоны ячеек, ссылки на ячейки или данные всех этих трех видов.",
    abstract: "Складывает значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%83%D0%BC%D0%BC-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC-043e1c7d-7726-4e80-8f32-07b23e057f89"
    }],
    functionParameter: {
      number1: {
        name: "Число 1",
        detail: "Первое число для сложения. Это может быть число 4, ссылка на ячейку, например B6, или диапазон ячеек, например B2:B8."
      },
      number2: {
        name: "Число 2",
        detail: "то второе число для сложения. Можно указать до 255 чисел."
      }
    }
  },
  SUMIF: {
    description: "Используется, если необходимо просуммировать значения диапазона, соответствующие заданным условиям",
    abstract: "Складывает ячейки, соответствующие заданным условиям",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC%D0%B5%D1%81%D0%BB%D0%B8-169b8c99-c05c-4483-a712-1697a653039b"
    }],
    functionParameter: {
      range: {
        name: "диапазон",
        detail: "Диапазон ячеек, оцениваемых на соответствие условиям."
      },
      criteria: {
        name: "условие",
        detail: 'Условие в форме числа, выражения, ссылки на ячейку, текста или функции, определяющее, какие ячейки необходимо суммировать. Можно включить подстановочные знаки : вопросительный знак (?) для сопоставления с любым одним символом, звездочка (*) для соответствия любой последовательности символов. Если требуется найти непосредственно вопросительный знак (или звездочку), необходимо поставить перед ним знак "тильда" (~).'
      },
      sumRange: {
        name: "диапазон суммирования",
        detail: 'Ячейки, значения из которых суммируются, если они отличаются от ячеек, указанных в качестве диапазона. Если аргумент "диапазон суммирования" опущен, Excel суммирует ячейки, указанные в аргументе "диапазон" (те же ячейки, к которым применяется условие).'
      }
    }
  },
  SUMIFS: {
    description: "Cуммирует все аргументы, удовлетворяющие нескольким условиям",
    abstract: "Cуммирует все аргументы, удовлетворяющие нескольким условиям",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC%D0%B5%D1%81%D0%BB%D0%B8%D0%BC%D0%BD-c9e748f5-7ea7-455d-9406-611cebce642b"
    }],
    functionParameter: {
      sumRange: {
        name: "диапазон суммирования",
        detail: "Диапазон ячеек для суммирования."
      },
      criteriaRange1: {
        name: "диапазон условия1",
        detail: ' Диапазон, в котором проверяется "условие1". "Диапазон условия1" и "условие1" составляют пару, определяющую, к какому диапазону применяется определенное условие при поиске. Соответствующие значения найденных в этом диапазоне ячеек суммируются в пределах аргумента "диапазон суммирования".'
      },
      criteria1: {
        name: "условие1",
        detail: 'Условие, определяющее, какие ячейки суммируются в аргументе "диапазон условия1". Например, условия могут вводится в следующем виде: 32, ">32", B4, "яблоки" или "32".'
      },
      criteriaRange2: {
        name: "диапазон условия2",
        detail: "Дополнительный диапазон. Можно ввести до 127 пар диапазонов."
      },
      criteria2: {
        name: "условие2",
        detail: "Дополнительное условие. Можно ввести до 127 пар условий."
      }
    }
  },
  SUMPRODUCT: {
    description: "Возвращает сумму продуктов соответствующих диапазонов или массивов",
    abstract: "Возвращает сумму продуктов соответствующих диапазонов или массивов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%83%D0%BC%D0%BC%D0%BF%D1%80%D0%BE%D0%B8%D0%B7%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC%D0%BF%D1%80%D0%BE%D0%B8%D0%B7%D0%B2-16753e75-9f68-4874-94ac-4d2145a2fd2e"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Первый массив, компоненты которого нужно перемножить, а затем сложить результаты."
      },
      array2: {
        name: "массив2",
        detail: "От 2 до 255 массивов, компоненты которых нужно перемножить, а затем сложить результаты."
      }
    }
  },
  SUMSQ: {
    description: "Возвращает сумму квадратов аргументов",
    abstract: "Возвращает сумму квадратов аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC%D0%BA%D0%B2-e3313c02-51cc-4963-aae6-31442d9ec307"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Чтобы возвести в квадрат и найти первое число, вы также можете использовать один массив или ссылку на массив вместо параметров, разделенных запятыми."
      },
      number2: {
        name: "число2",
        detail: "Второе число, которое нужно возвести в квадрат и суммировать. Можно указать до 255 чисел."
      }
    }
  },
  SUMX2MY2: {
    description: "Возвращает сумму разности квадратов соответствующих значений в двух массивах",
    abstract: "Возвращает сумму разности квадратов соответствующих значений в двух массивах",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%83%D0%BC%D0%BC%D1%80%D0%B0%D0%B7%D0%BD%D0%BA%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC%D1%80%D0%B0%D0%B7%D0%BD%D0%BA%D0%B2-9e599cc5-5399-48e9-a5e0-e37812dfa3e9"
    }],
    functionParameter: {
      arrayX: {
        name: "массив X",
        detail: "Первый массив или диапазон значений."
      },
      arrayY: {
        name: "массив Y",
        detail: "Второй массив или диапазон значений."
      }
    }
  },
  SUMX2PY2: {
    description: "Возвращает сумму сумм квадратов соответствующих элементов двух массивов",
    abstract: "Возвращает сумму сумм квадратов соответствующих элементов двух массивов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC%D1%81%D1%83%D0%BC%D0%BC%D0%BA%D0%B2-826b60b4-0aa2-4e5e-81d2-be704d3d786f"
    }],
    functionParameter: {
      arrayX: {
        name: "массив X",
        detail: "Первый массив или диапазон значений."
      },
      arrayY: {
        name: "массив Y",
        detail: "Второй массив или диапазон значений."
      }
    }
  },
  SUMXMY2: {
    description: "Возвращает сумму квадратов различий соответствующих значений в двух массивах",
    abstract: "Возвращает сумму квадратов различий соответствующих значений в двух массивах",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%83%D0%BC%D0%BC%D0%BA%D0%B2%D1%80%D0%B0%D0%B7%D0%BD-9d144ac1-4d79-43de-b524-e2ecee23b299"
    }],
    functionParameter: {
      arrayX: {
        name: "массив X",
        detail: "Первый массив или диапазон значений."
      },
      arrayY: {
        name: "массив Y",
        detail: "Второй массив или диапазон значений."
      }
    }
  },
  TAN: {
    description: "Возвращает тангенс заданного угла",
    abstract: "Возвращает тангенс заданного угла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-tan-08851a40-179f-4052-b789-d7f699447401"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Угол в радианах, для которого вычисляется тангенс."
    } }
  },
  TANH: {
    description: "Возвращает гиперболический тангенс числа",
    abstract: "Возвращает гиперболический тангенс числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-tanh-017222f0-a0c3-4f69-9787-b3202295dc6c"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Любое вещественное число."
    } }
  },
  TRUNC: {
    description: "Усекает число до целого числа, удаляя дробную часть числа",
    abstract: "Усекает число до целого числа, удаляя дробную часть числа",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%82%D0%B1%D1%80-8b86a64c-3127-43db-ba14-aa5ceb292721"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Усекаемое число."
      },
      numDigits: {
        name: "число разрядов",
        detail: "Число, определяющее точность усечения. Значение по умолчанию — 0 (нуль)."
      }
    }
  }
};
const locale$5 = {
  AVEDEV: {
    description: "Возвращает среднее абсолютных значений отклонений точек данных от среднего. AVEDEV является мерой разброса множества данных",
    abstract: "Возвращает среднее абсолютных значений отклонений точек данных от среднего. AVEDEV является мерой разброса множества данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%BE%D1%82%D0%BA%D0%BB-58fe8d65-2a84-4dc7-8052-f3f87b5c6639"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое число, ссылка на ячейку или диапазон, для которого требуется вычислить среднее значение."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых необходимо вычислить среднее значение, максимум до 255."
      }
    }
  },
  AVERAGE: {
    description: "Возвращает среднее (среднее арифметическое) аргументов",
    abstract: "Возвращает среднее (среднее арифметическое) аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87-047bac88-d466-426c-a32b-8f33eb960cf6"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое число, ссылка на ячейку или диапазон, для которого требуется вычислить среднее значение."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых необходимо вычислить среднее значение, максимум до 255."
      }
    }
  },
  AVERAGE_WEIGHTED: {
    description: "Находит средневзвешенное значение набора значений по заданным значениям и соответствующим весам",
    abstract: "Находит средневзвешенное значение набора значений по заданным значениям и соответствующим весам",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/9084098?hl=ru&ref_topic=3105600&sjid=2155433538747546473-AP"
    }],
    functionParameter: {
      values: {
        name: "значения",
        detail: "Значения для расчета среднего."
      },
      weights: {
        name: "взвешенные",
        detail: "Список соответствующих взвешенных величин, которые необходимо применить."
      },
      additionalValues: {
        name: "дополнительные значения",
        detail: "Дополнительные значения для расчета среднего."
      },
      additionalWeights: {
        name: "дополнительные взвешенные",
        detail: "Дополнительные взвешенные, которые необходимо применить."
      }
    }
  },
  AVERAGEA: {
    description: "Вычисляет среднее арифметическое для значений заданных в списке аргументов",
    abstract: "Вычисляет среднее арифметическое для значений заданных в списке аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87%D0%B0-f5f84098-d453-4f4c-bbba-3d2c66356091"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "первое число, ссылка на ячейку или диапазон, для которого требуется вычислить среднее значение."
      },
      value2: {
        name: "значение2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых необходимо вычислить среднее значение, максимум до 255."
      }
    }
  },
  AVERAGEIF: {
    description: "Возвращает среднее значение (среднее арифметическое) всех ячеек в диапазоне, которые соответствуют данному условию",
    abstract: "Возвращает среднее значение (среднее арифметическое) всех ячеек в диапазоне, которые соответствуют данному условию",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D1%81%D0%BB%D0%B8-faec8e2e-0dec-4308-af69-f5576d8ac642"
    }],
    functionParameter: {
      range: {
        name: "диапазон",
        detail: "Одна или несколько ячеек для вычисления среднего, включающих числа или имена, массивы или ссылки, содержащие числа."
      },
      criteria: {
        name: "условие",
        detail: 'Условие в форме числа, выражения, ссылки на ячейку или текста, которое определяет ячейки, используемые при вычислении среднего. Например, условие может быть выражено следующим образом: 32, "32", ">32", "яблоки" или B4.'
      },
      averageRange: {
        name: "диапазон усреднения",
        detail: "Фактическое множество ячеек для вычисления среднего. Если этот параметр не указан, используется диапазон."
      }
    }
  },
  AVERAGEIFS: {
    description: "Возвращает среднее значение (среднее арифметическое) всех ячеек, которые соответствуют нескольким условиям",
    abstract: "Возвращает среднее значение (среднее арифметическое) всех ячеек, которые соответствуют нескольким условиям",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D1%81%D0%BB%D0%B8%D0%BC%D0%BD-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B7%D0%BD%D0%B0%D1%87%D0%B5%D1%81%D0%BB%D0%B8%D0%BC%D0%BD-48910c45-1fc0-4389-a028-f7c5c3001690"
    }],
    functionParameter: {
      averageRange: {
        name: "диапазон усреднения",
        detail: "Одна или несколько ячеек для вычисления среднего, включающих числа или имена, массивы или ссылки, содержащие числа."
      },
      criteriaRange1: {
        name: "диапазон условий1",
        detail: "Является ли набор ячеек для оценки по критериям."
      },
      criteria1: {
        name: "условие1",
        detail: 'Используется для определения ячеек, для которых будет рассчитано среднее значение. Например, критерии могут быть выражены как 32, "32", ">32", "apple" или B4.'
      },
      criteriaRange2: {
        name: "диапазон условий2",
        detail: "Дополнительные диапазоны. Вы можете ввести до 127 диапазонов."
      },
      criteria2: {
        name: "условие2",
        detail: "Дополнительные сопутствующие критерии. Вы можете ввести до 127 критериев."
      }
    }
  },
  BETA_DIST: {
    description: "Возвращает функцию бета-распределения",
    abstract: "Возвращает функцию бета-распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%82%D0%B0-%D1%80%D0%B0%D1%81%D0%BF-11188c9c-780a-42c7-ba43-9ecb5a878d31"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение в интервале между A и B, для которого вычисляется функция."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      cumulative: {
        name: "совокупный",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция BETA_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения.'
      },
      A: {
        name: "A",
        detail: "Нижняя граница интервала изменения x."
      },
      B: {
        name: "B",
        detail: "Верхняя граница интервала изменения x."
      }
    }
  },
  BETA_INV: {
    description: "Возвращает обратную функцию к интегральной функции плотности бета-распределения вероятности",
    abstract: "Возвращает обратную функцию к интегральной функции плотности бета-распределения вероятности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B5%D1%82%D0%B0-%D0%BE%D0%B1%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B5%D1%82%D0%B0-%D0%BE%D0%B1%D1%80-e84cb8aa-8df0-4cf6-9892-83a341d252eb"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с бета-распределением."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      A: {
        name: "A",
        detail: "Нижняя граница интервала изменения x."
      },
      B: {
        name: "B",
        detail: "Верхняя граница интервала изменения x."
      }
    }
  },
  BINOM_DIST: {
    description: "Возвращает отдельное значение биномиального распределения",
    abstract: "Возвращает отдельное значение биномиального распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-c5ae37b6-f39c-4be2-94c2-509a1480770c"
    }],
    functionParameter: {
      numberS: {
        name: "число успехов",
        detail: "Количество успешных испытаний."
      },
      trials: {
        name: "число испытаний",
        detail: "Количество независимых испытаний."
      },
      probabilityS: {
        name: "вероятность успеха",
        detail: "Вероятность успеха каждого испытания."
      },
      cumulative: {
        name: "интегральная",
        detail: 'Логическое значение, определяющее форму функции. Если совокупный имеет значение TRUE, то binom. DIST возвращает функцию накопительного распределения, которая является вероятностью того, что успехи будут не более "число успехов". Если значение FALSE, возвращается функция вероятностной массы, то есть вероятность "число успехов".'
      }
    }
  },
  BINOM_DIST_RANGE: {
    description: "Возвращает вероятность результата испытаний при помощи биномиального распределения",
    abstract: "Возвращает вероятность результата испытаний при помощи биномиального распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-%D0%B4%D0%B8%D0%B0%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-%D0%B4%D0%B8%D0%B0%D0%BF-17331329-74c7-4053-bb4c-6653a7421595"
    }],
    functionParameter: {
      trials: {
        name: "число испытаний",
        detail: "Количество независимых испытаний."
      },
      probabilityS: {
        name: "вероятность успеха",
        detail: "Вероятность успеха каждого испытания."
      },
      numberS: {
        name: "число успехов",
        detail: "Количество успешных испытаний."
      },
      numberS2: {
        name: "число успехов2",
        detail: 'Если он указан, функция возвращает вероятность того, что количество успешных испытаний окажется в диапазоне от значения "число успехов" до значения "число успехов2". Должен быть больше или равен значению "число успехов", но меньше или равен "число испытаний".'
      }
    }
  },
  BINOM_INV: {
    description: "Возвращает наименьшее значение, для которого интегральное биномиальное распределение больше заданного значения критерия или равно ему",
    abstract: "Возвращает наименьшее значение, для которого интегральное биномиальное распределение больше заданного значения критерия или равно ему",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-%D0%BE%D0%B1%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-%D0%BE%D0%B1%D1%80-80a0370c-ada6-49b4-83e7-05a91ba77ac9"
    }],
    functionParameter: {
      trials: {
        name: "число испытаний",
        detail: "Число испытаний Бернулли."
      },
      probabilityS: {
        name: "вероятность успеха",
        detail: "Вероятность успеха каждого испытания."
      },
      alpha: {
        name: "альфа",
        detail: "Значение критерия."
      }
    }
  },
  CHISQ_DIST: {
    description: "Возвращает распределение хи-квадрат",
    abstract: "Возвращает распределение хи-квадрат",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82-%D1%80%D0%B0%D1%81%D0%BF-8486b05e-5c05-4942-a9ea-f6b341518732"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      degFreedom: {
        name: "степениь свободы",
        detail: "Число степеней свободы."
      },
      cumulative: {
        name: "интегральная",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция CHISQ_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения.'
      }
    }
  },
  CHISQ_DIST_RT: {
    description: "Возвращает правостороннюю вероятность распределения хи-квадрат",
    abstract: "Возвращает правостороннюю вероятность распределения хи-квадрат",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82-%D1%80%D0%B0%D1%81%D0%BF-%D0%BF%D1%85-dc4832e8-ed2b-49ae-8d7c-b28d5804c0f2"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      degFreedom: {
        name: "cтепени свободы",
        detail: "Число степеней свободы."
      }
    }
  },
  CHISQ_INV: {
    description: "Возвращает значение, обратное левосторонней вероятности распределения хи-квадрат",
    abstract: "Возвращает значение, обратное левосторонней вероятности распределения хи-квадрат",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82-%D0%BE%D0%B1%D1%80-400db556-62b3-472d-80b3-254723e7092f"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с распределением хи-квадрат."
      },
      degFreedom: {
        name: "cтепени свободы",
        detail: "Число степеней свободы."
      }
    }
  },
  CHISQ_INV_RT: {
    description: "Возвращает значение, обратное правосторонней вероятности распределения хи-квадрат",
    abstract: "Возвращает значение, обратное правосторонней вероятности распределения хи-квадрат",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%85%D0%B82-%D0%BE%D0%B1%D1%80-%D0%BF%D1%85-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82-%D0%BE%D0%B1%D1%80-%D0%BF%D1%85-435b5ed8-98d5-4da6-823f-293e2cbc94fe"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с распределением хи-квадрат."
      },
      degFreedom: {
        name: "cтепени свободы",
        detail: "Число степеней свободы."
      }
    }
  },
  CHISQ_TEST: {
    description: "Возвращает критерий независимости",
    abstract: "Возвращает критерий независимости",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%85%D0%B82-%D1%82%D0%B5%D1%81%D1%82-2e8a7861-b14a-4985-aa93-fb88de3f260f"
    }],
    functionParameter: {
      actualRange: {
        name: "фактический интервал",
        detail: "Интервал данных, который содержит результаты наблюдений, подлежащие сравнению с ожидаемыми значениями."
      },
      expectedRange: {
        name: "ожидаемый интервал",
        detail: "Интервал данных, который содержит отношение произведений итогов по строкам и столбцам к общему итогу."
      }
    }
  },
  CONFIDENCE_NORM: {
    description: "Возвращает доверительный интервал для среднего генеральной совокупности с нормальным распределением",
    abstract: "Возвращает доверительный интервал для среднего генеральной совокупности с нормальным распределением",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%BE%D0%B2%D0%B5%D1%80%D0%B8%D1%82-%D0%BD%D0%BE%D1%80%D0%BC-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D0%B2%D0%B5%D1%80%D0%B8%D1%82-%D0%BD%D0%BE%D1%80%D0%BC-7cec58a6-85bb-488d-91c3-63828d4fbfd4"
    }],
    functionParameter: {
      alpha: {
        name: "альфа",
        detail: 'Уровень значимости, используемый для вычисления доверительного уровня. Доверительный уровень равен 100*(1 - альфа) процентам или, иными словами, значение аргумента "альфа", равное 0,05, означает 95-процентный доверительный уровень.'
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение генеральной совокупности для диапазона данных, предполагается известным."
      },
      size: {
        name: "размер",
        detail: "Размер выборки."
      }
    }
  },
  CONFIDENCE_T: {
    description: "Возвращает доверительный интервал для среднего генеральной совокупности, используя распределение Стьюдента",
    abstract: "Возвращает доверительный интервал для среднего генеральной совокупности, используя распределение Стьюдента.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%BE%D0%B2%D0%B5%D1%80%D0%B8%D1%82-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-e8eca395-6c3a-4ba9-9003-79ccc61d3c53"
    }],
    functionParameter: {
      alpha: {
        name: "альфа",
        detail: 'Уровень значимости, используемый для вычисления доверительного уровня. Доверительный уровень равен 100*(1 - альфа) процентам или, иными словами, значение аргумента "альфа", равное 0,05, означает 95-процентный доверительный уровень.'
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение генеральной совокупности для диапазона данных, предполагается известным."
      },
      size: {
        name: "размер",
        detail: "Размер выборки."
      }
    }
  },
  CORREL: {
    description: "Возвращает коэффициент корреляции двух диапазонов ячеек",
    abstract: "Возвращает коэффициент корреляции двух диапазонов ячеек",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D1%80%D1%80%D0%B5%D0%BB-995dcef7-0c0a-4bed-a3fb-239d7b68ca92"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Диапазон значений ячеек."
      },
      array2: {
        name: "массив2",
        detail: "Второй диапазон значений ячеек."
      }
    }
  },
  COUNT: {
    description: "Подсчитывает количество ячеек, содержащих числа, и количество чисел в списке аргументов",
    abstract: "Подсчитывает количество ячеек, содержащих числа, и количество чисел в списке аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%87%D1%91%D1%82-a59cd7fc-b623-4d93-87a4-d23bf411294c"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "Первый элемент, ссылка на ячейку или диапазон, для которого требуется подсчитать количество чисел."
      },
      value2: {
        name: "значение2",
        detail: "До 255 дополнительных элементов, ссылок на ячейки или диапазонов, в которых требуется подсчитать количество чисел."
      }
    }
  },
  COUNTA: {
    description: "Подсчитывает количество заполненных ячеек в диапазон",
    abstract: "Подсчитывает количество заполненных ячеек в диапазон",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%87%D1%91%D1%82%D0%B7-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%87%D1%91%D1%82%D0%B7-7dc98875-d5c1-46f1-9a82-53f3219e2509"
    }],
    functionParameter: {
      number1: {
        name: "значение1",
        detail: "Первый аргумент, представляющий значения, количество которые требуется подсчитать."
      },
      number2: {
        name: "значение2",
        detail: "Дополнительные аргументы, представляющие значения, количество которых требуется подсчитать. Аргументов может быть не более 255."
      }
    }
  },
  COUNTBLANK: {
    description: "Подсчитывает количество пустых ячеек в диапазоне ячеек",
    abstract: "Подсчитывает количество пустых ячеек в диапазоне ячеек",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%87%D0%B8%D1%82%D0%B0%D1%82%D1%8C%D0%BF%D1%83%D1%81%D1%82%D0%BE%D1%82%D1%8B-6a92d772-675c-4bee-b346-24af6bd3ac22"
    }],
    functionParameter: { range: {
      name: "диапазон",
      detail: "Диапазон, в котором требуется подсчитать количество пустых ячеек."
    } }
  },
  COUNTIF: {
    description: "Подсчитывает количество ячеек, отвечающих определенному условию",
    abstract: "Подсчитывает количество ячеек, отвечающих определенному условию",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%87%D1%91%D1%82%D0%B5%D1%81%D0%BB%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%87%D1%91%D1%82%D0%B5%D1%81%D0%BB%D0%B8-e0de10c6-f885-4e71-abb4-1f464816df34"
    }],
    functionParameter: {
      range: {
        name: "диапазон",
        detail: "Группа ячеек, для которых нужно выполнить подсчет. Диапазон может содержать числа, массивы, именованный диапазон или ссылки на числа. Пустые и текстовые значения игнорируются."
      },
      criteria: {
        name: "условие",
        detail: 'Число, выражение, ссылка на ячейку или текстовая строка, которая определяет, какие ячейки нужно подсчитать. Например, критерий может быть выражен как 32, ">32", В4, "яблоки" или "32".'
      }
    }
  },
  COUNTIFS: {
    description: "Применяет критерии к ячейкам в нескольких диапазонах и вычисляет количество соответствий всем критериям",
    abstract: "Применяет критерии к ячейкам в нескольких диапазонах и вычисляет количество соответствий всем критериям.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%87%D1%91%D1%82%D0%B5%D1%81%D0%BB%D0%B8%D0%BC%D0%BD-dda3dc6e-f74e-4aee-88bc-aa8c2a866842"
    }],
    functionParameter: {
      criteriaRange1: {
        name: "диапазон условий1",
        detail: "Первый диапазон, в котором необходимо проверить соответствие заданному условию."
      },
      criteria1: {
        name: "условие1",
        detail: 'Условие в форме числа, выражения, ссылки на ячейку или текста, которые определяют, какие ячейки требуется учитывать. Например, условие может быть выражено следующим образом: 32, ">32", B4, "яблоки" или "32".'
      },
      criteriaRange2: {
        name: "диапазон условий2",
        detail: "Дополнительные диапазоны. Вы можете ввести до 127 диапазонов."
      },
      criteria2: {
        name: "условие2",
        detail: "Дополнительные сопутствующие критерии. Вы можете ввести до 127 критериев."
      }
    }
  },
  COVARIANCE_P: {
    description: "Возвращает ковариацию популяции — среднее значение продуктов отклонений для каждой пары точек данных в двух наборах данных",
    abstract: "Возвращает ковариацию популяции",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BA%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D0%B0%D1%86%D0%B8%D1%8F-%D0%B3-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D0%B0%D1%86%D0%B8%D1%8F-%D0%B3-6f0e1e6d-956d-4e4b-9943-cfef0bf9edfc"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Диапазон значений ячеек."
      },
      array2: {
        name: "массив2",
        detail: "Второй диапазон значений ячеек."
      }
    }
  },
  COVARIANCE_S: {
    description: "Возвращает ковариацию выборки, т.е. среднее произведений отклонений для каждой пары точек в двух наборах данных",
    abstract: "Возвращает ковариацию выборки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BA%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D0%B0%D1%86%D0%B8%D1%8F-%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%BE%D0%B2%D0%B0%D1%80%D0%B8%D0%B0%D1%86%D0%B8%D1%8F-%D0%B2-0a539b74-7371-42aa-a18f-1f5320314977"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Диапазон значений ячеек."
      },
      array2: {
        name: "массив2",
        detail: "Второй диапазон значений ячеек."
      }
    }
  },
  DEVSQ: {
    description: "Возвращает сумму квадратов отклонений точек данных от их среднего",
    abstract: "Возвращает сумму квадратов отклонений точек данных от их среднего",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%B2%D0%B0%D0%B4%D1%80%D0%BE%D1%82%D0%BA%D0%BB-8b739616-8376-4df5-8bd0-cfe0a6caf444"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый аргумент, для которого вы хотите вычислить сумму квадратов отклонений."
      },
      number2: {
        name: "число2",
        detail: "Аргументы от 2 до 255, для которых требуется вычислить сумму квадратов отклонений."
      }
    }
  },
  EXPON_DIST: {
    description: "Возвращает экспоненциальное распределение",
    abstract: "Возвращает экспоненциальное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%8D%D0%BA%D1%81%D0%BF-%D1%80%D0%B0%D1%81%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%8D%D0%BA%D1%81%D0%BF-%D1%80%D0%B0%D1%81%D0%BF-4c12ae24-e563-4155-bf3e-8b78b6ae140e"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      lambda: {
        name: "лямбда",
        detail: "Значение параметра."
      },
      cumulative: {
        name: "совокупный",
        detail: 'Логическое значение, определяющее форму экспоненциальной функции, которую следует использовать. Если аргумент "интегральная" имеет значение True, функция EXPON_DIST возвращает интегральную функцию распределения; если имеет значение False, возвращается функция плотности распределения.'
      }
    }
  },
  F_DIST: {
    description: "Возвращает F-распределение вероятности",
    abstract: "Возвращает F-распределение вероятности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/f-%D1%80%D0%B0%D1%81%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-f-%D1%80%D0%B0%D1%81%D0%BF-a887efdc-7c8e-46cb-a74a-f884cd29b25d"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого вычисляется функция."
      },
      degFreedom1: {
        name: "степень свободы1",
        detail: "Числитель степеней свободы."
      },
      degFreedom2: {
        name: "степень свободы2",
        detail: "Знаменатель степеней свободы."
      },
      cumulative: {
        name: "совокупный",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция F_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения.'
      }
    }
  },
  F_DIST_RT: {
    description: "Возвращает правый хвост F-распределения вероятности для двух наборов данных",
    abstract: "Возвращает правый хвост F-распределения вероятности для двух наборов данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/f-%D1%80%D0%B0%D1%81%D0%BF-%D0%BF%D1%85-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-f-%D1%80%D0%B0%D1%81%D0%BF-%D0%BF%D1%85-d74cbb00-6017-4ac9-b7d7-6049badc0520"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого вычисляется функция."
      },
      degFreedom1: {
        name: "степень свободы1",
        detail: "Числитель степеней свободы."
      },
      degFreedom2: {
        name: "степень свободы2",
        detail: "Знаменатель степеней свободы."
      }
    }
  },
  F_INV: {
    description: "Возвращает значение, обратное F-распределению вероятности",
    abstract: "Возвращает значение, обратное F-распределению вероятности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/f-%D0%BE%D0%B1%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-f-%D0%BE%D0%B1%D1%80-0dda0cf9-4ea0-42fd-8c3c-417a1ff30dbe"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с интегральным F-распределением."
      },
      degFreedom1: {
        name: "степень свободы1",
        detail: "Числитель степеней свободы."
      },
      degFreedom2: {
        name: "степень свободы2",
        detail: "Знаменатель степеней свободы."
      }
    }
  },
  F_INV_RT: {
    description: "Возвращает значение, обратное (правостороннему) F-распределению вероятности",
    abstract: "Возвращает значение, обратное (правостороннему) F-распределению вероятности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/f-%D0%BE%D0%B1%D1%80-%D0%BF%D1%85-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-f-%D0%BE%D0%B1%D1%80-%D0%BF%D1%85-d371aa8f-b0b1-40ef-9cc2-496f0693ac00"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с интегральным F-распределением."
      },
      degFreedom1: {
        name: "степень свободы1",
        detail: "Числитель степеней свободы."
      },
      degFreedom2: {
        name: "степень свободы2",
        detail: "Знаменатель степеней свободы."
      }
    }
  },
  F_TEST: {
    description: "Возвращает результат F-теста",
    abstract: "Возвращает результат F-теста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-f-%D1%82%D0%B5%D1%81%D1%82-100a59e7-4108-46f8-8443-78ffacb6c0a7"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Первый массив или диапазон данных."
      },
      array2: {
        name: "массив2",
        detail: "Второй массив или диапазон данных."
      }
    }
  },
  FISHER: {
    description: "Возвращает преобразование Фишера для аргумента x",
    abstract: "Возвращает преобразование Фишера для аргумента x",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D0%B8%D1%88%D0%B5%D1%80-d656523c-5076-4f95-b87b-7741bf236c69"
    }],
    functionParameter: { x: {
      name: "x",
      detail: "Числовое значение, для которого необходимо получить преобразование."
    } }
  },
  FISHERINV: {
    description: "Возвращает обратное значение для преобразования Фишера",
    abstract: "Возвращает обратное значение для преобразования Фишера",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D0%B8%D1%88%D0%B5%D1%80%D0%BE%D0%B1%D1%80-62504b39-415a-4284-a285-19c8e82f86bb"
    }],
    functionParameter: { y: {
      name: "y",
      detail: "Значение, для которого необходимо выполнить обратное преобразование."
    } }
  },
  FORECAST: {
    description: "Возвращает значение линейного тренда",
    abstract: "Возвращает значение линейного тренда",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D0%B8-forecast-%D0%B8-forecast-linear-50ca49c9-7b40-4892-94e4-7ad38bbeda99"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Точка данных, для которой предсказывается значение."
      },
      knownYs: {
        name: "известные значения Y",
        detail: "Зависимый массив или интервал данных."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Независимый массив или интервал данных."
      }
    }
  },
  FORECAST_ETS: {
    description: "Рассчитывает или прогнозирует будущее значение на основе существующих (ретроспективных) данных с использованием версии AAA алгоритма экспоненциального сглаживания (ETS)",
    abstract: "Рассчитывает или прогнозирует будущее значение на основе существующих (ретроспективных) данных с использованием версии AAA алгоритма экспоненциального сглаживания (ETS)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D0%BA%D0%B0%D0%B7-ets-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D0%BA%D0%B0%D0%B7-ets-15389b8b-677e-4fbd-bd95-21d464333f41"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  FORECAST_ETS_CONFINT: {
    description: "Возвращает доверительный интервал для прогнозируемого значения на указанную целевую дату",
    abstract: "Возвращает доверительный интервал для прогнозируемого значения на указанную целевую дату",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/forecasting-functions-reference-897a2fe9-6595-4680-a0b0-93e0308d5f6e#_FORECAST.ETS.CONFINT"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  FORECAST_ETS_SEASONALITY: {
    description: "Возвращает длину повторяющегося фрагмента, обнаруженного программой Excel в заданном временном ряду",
    abstract: "Возвращает длину повторяющегося фрагмента, обнаруженного программой Excel в заданном временном ряду",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D0%BA%D0%B0%D0%B7-ets-%D1%81%D0%B5%D0%B7%D0%BE%D0%BD%D0%BD%D0%BE%D1%81%D1%82%D1%8C-32a27a3b-d22f-42ce-8c5d-ef3649269f3c"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  FORECAST_ETS_STAT: {
    description: "Возвращает статистическое значение, являющееся результатом прогнозирования временного ряда",
    abstract: "Возвращает статистическое значение, являющееся результатом прогнозирования временного ряда",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%B5%D0%B4%D1%81%D0%BA%D0%B0%D0%B7-ets-%D1%81%D1%82%D0%B0%D1%82-60f2ae14-d0cf-465e-9736-625ccaaa60b4"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "первое"
      },
      number2: {
        name: "число2",
        detail: "второе"
      }
    }
  },
  FORECAST_LINEAR: {
    description: "Возвращает будущее значение на основе существующих значений",
    abstract: "Возвращает будущее значение на основе существующих значений",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/forecast-and-forecast-linear-functions-50ca49c9-7b40-4892-94e4-7ad38bbeda99"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Точка данных, для которой предсказывается значение."
      },
      knownYs: {
        name: "известные значения Y",
        detail: "Зависимый массив или интервал данных."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Независимый массив или интервал данных."
      }
    }
  },
  FREQUENCY: {
    description: "Вычисляет частоту появления значений в диапазоне и возвращает вертикальный массив чисел",
    abstract: "Вычисляет частоту появления значений в диапазоне и возвращает вертикальный массив чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%87%D0%B0%D1%81%D1%82%D0%BE%D1%82%D0%B0-44e3be2b-eca0-42cd-a3f7-fd9ea898fdb9"
    }],
    functionParameter: {
      dataArray: {
        name: "массив данных",
        detail: 'Массив значений или ссылка на набор значений, частоты которых нужно подсчитать. Если массив "массив контейнеров" не содержит значений, функция FREQUENCY возвращает массив нулей.'
      },
      binsArray: {
        name: "массив контейнеров",
        detail: 'Массив или ссылка на интервалы, по которым требуется сгруппировать значения в массиве "массив контейнеров". Если массив bins_array не содержит значений, функция FREQUENCY возвращает количество элементов в массиве "массив данных".'
      }
    }
  },
  GAMMA: {
    description: "Возвращает значение гамма-функции",
    abstract: "Возвращает значение гамма-функции",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0-ce1702b1-cf55-471d-8307-f83be0fc5297"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Входное значение гамма-функции."
    } }
  },
  GAMMA_DIST: {
    description: "Возвращает гамма-распределение",
    abstract: "Возвращает гамма-распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0-%D1%80%D0%B0%D1%81%D0%BF-9b6f1538-d11c-4d5f-8966-21f6a2201def"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      cumulative: {
        name: "интегральная",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция GAMMA_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения вероятности.'
      }
    }
  },
  GAMMA_INV: {
    description: "Возвращает обратное гамма-кумулятивное распределение",
    abstract: "Возвращает обратное гамма-кумулятивное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0-%D0%BE%D0%B1%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0-%D0%BE%D0%B1%D1%80-74991443-c2b0-4be5-aaab-1aa4d71fbb18"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с гамма-распределением."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      }
    }
  },
  GAMMALN: {
    description: "Возвращает натуральный логарифм гамма-функции — Γ(x)",
    abstract: "Возвращает натуральный логарифм гамма-функции — Γ(x)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0%D0%BD%D0%BB%D0%BE%D0%B3-b838c48b-c65f-484f-9e1d-141c55470eb9"
    }],
    functionParameter: { x: {
      name: "x",
      detail: "Значение, для которого вычисляется функция GAMMALN."
    } }
  },
  GAMMALN_PRECISE: {
    description: "Возвращает натуральный логарифм гамма-функции — Γ(x)",
    abstract: "Возвращает натуральный логарифм гамма-функции — Γ(x)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0%D0%BD%D0%BB%D0%BE%D0%B3-%D1%82%D0%BE%D1%87%D0%BD-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D0%BC%D0%BC%D0%B0%D0%BD%D0%BB%D0%BE%D0%B3-%D1%82%D0%BE%D1%87%D0%BD-5cdfe601-4e1e-4189-9d74-241ef1caa599"
    }],
    functionParameter: { x: {
      name: "x",
      detail: "Значение, для которого вычисляется функция GAMMALN.PRECISE."
    } }
  },
  GAUSS: {
    description: "Рассчитывает вероятность, с которой элемент стандартной нормальной совокупности находится в интервале между средним и стандартным отклонением z от среднего.",
    abstract: "Рассчитывает вероятность, с которой элемент стандартной нормальной совокупности находится в интервале между средним и стандартным отклонением z от среднего.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B3%D0%B0%D1%83%D1%81%D1%81-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B0%D1%83%D1%81%D1%81-069f1b4e-7dee-4d6a-a71f-4b69044a6b33"
    }],
    functionParameter: { z: {
      name: "z",
      detail: "Значение, для которого требуется вычислить распределение."
    } }
  },
  GEOMEAN: {
    description: "Возвращает среднее геометрическое значений массива или интервала положительных чисел",
    abstract: "Возвращает среднее геометрическое значений массива или интервала положительных чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B3%D0%B5%D0%BE%D0%BC-db1ac48d-25a5-40a0-ab83-0b38980e40d5"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число, ссылка на ячейку или диапазон, для которого требуется вычислить среднее геометрическое значение."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых необходимо вычислить среднее геометрическое значение, максимум до 255."
      }
    }
  },
  GROWTH: {
    description: "Рассчитывает прогнозируемый экспоненциальный рост на основе имеющихся данных",
    abstract: "Рассчитывает прогнозируемый экспоненциальный рост на основе имеющихся данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%BE%D1%81%D1%82-541a91dc-3d5e-437d-b156-21324e68b80d"
    }],
    functionParameter: {
      knownYs: {
        name: "известные значения Y",
        detail: "Множество значений y в уравнении y = b*m^x, которые уже известны."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Множество значений x, которые могут быть уже известны для соотношения y = b*m^x."
      },
      newXs: {
        name: "новые значения X",
        detail: "Новые значения x, для которых функция GROWTH возвращает соответствующие значения y."
      },
      constb: {
        name: "конст",
        detail: "Логическое значение, которое указывает, должна ли константа b равняться 1."
      }
    }
  },
  HARMEAN: {
    description: "Возвращает среднее гармоническое множества данных",
    abstract: "Возвращает среднее гармоническое множества данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%80%D0%B3%D0%B0%D1%80%D0%BC-5efd9184-fab5-42f9-b1d3-57883a1d3bc6"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число, ссылка на ячейку или диапазон, для которого требуется найти среднее гармоническое значение."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых требуется вычислить среднее гармоническое значение, максимум до 255."
      }
    }
  },
  HYPGEOM_DIST: {
    description: "Возвращает гипергеометрическое распределение",
    abstract: "Возвращает гипергеометрическое распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B3%D0%B8%D0%BF%D0%B5%D1%80%D0%B3%D0%B5%D0%BE%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-6dbd547f-1d12-4b1f-8ae5-b0d9e3d22fbf"
    }],
    functionParameter: {
      sampleS: {
        name: "число успехов в выборке",
        detail: "Количество успешных испытаний в выборке."
      },
      numberSample: {
        name: "размер выборки",
        detail: "Размер выборки."
      },
      populationS: {
        name: "число успехов в совокупности",
        detail: "Количество успешных испытаний в совокупности."
      },
      numberPop: {
        name: "размер совокупности",
        detail: "Размер совокупности."
      },
      cumulative: {
        name: "интегральная",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция HYPGEOM_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения.'
      }
    }
  },
  INTERCEPT: {
    description: "Возвращает точку пересечения линии линейной регрессии",
    abstract: "Возвращает точку пересечения линии линейной регрессии",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%82%D1%80%D0%B5%D0%B7%D0%BE%D0%BA-2a9b74e2-9d47-4772-b663-3bca70bf63ef"
    }],
    functionParameter: {
      knownYs: {
        name: "известные значения Y",
        detail: "Зависимый массив или интервал данных."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Независимый массив или интервал данных."
      }
    }
  },
  KURT: {
    description: "Возвращает эксцесс множества данных",
    abstract: "Возвращает эксцесс множества данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%8D%D0%BA%D1%81%D1%86%D0%B5%D1%81%D1%81-bc3a265c-5da4-4dcb-b7fd-c237789095ab"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число, ссылка на ячейку или диапазон, для которого требуется определить эксцесс."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых необходимо рассчитать эксцесс, максимум до 255."
      }
    }
  },
  LARGE: {
    description: "Возвращает k-ое по величине значение из множества данных",
    abstract: "Возвращает k-ое по величине значение из множества данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B0%D0%B8%D0%B1%D0%BE%D0%BB%D1%8C%D1%88%D0%B8%D0%B9-3af0af19-1190-42bb-bb8b-01672ec00a64"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, для которого определяется k-ое наибольшее значение."
      },
      k: {
        name: "k",
        detail: "Позиция (начиная с наибольшего числа) в массиве или диапазоне ячеек данных."
      }
    }
  },
  LINEST: {
    description: "Возвращает параметры линейного тренда",
    abstract: "Возвращает параметры линейного тренда",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%B8%D0%BD%D0%B5%D0%B9%D0%BD-84d7d0d9-6e50-4101-977a-fa7abf772b6d"
    }],
    functionParameter: {
      knownYs: {
        name: "известные значения Y",
        detail: "Множество значений y, которые уже известны для соотношения y = mx + b."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Множество значений x, которые уже известны для соотношения y = mx + b."
      },
      constb: {
        name: "конст",
        detail: "Логическое значение, которое указывает, требуется ли, чтобы константа b была равна 0."
      },
      stats: {
        name: "статистика",
        detail: "Логическое значение, которое указывает, требуется ли вернуть дополнительную регрессионную статистику."
      }
    }
  },
  LOGEST: {
    description: "Возвращает параметры экспоненциального тренда",
    abstract: "Возвращает параметры экспоненциального тренда",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%B3%D1%80%D1%84%D0%BF%D1%80%D0%B8%D0%B1%D0%BB-f27462d8-3657-4030-866b-a272c1d18b4b"
    }],
    functionParameter: {
      knownYs: {
        name: "известные значения Y",
        detail: "Множество значений y в уравнении y = b*m^x, которые уже известны."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Множество значений x, которые могут быть уже известны для соотношения y = b*m^x."
      },
      constb: {
        name: "конст",
        detail: "Логическое значение, которое указывает, должна ли константа b равняться 1."
      },
      stats: {
        name: "статистика",
        detail: "Логическое значение, которое указывает, требуется ли вернуть дополнительную регрессионную статистику."
      }
    }
  },
  LOGNORM_DIST: {
    description: "Возвращает логнормальное распределение",
    abstract: "Возвращает логнормальное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BB%D0%BE%D0%B3%D0%BD%D0%BE%D1%80%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%BE%D0%B3%D0%BD%D0%BE%D1%80%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-eb60d00b-48a9-4217-be2b-6074aee6b070"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      mean: {
        name: "среднее",
        detail: "Среднее арифметическое распределения."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение распределения."
      },
      cumulative: {
        name: "совокупный",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция LOGNORM_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения.'
      }
    }
  },
  LOGNORM_INV: {
    description: "Возвращает обратную функцию интегрального логнормального распределения",
    abstract: "Возвращает обратную функцию интегрального логнормального распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BB%D0%BE%D0%B3%D0%BD%D0%BE%D1%80%D0%BC-%D0%BE%D0%B1%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BB%D0%BE%D0%B3%D0%BD%D0%BE%D1%80%D0%BC-%D0%BE%D0%B1%D1%80-fe79751a-f1f2-4af8-a0a1-e151b2d4f600"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, связанная с логнормальным распределением."
      },
      mean: {
        name: "среднее",
        detail: "Среднее арифметическое распределения."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение распределения."
      }
    }
  },
  MARGINOFERROR: {
    description: "Рассчитывает предельную погрешность исходя из диапазона значений и уровня доверия",
    abstract: "Рассчитывает предельную погрешность исходя из диапазона значений и уровня доверия",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/12487850?hl=ru&sjid=11250989209896695200-AP"
    }],
    functionParameter: {
      range: {
        name: "диапазон",
        detail: "Диапазон значений, который используется для расчета предельной погрешности."
      },
      confidence: {
        name: "доверие",
        detail: "Нужный уровень доверия в интервале от 0 до 1."
      }
    }
  },
  MAX: {
    description: "Возвращает наибольшее значение из набора значений",
    abstract: "Возвращает наибольшее значение из набора значений",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B0%D0%BA%D1%81-e0012414-9ac8-4b34-9a47-73e662c08098"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число, ссылка на ячейку или диапазон для расчета максимального значения."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны для расчета максимального значения, вплоть до максимального значения 255."
      }
    }
  },
  MAXA: {
    description: "Возвращает наибольшее значение в списке аргументов",
    abstract: "Возвращает наибольшее значение в списке аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B0%D0%BA%D1%81%D0%B0-814bda1e-3840-4bff-9365-2f59ac2ee62d"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "Первый числовой аргумент, для которого требуется найти наибольшее значение."
      },
      value2: {
        name: "значение2",
        detail: "Числовые аргументы от 2 до 255, для которых требуется найти наибольшее значение."
      }
    }
  },
  MAXIFS: {
    description: "Возвращает максимальное значение из заданных определенными условиями или критериями ячеек",
    abstract: "Возвращает максимальное значение из заданных определенными условиями или критериями ячеек",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%B0%D0%BA%D1%81%D0%B5%D1%81%D0%BB%D0%B8-dfd611e6-da2c-488a-919b-9b6376b28883"
    }],
    functionParameter: {
      maxRange: {
        name: "макс диапазон",
        detail: "Диапазон ячеек до максимума"
      },
      criteriaRange1: {
        name: "диапазон условий1",
        detail: "Является ли набор ячеек для оценки по критериям."
      },
      criteria1: {
        name: "условие1",
        detail: "Условие в виде числа, выражения или текста, определяющее ячейки, которые имеют максимальное значение."
      },
      criteriaRange2: {
        name: "диапазон условий2",
        detail: "Дополнительные диапазоны и условия для них. Можно ввести до 126 пар диапазонов и условий."
      },
      criteria2: {
        name: "условие2",
        detail: "Дополнительные сопутствующие критерии. Вы можете ввести до 127 критериев."
      }
    }
  },
  MEDIAN: {
    description: "Возвращает медиану заданных чисел",
    abstract: "Возвращает медиану заданных чисел",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B5%D0%B4%D0%B8%D0%B0%D0%BD%D0%B0-d0916313-4753-414c-8537-ce85bdd967d2"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый номер, ссылка на ячейку или диапазон, для которого необходимо получить указанные числа."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные номера, ссылки на ячейки или диапазоны, для которых вы хотите получить указанные номера, максимум до 255."
      }
    }
  },
  MIN: {
    description: "Возвращает наименьшее значение в списке аргументов",
    abstract: "Возвращает наименьшее значение в списке аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B8%D0%BD-61635d12-920f-4ce2-a70f-96f202dcc152"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число, ссылка на ячейку или диапазон для расчета минимального значения."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны для расчета минимального значения, вплоть до максимального значения 255."
      }
    }
  },
  MINA: {
    description: "Возвращает наименьшее значение в списке аргументов",
    abstract: "Возвращает наименьшее значение в списке аргументов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B8%D0%BD%D0%B0-245a6f46-7ca5-4dc7-ab49-805341bc31d3"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "Первое число, ссылка на ячейку или диапазон для расчета минимального значения."
      },
      value2: {
        name: "значение2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны для расчета минимального значения, вплоть до максимального значения 255."
      }
    }
  },
  MINIFS: {
    description: "Возвращает минимальное значение из заданных определенными условиями или критериями ячеек",
    abstract: "Возвращает минимальное значение из заданных определенными условиями или критериями ячеек",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%B8%D0%BD%D0%B5%D1%81%D0%BB%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%B8%D0%BD%D0%B5%D1%81%D0%BB%D0%B8-6ca1ddaa-079b-4e74-80cc-72eef32e6599"
    }],
    functionParameter: {
      minRange: {
        name: "минимальный диапазон",
        detail: "Фактический диапазон ячеек, для которого определяется минимальное значение."
      },
      criteriaRange1: {
        name: "диапазон условий1",
        detail: "Является ли набор ячеек для оценки по критериям."
      },
      criteria1: {
        name: "условие1",
        detail: "Условие в виде числа, выражения или текста, определяющее ячейки, которые имеют минимальное значение. Такой же набор условий используется для функций MAXIFS, SUMIFS и AVERAGEIFS."
      },
      criteriaRange2: {
        name: "диапазон условий2",
        detail: "Дополнительные диапазоны. Вы можете ввести до 127 диапазонов."
      },
      criteria2: {
        name: "условие2",
        detail: "Дополнительные сопутствующие критерии. Вы можете ввести до 127 критериев."
      }
    }
  },
  MODE_MULT: {
    description: "Возвращает вертикальный массив из наиболее часто встречающихся (повторяющихся) значений в массиве или диапазоне данных",
    abstract: "Возвращает вертикальный массив из наиболее часто встречающихся (повторяющихся) значений в массиве или диапазоне данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BC%D0%BE%D0%B4%D0%B0-%D0%BD%D1%81%D0%BA-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BC%D0%BE%D0%B4%D0%B0-%D0%BD%D1%81%D0%BA-50fd9464-b2ba-4191-b57a-39446689ae8c"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, для которого требуется вычислить моду."
      },
      number2: {
        name: "число2",
        detail: "От 1 до 254 числовых аргументов, для которых требуется вычислить моду. Вместо аргументов, разделенных точкой с запятой, можно использовать массив или ссылку на массив."
      }
    }
  },
  MODE_SNGL: {
    description: "Возвращает наиболее распространенное значение в наборе данных",
    abstract: "Возвращает наиболее распространенное значение в наборе данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/mode-sngl-function-f1267c16-66c6-4386-959f-8fba5f8bb7f8"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, для которого требуется вычислить моду."
      },
      number2: {
        name: "число2",
        detail: "От 1 до 254 числовых аргументов, для которых требуется вычислить моду. Вместо аргументов, разделенных точкой с запятой, можно использовать массив или ссылку на массив."
      }
    }
  },
  NEGBINOM_DIST: {
    description: "Возвращает отрицательное биномиальное распределение",
    abstract: "Возвращает отрицательное биномиальное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BE%D1%82%D1%80%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BE%D1%82%D1%80%D0%B1%D0%B8%D0%BD%D0%BE%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-c8239f89-c2d0-45bd-b6af-172e570f8599"
    }],
    functionParameter: {
      numberF: {
        name: "чисдл неудач",
        detail: "Количество неудачных испытаний."
      },
      numberS: {
        name: "число успехов",
        detail: "Пороговое значение числа успешных испытаний."
      },
      probabilityS: {
        name: "вероятность успеха",
        detail: "Вероятность успеха."
      },
      cumulative: {
        name: "совокупный",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция NEGBINOM_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения.'
      }
    }
  },
  NORM_DIST: {
    description: "Возвращает нормальную функцию распределения",
    abstract: "Возвращает нормальную функцию распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC-%D1%80%D0%B0%D1%81%D0%BF-edb1cc14-a21c-4e53-839d-8082074c9f8d"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      mean: {
        name: "среднее",
        detail: "Среднее арифметическое распределения."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение распределения."
      },
      cumulative: {
        name: "интегральная",
        detail: "Логическое значение, определяющее форму функции. Если кумулятив имеет значение TRUE, НОРМ. DIST возвращает функцию накопительного распределения; Значение FALSE возвращает функцию плотности вероятности."
      }
    }
  },
  NORM_INV: {
    description: "Возвращает обратное нормальное распределение для указанного среднего и стандартного отклонения",
    abstract: "Возвращает обратное нормальное распределение для указанного среднего и стандартного отклонения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC-%D0%BE%D0%B1%D1%80-54b30935-fee7-493c-bedb-2278a9db7e13"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, соответствующая нормальному распределению."
      },
      mean: {
        name: "среднее",
        detail: "Среднее арифметическое распределения."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение распределения."
      }
    }
  },
  NORM_S_DIST: {
    description: "Возвращает стандартное нормальное распределение",
    abstract: "Возвращает стандартное нормальное распределение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC-%D1%81%D1%82-%D1%80%D0%B0%D1%81%D0%BF-1e787282-3832-4520-a9ae-bd2a8d99ba88"
    }],
    functionParameter: {
      z: {
        name: "z",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      cumulative: {
        name: "совокупный",
        detail: "Совокупный аргумент может иметь значение TRUE или FALSE. Это логическое значение определяет форму функции. Если совокупное значение равно TRUE, NORM_S_DIST возвращает функцию накопительного распределения. Если значение равно FALSE, возвращается функция вероятностной массы."
      }
    }
  },
  NORM_S_INV: {
    description: "Возвращает обратное значение стандартного нормального распределения",
    abstract: "Возвращает обратное значение стандартного нормального распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BD%D0%BE%D1%80%D0%BC-%D1%81%D1%82-%D0%BE%D0%B1%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC-%D1%81%D1%82-%D0%BE%D0%B1%D1%80-d6d556b4-ab7f-49cd-b526-5a20918452b1"
    }],
    functionParameter: { probability: {
      name: "вероятность",
      detail: "Вероятность, соответствующая нормальному распределению."
    } }
  },
  PEARSON: {
    description: "Возвращает коэффициент корреляции Пирсона",
    abstract: "Возвращает коэффициент корреляции Пирсона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%B8%D1%80%D1%81%D0%BE%D0%BD-0c3e30fc-e5af-49c4-808a-3ef66e034c18"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Зависимый массив или интервал данных."
      },
      array2: {
        name: "массив2",
        detail: "Независимый массив или интервал данных."
      }
    }
  },
  PERCENTILE_EXC: {
    description: "Возвращает k-й процентиль значений в наборе данных (исключая 0 и 1)",
    abstract: "Возвращает k-й процентиль значений в наборе данных (исключая 0 и 1)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D0%B8%D0%BB%D1%8C-%D0%B8%D1%81%D0%BA%D0%BB-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D0%B8%D0%BB%D1%8C-%D0%B8%D1%81%D0%BA%D0%BB-bbaa7204-e9e1-4010-85bf-c31dc5dce4ba"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, который определяет относительное положение."
      },
      k: {
        name: "k",
        detail: "Массив или диапазон данных, который определяет относительное положение."
      }
    }
  },
  PERCENTILE_INC: {
    description: "Возвращает k-й процентиль значений в диапазоне, где k находится в диапазоне от 0 до 1 включительно",
    abstract: "Возвращает k-й процентиль значений в диапазоне, где k находится в диапазоне от 0 до 1 включительно",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D0%B8%D0%BB%D1%8C-%D0%B2%D0%BA%D0%BB-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D0%B8%D0%BB%D1%8C-%D0%B2%D0%BA%D0%BB-680f9539-45eb-410b-9a5e-c1355e5fe2ed"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, который определяет относительное положение."
      },
      k: {
        name: "k",
        detail: "Значение процентиля в диапазоне от 0 до 1 включительно."
      }
    }
  },
  PERCENTRANK_EXC: {
    description: "Возвращает ранг значения в наборе данных как процентное содержание в наборе данных (от 0 до 1, не включая эти числа)",
    abstract: "Возвращает ранг значения в наборе данных как процентное содержание в наборе данных (от 0 до 1, не включая эти числа)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BD%D0%B3-%D0%B8%D1%81%D0%BA%D0%BB-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BD%D0%B3-%D0%B8%D1%81%D0%BA%D0%BB-d8afee96-b7e2-4a2f-8c01-8fcdedaa6314"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, который определяет относительное положение."
      },
      x: {
        name: "x",
        detail: "Значение, для которого определяется ранг."
      },
      significance: {
        name: "разрядность",
        detail: "Значение, определяющее количество значимых цифр для возвращаемого процентного значения. Если этот аргумент опущен, для функции PERCENTRANK_EXC используются три цифры (0,xxx)."
      }
    }
  },
  PERCENTRANK_INC: {
    description: "Возвращает ранг значения в наборе данных как процентное содержание в наборе данных (от 0 до 1, включая эти числа)",
    abstract: "Возвращает ранг значения в наборе данных как процентное содержание в наборе данных (от 0 до 1, включая эти числа)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BD%D0%B3-%D0%B2%D0%BA%D0%BB-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D1%80%D0%BE%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BD%D0%B3-%D0%B2%D0%BA%D0%BB-149592c9-00c0-49ba-86c1-c1f45b80463a"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, который определяет относительное положение."
      },
      x: {
        name: "x",
        detail: "Значение, для которого определяется ранг."
      },
      significance: {
        name: "разрядность",
        detail: "Значение, определяющее количество значимых цифр для возвращаемого процентного значения. Если этот аргумент опущен, для функции PERCENTRANK_INC используются три цифры (0,xxx)."
      }
    }
  },
  PERMUT: {
    description: "Возвращает количество перестановок для заданного числа объектов, которые выбираются из общего числа объектов",
    abstract: "Возвращает количество перестановок для заданного числа объектов, которые выбираются из общего числа объектов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%B5%D1%80%D0%B5%D1%81%D1%82-3bd1cb9a-2880-41ab-a197-f246a7a602d3"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Целое число, задающее количество объектов."
      },
      numberChosen: {
        name: "число выбранных",
        detail: "Целое число, задающее количество объектов в каждой перестановке."
      }
    }
  },
  PERMUTATIONA: {
    description: "Возвращает количество перестановок для заданного числа объектов (с повторами), которые можно выбрать из общего числа объектов",
    abstract: "Возвращает количество перестановок для заданного числа объектов (с повторами), которые можно выбрать из общего числа объектов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BF%D0%B5%D1%80%D0%B5%D1%81%D1%82%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BF%D0%B5%D1%80%D0%B5%D1%81%D1%82%D0%B0-6c7d7fdc-d657-44e6-aa19-2857b25cae4e"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Целое число, задающее количество объектов."
      },
      numberChosen: {
        name: "число выбранных",
        detail: "Целое число, задающее количество объектов в каждой перестановке."
      }
    }
  },
  PHI: {
    description: "Возвращает значение функции плотности для стандартного нормального распределения.",
    abstract: "Возвращает значение функции плотности для стандартного нормального распределения.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D0%B8-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%84%D0%B8-23e49bc6-a8e8-402d-98d3-9ded87f6295c"
    }],
    functionParameter: { x: {
      name: "x",
      detail: "X — это число, для которого необходимо установить плотность стандартного нормального распределения."
    } }
  },
  POISSON_DIST: {
    description: "Возвращает распределение Пуассона",
    abstract: "Возвращает распределение Пуассона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/poisson-dist-function-8fe148ff-39a2-46cb-abf3-7772695d9636"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      mean: {
        name: "среднее",
        detail: "Среднее арифметическое распределения."
      },
      cumulative: {
        name: "совокупный",
        detail: "Логическое значение, определяющее форму функции. Если кумулятивное значение равно True, функция POISSON_DIST возвращает кумулятивную функцию распределения; если False, функция возвращает функцию плотности вероятности."
      }
    }
  },
  PROB: {
    description: "Возвращает вероятность того, что значение из интервала находится внутри заданных пределов",
    abstract: "Возвращает вероятность того, что значение из интервала находится внутри заданных пределов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D0%B5%D1%80%D0%BE%D1%8F%D1%82%D0%BD%D0%BE%D1%81%D1%82%D1%8C-9ac30561-c81c-4259-8253-34f0a238fc49"
    }],
    functionParameter: {
      xRange: {
        name: "х интервал",
        detail: "Диапазон числовых значений x, с которыми связаны вероятности."
      },
      probRange: {
        name: "интервал вероятностей",
        detail: 'Множество вероятностей, соответствующих значениям в аргументе "х интервал".'
      },
      lowerLimit: {
        name: "нижний предел",
        detail: "Нижняя граница значения, для которого вычисляется вероятность."
      },
      upperLimit: {
        name: "верхний предел",
        detail: "Верхняя граница значения, для которого вычисляется вероятность."
      }
    }
  },
  QUARTILE_EXC: {
    description: "Возвращает квартил набора данных на основе значений процентилей (исключающих 0 и 1)",
    abstract: "Возвращает квартил набора данных на основе значений процентилей (исключающих 0 и 1)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BA%D0%B2%D0%B0%D1%80%D1%82%D0%B8%D0%BB%D1%8C-%D0%B8%D1%81%D0%BA%D0%BB-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%B2%D0%B0%D1%80%D1%82%D0%B8%D0%BB%D1%8C-%D0%B8%D1%81%D0%BA%D0%BB-5a355b7a-840b-4a01-b0f1-f538c2864cad"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон ячеек с числовыми значениями, для которых определяется значение квартиля."
      },
      quart: {
        name: "часть",
        detail: "Значение, которое требуется вернуть."
      }
    }
  },
  QUARTILE_INC: {
    description: "Возвращает квартиль набора данных на основе значений процентили от 0 до 1 (включительно).",
    abstract: "Возвращает квартиль набора данных на основе значений процентили от 0 до 1 (включительно).",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%BA%D0%B2%D0%B0%D1%80%D1%82%D0%B8%D0%BB%D1%8C-%D0%B2%D0%BA%D0%BB-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%B2%D0%B0%D1%80%D1%82%D0%B8%D0%BB%D1%8C-%D0%B2%D0%BA%D0%BB-1bbacc80-5075-42f1-aed6-47d735c4819d"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон ячеек с числовыми значениями, для которых определяется значение квартиля."
      },
      quart: {
        name: "часть",
        detail: "Значение, которое требуется вернуть."
      }
    }
  },
  RANK_AVG: {
    description: "Возвращает ранг числа в списке чисел: его размер относительно других значений в списке",
    abstract: "Возвращает ранг числа в списке чисел: его размер относительно других значений в списке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%80%D0%B0%D0%BD%D0%B3-%D1%81%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%80%D0%B0%D0%BD%D0%B3-%D1%81%D1%80-bd406a6f-eb38-4d73-aa8e-6d1c3c72e83a"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, для которого определяется ранг."
      },
      ref: {
        name: "ссылка",
        detail: "Массив чисел или ссылка на список чисел. Нечисловые значения в ссылке игнорируются."
      },
      order: {
        name: "порядок",
        detail: "Число, определяющее способ упорядочения."
      }
    }
  },
  RANK_EQ: {
    description: "Возвращает ранг числа в списке чисел: его размер относительно других значений в списке",
    abstract: "Возвращает ранг числа в списке чисел: его размер относительно других значений в списке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/rank-eq-function-284858ce-8ef6-450e-b662-26245be04a40"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, для которого определяется ранг."
      },
      ref: {
        name: "ссылка",
        detail: "Массив чисел или ссылка на список чисел. Нечисловые значения в ссылке игнорируются."
      },
      order: {
        name: "порядок",
        detail: "Число, определяющее способ упорядочения."
      }
    }
  },
  RSQ: {
    description: "Возвращает квадрат коэффициента корреляции Пирсона",
    abstract: "Возвращает квадрат коэффициента корреляции Пирсона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BA%D0%B2%D0%BF%D0%B8%D1%80%D1%81%D0%BE%D0%BD-d7161715-250d-4a01-b80d-a8364f2be08f"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Зависимый массив или интервал данных."
      },
      array2: {
        name: "массив2",
        detail: "Независимый массив или интервал данных."
      }
    }
  },
  SKEW: {
    description: "Возвращает асимметрию распределения",
    abstract: "Возвращает асимметрию распределения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BA%D0%BE%D1%81-bdf49d86-b1ef-4804-a046-28eaea69c9fa"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число, ссылка на ячейку или диапазон, для которого нужно определить асимметрию"
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых требуется определить асимметрию, максимум до 255."
      }
    }
  },
  SKEW_P: {
    description: "Возвращает асимметрию распределения на основе заполнения",
    abstract: "Возвращает асимметрию распределения на основе заполнения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D0%BA%D0%BE%D1%81-%D0%B3-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D0%BA%D0%BE%D1%81-%D0%B3-76530a5c-99b9-48a1-8392-26632d542fcb"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первое число, ссылка на ячейку или диапазон, для которого нужно определить асимметри."
      },
      number2: {
        name: "число2",
        detail: "Дополнительные числа, ссылки на ячейки или диапазоны, для которых требуется определить асимметрию, максимум до 255."
      }
    }
  },
  SLOPE: {
    description: "Возвращает наклон линии линейной регрессии для точек данных ",
    abstract: "Возвращает наклон линии линейной регрессии для точек данных ",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B0%D0%BA%D0%BB%D0%BE%D0%BD-11fb8f97-3117-4813-98aa-61d7e01276b9"
    }],
    functionParameter: {
      knownYs: {
        name: "известные значения Y",
        detail: "Зависимый массив или интервал данных."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Независимый массив или интервал данных."
      }
    }
  },
  SMALL: {
    description: "Возвращает k-ое наименьшее значение в множестве данных",
    abstract: "Возвращает k-ое наименьшее значение в множестве данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%B0%D0%B8%D0%BC%D0%B5%D0%BD%D1%8C%D1%88%D0%B8%D0%B9-17da8222-7c82-42b2-961b-14c45384df07"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон числовых данных, для которого определяется k-ое наименьшее значение."
      },
      k: {
        name: "k",
        detail: "Позиция (начиная с наименьшего числа) в массиве или диапазоне данных."
      }
    }
  },
  STANDARDIZE: {
    description: "Возвращает нормализованное значение для распределения, характеризуемого средним и стандартным отклонением",
    abstract: "Возвращает нормализованное значение для распределения, характеризуемого средним и стандартным отклонением",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%BD%D0%BE%D1%80%D0%BC%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D1%8F-81d66554-2d54-40ec-ba83-6437108ee775"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Нормализуемое значение."
      },
      mean: {
        name: "среднее",
        detail: "Среднее арифметическое распределения."
      },
      standardDev: {
        name: "стандартное отклонение",
        detail: "Стандартное отклонение распределения."
      }
    }
  },
  STDEV_P: {
    description: "Вычисляет стандартное отклонение по генеральной совокупности, заданной аргументами. При этом логические значения и текст игнорируются",
    abstract: "Вычисляет стандартное отклонение по генеральной совокупности, заданной аргументами",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD-%D0%B3-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD-%D0%B3-6e917c05-31a0-496f-ade7-4f4e7462f285"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий генеральной совокупности."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы 2—254, соответствующие генеральной совокупности. Вместо аргументов, разделенных точкой с запятой, можно использовать массив или ссылку на массив."
      }
    }
  },
  STDEV_S: {
    description: "Оценивает стандартное отклонение по выборке. Логические значения и текст игнорируются",
    abstract: "Оценивает стандартное отклонение по выборке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD-%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD-%D0%B2-7d69cf97-0c1f-4acf-be27-f3e83904cc23"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий выборке из генеральной совокупности. Вместо аргументов, разделенных точкой с запятой, можно использовать массив или ссылку на массив."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы 2—254, соответствующие выборке из генеральной совокупности. Вместо аргументов, разделенных точкой с запятой, можно использовать массив или ссылку на массив."
      }
    }
  },
  STDEVA: {
    description: "Оценивает стандартное отклонение по выборке",
    abstract: "Оценивает стандартное отклонение по выборке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD%D0%B0-5ff38888-7ea5-48de-9a6d-11ed73b29e9d"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "Первый аргумент-значение, соответствующий выборке из генеральной совокупности. Вместо аргументов, разделённых запятыми, можно также использовать отдельный массив или ссылку на массив."
      },
      value2: {
        name: "значение2",
        detail: "Аргументы со значениями от 2 до 254, соответствующие выборке из генеральной совокупности. Вместо аргументов, разделённых запятыми, можно также использовать один массив или ссылку на массив."
      }
    }
  },
  STDEVPA: {
    description: "Вычисляет стандартное отклонение по генеральной совокупности, заданной аргументами, которые могут включать текст и логические значения",
    abstract: "Вычисляет стандартное отклонение по генеральной совокупности, заданной аргументами, которые могут включать текст и логические значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD%D0%BF%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%B0%D0%BD%D0%B4%D0%BE%D1%82%D0%BA%D0%BB%D0%BE%D0%BD%D0%BF%D0%B0-5578d4d6-455a-4308-9991-d405afe2c28c"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "Первый аргумент значения, соответствующий популяции."
      },
      value2: {
        name: "значение2",
        detail: "Аргументы значений от 2 до 254, соответствующие генеральной совокупности. Вы также можете использовать один массив или ссылку на массив вместо аргументов, разделённых запятыми."
      }
    }
  },
  STEYX: {
    description: "Возвращает стандартную ошибку предсказанных значений y для каждого значения x в регрессии.",
    abstract: "Возвращает стандартную ошибку предсказанных значений y для каждого значения x в регрессии.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D0%BE%D1%88yx-6ce74b2c-449d-4a6e-b9ac-f9cef5ba48ab"
    }],
    functionParameter: {
      knownYs: {
        name: "известные значения Y",
        detail: "Зависимый массив или интервал данных."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Независимый массив или интервал данных."
      }
    }
  },
  T_DIST: {
    description: "Возвращает левостороннее t-распределение Стьюдента",
    abstract: "Возвращает левостороннее t-распределение Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D1%80%D0%B0%D1%81%D0%BF-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D1%80%D0%B0%D1%81%D0%BF-4329459f-ae91-48c2-bba8-1ead1c6c21b2"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Числовое значение, для которого требуется вычислить распределение."
      },
      degFreedom: {
        name: "степени свободы",
        detail: "Целое, указывающее число степеней свободы."
      },
      cumulative: {
        name: "интегральная",
        detail: 'Логическое значение, определяющее форму функции. Если аргумент "интегральная" имеет значение True, функция T_DIST возвращает интегральную функцию распределения; если этот аргумент имеет значение False, возвращается функция плотности распределения.'
      }
    }
  },
  T_DIST_2T: {
    description: "Возвращает двустороннее t-распределение Стьюдента",
    abstract: "Возвращает двустороннее t-распределение Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D1%80%D0%B0%D1%81%D0%BF-2%D1%85-198e9340-e360-4230-bd21-f52f22ff5c28"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Числовое значение, для которого требуется вычислить распределение."
      },
      degFreedom: {
        name: "степени свободы",
        detail: "Целое, указывающее число степеней свободы."
      }
    }
  },
  T_DIST_RT: {
    description: "Возвращает правостороннее t-распределение Стьюдента",
    abstract: "Возвращает правостороннее t-распределение Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D1%80%D0%B0%D1%81%D0%BF-%D0%BF%D1%85-20a30020-86f9-4b35-af1f-7ef6ae683eda"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Числовое значение, для которого требуется вычислить распределение."
      },
      degFreedom: {
        name: "степени свободы",
        detail: "Целое, указывающее число степеней свободы."
      }
    }
  },
  T_INV: {
    description: "Возвращает левостороннее обратное t-распределение Стьюдента",
    abstract: "Возвращает левостороннее обратное t-распределение Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D0%BE%D0%B1%D1%80-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D0%BE%D0%B1%D1%80-2908272b-4e61-4942-9df9-a25fec9b0e2e"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, соответствующая t-распределению Стьюдента."
      },
      degFreedom: {
        name: "степени свободы",
        detail: "Целое, указывающее число степеней свободы."
      }
    }
  },
  T_INV_2T: {
    description: "Возвращает двустороннее обратное t-распределение Стьюдента.",
    abstract: "Возвращает двустороннее обратное t-распределение Стьюдента.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D0%BE%D0%B1%D1%80-2%D1%85-ce72ea19-ec6c-4be7-bed2-b9baf2264f17"
    }],
    functionParameter: {
      probability: {
        name: "вероятность",
        detail: "Вероятность, соответствующая t-распределению Стьюдента."
      },
      degFreedom: {
        name: "степени свободы",
        detail: "Целое, указывающее число степеней свободы."
      }
    }
  },
  T_TEST: {
    description: "Возвращает вероятность, соответствующую t-тесту Стьюдента",
    abstract: "Возвращает вероятность, соответствующую t-тесту Стьюдента",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82-%D1%82%D0%B5%D1%81%D1%82-d4e08ec3-c545-485f-962e-276f7cbed055"
    }],
    functionParameter: {
      array1: {
        name: "массив1",
        detail: "Первый массив или диапазон данных."
      },
      array2: {
        name: "массив2",
        detail: "Второй массив или диапазон данных."
      },
      tails: {
        name: "хвосты",
        detail: 'Число хвостов распределения. Если значение "хвосты" = 1, функция T_TEST возвращает одностороннее распределение. Если значение "хвосты" = 2, функция T_TEST возвращает двустороннее распределение.'
      },
      type: {
        name: "тип",
        detail: "Вид выполняемого t-теста."
      }
    }
  },
  TREND: {
    description: "Возвращает значения по линейному тренду",
    abstract: "Возвращает значения по линейному тренду",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%82%D0%B5%D0%BD%D0%B4%D0%B5%D0%BD%D1%86%D0%B8%D1%8F-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%82%D0%B5%D0%BD%D0%B4%D0%B5%D0%BD%D1%86%D0%B8%D1%8F-e2f135f0-8827-4096-9873-9a7cf7b51ef1"
    }],
    functionParameter: {
      knownYs: {
        name: "известные значения Y",
        detail: "Множество значений y, которые уже известны для соотношения y = mx + b."
      },
      knownXs: {
        name: "известные значения X",
        detail: "Множество значений x, которые уже известны для соотношения y = mx + b."
      },
      newXs: {
        name: "новые значения X",
        detail: "Являются ли новые значения x, для которых функция TREND должна возвращать соответствующие значения y."
      },
      constb: {
        name: "конст",
        detail: "Логическое значение, которое указывает, требуется ли, чтобы константа b была равна 0."
      }
    }
  },
  TRIMMEAN: {
    description: "Возвращает среднее внутренности множества данных",
    abstract: "Возвращает среднее внутренности множества данных",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D1%83%D1%80%D0%B5%D0%B7%D1%81%D1%80%D0%B5%D0%B4%D0%BD%D0%B5%D0%B5-d90c9878-a119-4746-88fa-63d988f511d3"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон усекаемых и усредняемых значений."
      },
      percent: {
        name: "доля",
        detail: "Доля точек данных, исключаемых из вычислений."
      }
    }
  },
  VAR_P: {
    description: "Вычисляет дисперсию для генеральной совокупности. Логические значения и текст игнорируются",
    abstract: "Вычисляет дисперсию для генеральной совокупности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%B8%D1%81%D0%BF-%D0%B3-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B8%D1%81%D0%BF-%D0%B3-73d1285c-108c-4843-ba5d-a51f90656f3a"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий генеральной совокупности."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы 2—254, соответствующие генеральной совокупности."
      }
    }
  },
  VAR_S: {
    description: "Оценивает дисперсию на основе выборки (игнорирует логические значения и текст в выборке)",
    abstract: "Оценивает дисперсию на основе выборки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D0%B4%D0%B8%D1%81%D0%BF-%D0%B2-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B8%D1%81%D0%BF-%D0%B2-913633de-136b-449d-813e-65a00b2b990b"
    }],
    functionParameter: {
      number1: {
        name: "число1",
        detail: "Первый числовой аргумент, соответствующий выборке из популяции."
      },
      number2: {
        name: "число2",
        detail: "Числовые аргументы от 2 до 254, соответствующие выборке из генеральной совокупности."
      }
    }
  },
  VARA: {
    description: "Оценивает дисперсию на основе выборки, включая числа, текст и логические значения.",
    abstract: "Оценивает дисперсию на основе выборки, включая числа, текст и логические значения.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B8%D1%81%D0%BF%D0%B0-3de77469-fa3a-47b4-85fd-81758a1e1d07"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "Аргумент числового значения, соответствующий выборке из популяции."
      },
      value2: {
        name: "значение2",
        detail: "Значения аргументов от 2 до 254, соответствующие выборке из популяции."
      }
    }
  },
  VARPA: {
    description: "Вычисляет дисперсию для генеральной совокупности",
    abstract: "Вычисляет дисперсию для генеральной совокупности",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B4%D0%B8%D1%81%D0%BF%D1%80%D0%B0-59a62635-4e89-4fad-88ac-ce4dc0513b96"
    }],
    functionParameter: {
      value1: {
        name: "значение1",
        detail: "Первый аргумент значения, соответствующий популяции."
      },
      value2: {
        name: "значение2",
        detail: "Аргументы значений от 2 до 254, соответствующие популяции."
      }
    }
  },
  WEIBULL_DIST: {
    description: "Возвращает распределение Вейбулла",
    abstract: "Возвращает распределение Вейбулла",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-%D0%B2%D0%B5%D0%B9%D0%B1%D1%83%D0%BB%D0%BB-%D1%80%D0%B0%D1%81%D0%BF-4e783c39-9325-49be-bbc9-a83ef82b45db"
    }],
    functionParameter: {
      x: {
        name: "x",
        detail: "Значение, для которого требуется вычислить распределение."
      },
      alpha: {
        name: "альфа",
        detail: "Параметр распределения."
      },
      beta: {
        name: "бета",
        detail: "Параметр распределения."
      },
      cumulative: {
        name: "интегральная",
        detail: "Логическое значение, определяющее вид функции. Если кумулятивное значение равно True, функция WEIBULL_DIST возвращает кумулятивную функцию распределения; если False, функция возвращает функцию плотности вероятности."
      }
    }
  },
  Z_TEST: {
    description: "Возвращает одностороннее P-значение z-теста",
    abstract: "Возвращает одностороннее P-значение z-теста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/z-%D1%82%D0%B5%D1%81%D1%82-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F-z-%D1%82%D0%B5%D1%81%D1%82-d633d5a3-2031-4614-a016-92180ad82bee"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив или диапазон данных, с которыми сравнивается x."
      },
      x: {
        name: "x",
        detail: "Проверяемое значение."
      },
      sigma: {
        name: "cигма",
        detail: "Известное стандартное отклонение генеральной совокупности. Если этот аргумент опущен, используется стандартное отклонение выборки."
      }
    }
  }
};
const locale$4 = {
  ASC: {
    description: "Преобразует символы полного (двойного) байта английских букв или катаканы внутри строки символов в символы половинного (одинарного) байта",
    abstract: "Преобразует символы полного (двойного) байта английских букв или катаканы внутри строки символов в символы половинного (одинарного) байта",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/asc-function-0b6abf1c-c663-4004-a964-ebc00b723266"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Текст или ссылка на ячейку с текстом, который необходимо изменить. Если текст не содержит полноширинных знаков, он не изменяется."
    } }
  },
  ARRAYTOTEXT: {
    description: "Возвращает массив текстовых значений из любого указанного диапазона",
    abstract: "Возвращает массив текстовых значений из любого указанного диапазона",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/arraytotext-function-9cdcad46-2fa5-4c6b-ac92-14e7bc862b8b"
    }],
    functionParameter: {
      array: {
        name: "массив",
        detail: "Массив, возвращаемый в виде текста."
      },
      format: {
        name: "формат",
        detail: "Формат возвращаемых данных. Это может быть одно из двух значений:\n0 По умолчанию. Краткий формат, удобный для чтения.\n1 Строгий формат, включающий escape-символы и разделители строк. Создает строку, которую можно анализировать при вводе в строку формул. Заключает возвращаемые строки в кавычки, кроме логических значений, чисел и ошибок."
      }
    }
  },
  BAHTTEXT: {
    description: "Преобразует число в текст, используя валютный формат ß (бат)",
    abstract: "Преобразует число в текст, используя валютный формат ß (бат)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/bahttext-function-5ba4d0b4-abd3-4325-8d22-7a92d59aab9c"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Число, которое нужно преобразовать в текст, ссылка на ячейку, содержащую число, или формула, дающая в результате числовое значение."
    } }
  },
  CHAR: {
    description: "Возвращает символ, указанный номером кода",
    abstract: "Возвращает символ, указанный номером кода",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/char-function-bbd249c8-b36e-4a91-8017-1c133f9b837a"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "Число от 1 до 255, определяющее нужный знак. Знаки выбираются из набора знаков компьютера."
    } }
  },
  CLEAN: {
    description: "Удаляет все непечатаемые символы из текста",
    abstract: "Удаляет все непечатаемые символы из текста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/clean-function-26f3d7c5-475f-4a9c-90e5-4b8ba987ba41"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Любые данные на листе, из которых нужно удалить непечатаемые знаки."
    } }
  },
  CODE: {
    description: "Возвращает числовой код для первого символа в текстовой строке",
    abstract: "Возвращает числовой код для первого символа в текстовой строке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/code-function-c32b692b-2ed0-4a04-bdd9-75640144b928"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Текст, для которого требуется узнать код первого знака."
    } }
  },
  CONCAT: {
    description: "Объединяет текст из нескольких диапазонов и/или строк, но не предоставляет аргументы разделителя или IgnoreEmpty.",
    abstract: "Объединяет текст из нескольких диапазонов и/или строк, но не предоставляет аргументы разделителя или IgnoreEmpty.",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/concat-function-9b1a9a3f-94ff-41af-9736-694cbd6b4ca2"
    }],
    functionParameter: {
      text1: {
        name: "текст1",
        detail: "Элемент текста, который нужно присоединить. Строка или массив строк, например диапазон ячеек."
      },
      text2: {
        name: "текст2",
        detail: "Дополнительные текстовые элементы для объединения. Для текстовых элементов можно указать до 253 аргументов. Каждый из них может быть строкой или массивом строк, например диапазоном ячеек."
      }
    }
  },
  CONCATENATE: {
    description: "Объединяет несколько текстовых элементов в один текстовый элемент",
    abstract: "Объединяет несколько текстовых элементов в один текстовый элемент",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/concatenate-function-8f8ae884-2ca8-4f7a-b093-75d702bea31d"
    }],
    functionParameter: {
      text1: {
        name: "Текст 1",
        detail: "Первый элемент для объединения. Элемент может быть текстовым значением, числом или ссылкой на ячейку."
      },
      text2: {
        name: "Текст 2",
        detail: "Дополнительные текстовые элементы для объединения. Можно использовать до 255 элементов, общей длиной до 8192 символов."
      }
    }
  },
  DBCS: {
    description: "Преобразует символы половинного (одинарного) байта английских букв или катаканы внутри строки символов в символы полного (двойного) байта",
    abstract: "Преобразует символы половинного (одинарного) байта английских букв или катаканы внутри строки символов в символы полного (двойного) байта",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dbcs-function-a4025e73-63d2-4958-9423-21a24794c9e5"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Текст или ссылка на ячейку с текстом, который необходимо изменить. Если текст не содержит полуширинных английских букв или знаков катаканы, он не изменяется."
    } }
  },
  DOLLAR: {
    description: "Преобразует число в текст, используя валютный формат $ (доллар)",
    abstract: "Преобразует число в текст, используя валютный формат $ (доллар)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/dollar-function-a6cd05d9-9740-4ad3-a469-8109d18ff611"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, ссылка на ячейку, содержащую число, или формула, вычисление которой дает число."
      },
      decimals: {
        name: "число_знаков",
        detail: 'Число цифр справа от десятичной запятой. Если значение отрицательное, число округляется слева от десятичной запятой. Если аргумент "число_знаков" опущен, то он полагается равным 2.'
      }
    }
  },
  EXACT: {
    description: "Проверяет, идентичны ли два текстовых значения",
    abstract: "Проверяет, идентичны ли два текстовых значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/exact-function-d3087698-fc15-4a15-9631-12575cf29926"
    }],
    functionParameter: {
      text1: {
        name: "текст1",
        detail: "Первая текстовая строка."
      },
      text2: {
        name: "текст2",
        detail: "Вторая текстовая строка."
      }
    }
  },
  FIND: {
    description: "Находит одно текстовое значение внутри другого (с учетом регистра)",
    abstract: "Находит одно текстовое значение внутри другого (с учетом регистра)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/find-findb-functions-c7912941-af2a-4bdf-a553-d0d89b0a0628"
    }],
    functionParameter: {
      findText: {
        name: "строка поиска",
        detail: "Строка, которую нужно найти в «Текст для поиска»."
      },
      withinText: {
        name: "текст для поиска",
        detail: "Первое вхождение текста для поиска «строки поиска»."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция символа, с которой начинается поиск в «тексте для поиска». Если опущено, предполагается значение 1."
      }
    }
  },
  FINDB: {
    description: "Находит одно текстовое значение внутри другого (с учетом регистра)",
    abstract: "Находит одно текстовое значение внутри другого (с учетом регистра)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/find-findb-functions-c7912941-af2a-4bdf-a553-d0d89b0a0628"
    }],
    functionParameter: {
      findText: {
        name: "строка поиска",
        detail: "Строка, которую нужно найти в «Текст для поиска»."
      },
      withinText: {
        name: "текст для поиска",
        detail: "Первое вхождение текста для поиска «строки поиска»."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция символа, с которой начинается поиск в «тексте для поиска». Если опущено, предполагается значение 1."
      }
    }
  },
  FIXED: {
    description: "Форматирует число как текст с фиксированным количеством десятичных знаков",
    abstract: "Форматирует число как текст с фиксированным количеством десятичных знаков",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/fixed-function-ffd5723c-324c-45e9-8b96-e41be2a8274a"
    }],
    functionParameter: {
      number: {
        name: "число",
        detail: "Число, которое требуется округлить и преобразовать в текст."
      },
      decimals: {
        name: "число_знаков",
        detail: 'Число цифр справа от десятичной запятой. Если значение отрицательное, число округляется слева от десятичной запятой. Если аргумент "число_знаков" опущен, то он полагается равным 2.'
      },
      noCommas: {
        name: "без_разделителей",
        detail: "Логическое значение, которое, если значение TRUE, не позволяет FIXED включать запятые в возвращаемый текст."
      }
    }
  },
  LEFT: {
    description: "Возвращает крайние левые символы из текстового значения",
    abstract: "Возвращает крайние левые символы из текстового значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/left-leftb-functions-9203d2d2-7960-479b-84c6-1ea52b99640c"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текстовая строка, содержащая символы, которые требуется извлечь."
      },
      numChars: {
        name: "количество_знаков",
        detail: "Количество символов, извлекаемых функцией LEFT."
      }
    }
  },
  LEFTB: {
    description: "Возвращает крайние левые символы из текстового значения",
    abstract: "Возвращает крайние левые символы из текстового значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/left-leftb-functions-9203d2d2-7960-479b-84c6-1ea52b99640c"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текстовая строка, содержащая символы, которые требуется извлечь."
      },
      numBytes: {
        name: "количество_байтов",
        detail: "Указывает в байтах количество символов, извлекаемых функцией LEFTB."
      }
    }
  },
  LEN: {
    description: "Возвращает количество символов в текстовой строке",
    abstract: "Возвращает количество символов в текстовой строке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/len-lenb-functions-29236f94-cedc-429d-affd-b5e33d2c67cb"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Текст, длину которого вы хотите узнать. Пробелы считаются символами."
    } }
  },
  LENB: {
    description: "Возвращает количество байтов, используемых для представления символов в текстовой строке.",
    abstract: "Возвращает количество байтов, используемых для представления символов в текстовой строке",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/len-lenb-functions-29236f94-cedc-429d-affd-b5e33d2c67cb"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Текст, длину которого вы хотите узнать. Пробелы считаются символами."
    } }
  },
  LOWER: {
    description: "Преобразует текст в нижний регистр.",
    abstract: "Преобразует текст в нижний регистр",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/lower-function-3f21df02-a80c-44b2-afaf-81358f9fdeb4"
    }],
    functionParameter: { text: {
      name: "tекст",
      detail: "Текст, преобразуемый в нижний регистр."
    } }
  },
  MID: {
    description: "Возвращает определенное количество символов из текстовой строки, начиная с указанной позиции",
    abstract: "Возвращает определенное количество символов из текстовой строки, начиная с указанной позиции",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/mid-midb-functions-d5f9e25c-d7d6-472e-b568-4ecb12433028"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текстовая строка, содержащая символы, которые требуется извлечь."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция первого знака, извлекаемого из текста."
      },
      numChars: {
        name: "количество_знаков",
        detail: "Количество символов, извлекаемых функцией MID."
      }
    }
  },
  MIDB: {
    description: "Возвращает определенное количество символов из текстовой строки, начиная с указанной позиции",
    abstract: "Возвращает определенное количество символов из текстовой строки, начиная с указанной позиции",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/mid-midb-functions-d5f9e25c-d7d6-472e-b568-4ecb12433028"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текстовая строка, содержащая символы, которые требуется извлечь."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция первого знака, извлекаемого из текста."
      },
      numBytes: {
        name: "количество_байтов",
        detail: "Указывает в байтах количество символов, извлекаемых функцией MIDB."
      }
    }
  },
  NUMBERSTRING: {
    description: "Преобразовать числа в китайские строки",
    abstract: "Преобразовать числа в китайские строки",
    links: [{
      title: "Инструкция",
      url: "https://www.wps.cn/learning/course/detail/id/340.html?chan=pc_kdocs_function"
    }],
    functionParameter: {
      number: {
        name: "Числовой",
        detail: "Числовое значение, преобразуемое в китайскую строку."
      },
      type: {
        name: "тип",
        detail: "Тип возвращаемого результата. \n1. Китайские иероглифы в нижнем регистре \n2. Китайские иероглифы в верхнем регистре \n3. Чтение и написание китайских иероглифов"
      }
    }
  },
  NUMBERVALUE: {
    description: "Преобразует текст в число независимо от региональных стандартов",
    abstract: "Преобразует текст в число независимо от региональных стандартов",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/numbervalue-function-1b05c8cf-2bfa-4437-af70-596c7ea7d879"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текст для преобразования в число."
      },
      decimalSeparator: {
        name: "десятичный_разделитель",
        detail: "Символ, который будет использоваться для разделения дробной и целой части результата."
      },
      groupSeparator: {
        name: "разделитель_групп",
        detail: "Символ, используемый для разделения групп цифр, например тысяч от сотен и миллионов от тысяч."
      }
    }
  },
  PHONETIC: {
    description: "Извлекает фонетические (фуригана) символы из текстовой строки",
    abstract: "Извлекает фонетические (фуригана) символы из текстовой строки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/phonetic-function-9a329dac-0c0f-42f8-9a55-639086988554"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  PROPER: {
    description: "Преобразует первый символ каждого слова в текстовом значении в заглавную букву",
    abstract: "Преобразует первый символ каждого слова в текстовом значении в заглавную букву",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/proper-function-52a5a283-e8b2-49be-8506-b2887b889f94"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Текст в кавычках, формула, возвращающая текст, либо ссылка на ячейку, содержащую текст, в котором требуется заменить некоторые буквы на прописные."
    } }
  },
  REGEXEXTRACT: {
    description: "Извлекает первые части текста, соответствующие регулярному выражению.",
    abstract: "Извлекает первые части текста, соответствующие регулярному выражению.",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/3098244?sjid=5628197291201472796-AP&hl=ru-Ru"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "исходный текст."
      },
      regularExpression: {
        name: "регулярное_выражение",
        detail: "заданное выражение. Будет показано первое совпадение с ним в тексте."
      }
    }
  },
  REGEXMATCH: {
    description: "Проверяет, соответствует ли текст регулярному выражению.",
    abstract: "Проверяет, соответствует ли текст регулярному выражению.",
    links: [{
      title: "Инструкция",
      url: "https://support.google.com/docs/answer/3098292?sjid=5628197291201472796-AP&hl=ru-Ru"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "текст, в котором проверяется наличие заданного выражения."
      },
      regularExpression: {
        name: "регулярное_выражение",
        detail: "фраза, которую нужно найти в тексте."
      }
    }
  },
  REGEXREPLACE: {
    description: "Заменяет часть строки на другой текст с помощью регулярного выражения.",
    abstract: "Заменяет часть строки на другой текст с помощью регулярного выражения.",
    links: [{
      title: "教学",
      url: "https://support.google.com/docs/answer/3098245?sjid=5628197291201472796-AP&hl=ru-Ru"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "текст, часть которого нужно заменить."
      },
      regularExpression: {
        name: "регулярное_выражение",
        detail: "регулярное выражение. Все совпадения с ним в тексте будут заменены."
      },
      replacement: {
        name: "замена",
        detail: "текст, который нужно вставить."
      }
    }
  },
  REPLACE: {
    description: "Заменяет символы в тексте",
    abstract: "Заменяет символы в тексте",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/replace-replaceb-functions-8d799074-2425-4a8a-84bc-82472868878a"
    }],
    functionParameter: {
      oldText: {
        name: "старый текст",
        detail: "Текст, в котором требуется заменить некоторые символы."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция первого символа заменяемого текста."
      },
      numChars: {
        name: "количество_знаков",
        detail: "Количество символов, замененных функцией REPLACE."
      },
      newText: {
        name: "текст замены",
        detail: "Текст, который заменит символы в старом тексте."
      }
    }
  },
  REPLACEB: {
    description: "Заменяет символы в тексте",
    abstract: "Заменяет символы в тексте",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/replace-replaceb-functions-8d799074-2425-4a8a-84bc-82472868878a"
    }],
    functionParameter: {
      oldText: {
        name: "старый текст",
        detail: "Текст, в котором требуется заменить некоторые символы."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция первого символа заменяемого текста."
      },
      numBytes: {
        name: "количество_байтов",
        detail: "Указывает в байтах количество символов, которые заменяет функция REPLACEB."
      },
      newText: {
        name: "текст замены",
        detail: "Текст, который заменит символы в старом тексте."
      }
    }
  },
  REPT: {
    description: "Повторяет текст заданное количество раз",
    abstract: "Повторяет текст заданное количество раз",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/rept-function-04c4d778-e712-43b4-9c15-d656582bb061"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Повторяемый текст."
      },
      numberTimes: {
        name: "число_повторений",
        detail: "Положительное число, определяющее, сколько раз требуется повторить текст."
      }
    }
  },
  RIGHT: {
    description: "Возвращает крайние правые символы из текстового значения",
    abstract: "Возвращает крайние правые символы из текстового значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/right-rightb-functions-240267ee-9afa-4639-a02b-f19e1786cf2f"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текстовая строка, содержащая символы, которые требуется извлечь."
      },
      numChars: {
        name: "количество_знаков",
        detail: "Количество символов, извлекаемых функцией RIGHT."
      }
    }
  },
  RIGHTB: {
    description: "Возвращает крайние правые символы из текстового значения",
    abstract: "Возвращает крайние правые символы из текстового значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/right-rightb-functions-240267ee-9afa-4639-a02b-f19e1786cf2f"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текстовая строка, содержащая символы, которые требуется извлечь."
      },
      numBytes: {
        name: "количество_байтов",
        detail: "Указывает в байтах количество символов, извлекаемых функцией RIGHTB."
      }
    }
  },
  SEARCH: {
    description: "Находит одно текстовое значение внутри другого (без учета регистра)",
    abstract: "Находит одно текстовое значение внутри другого (без учета регистра)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/search-searchb-functions-9ab04538-0e55-4719-a72e-b6f54513b495"
    }],
    functionParameter: {
      findText: {
        name: "строка поиска",
        detail: "Строка, которую нужно найти в «Текст для поиска»."
      },
      withinText: {
        name: "текст для поиска",
        detail: "Первое вхождение текста для поиска «строки поиска»."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция символа, с которой начинается поиск в «тексте для поиска». Если опущено, предполагается значение 1."
      }
    }
  },
  SEARCHB: {
    description: "Находит одно текстовое значение внутри другого (без учета регистра)",
    abstract: "Находит одно текстовое значение внутри другого (без учета регистра)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/search-searchb-functions-9ab04538-0e55-4719-a72e-b6f54513b495"
    }],
    functionParameter: {
      findText: {
        name: "строка поиска",
        detail: "Строка, которую нужно найти в «Текст для поиска»."
      },
      withinText: {
        name: "текст для поиска",
        detail: "Первое вхождение текста для поиска «строки поиска»."
      },
      startNum: {
        name: "стартовая позиция",
        detail: "Позиция символа, с которой начинается поиск в «тексте для поиска». Если опущено, предполагается значение 1."
      }
    }
  },
  SUBSTITUTE: {
    description: "Заменяет новый текст на старый текст в строке текста",
    abstract: "Заменяет новый текст на старый текст в строке текста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/substitute-function-6434944e-a904-4336-a9b0-1e58df3bc332"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текст или ссылка на ячейку, содержащую текст, в котором подставляются знаки."
      },
      oldText: {
        name: "стар_текст",
        detail: "Заменяемый текст."
      },
      newText: {
        name: "нов_текст",
        detail: 'Текст, на который заменяется "стар_текст".'
      },
      instanceNum: {
        name: "номер_вхождения",
        detail: 'Определяет, какое вхождение фрагмента "стар_текст" нужно заменить фрагментом "нов_текст". Если этот аргумент определен, то заменяется только заданное вхождение фрагмента "стар_текст". В противном случае все вхождения фрагмента "стар_текст" в тексте заменяются фрагментом "нов_текст".'
      }
    }
  },
  T: {
    description: "Преобразует свои аргументы в текст",
    abstract: "Преобразует свои аргументы в текст",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/t-function-fb83aeec-45e7-4924-af95-53e073541228"
    }],
    functionParameter: { value: {
      name: "значение",
      detail: "Проверяемое значение."
    } }
  },
  TEXT: {
    description: "Форматирует число и преобразует его в текст",
    abstract: "Форматирует число и преобразует его в текст",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/text-function-20d5ac4d-7b94-49fd-bb38-93d29371225c"
    }],
    functionParameter: {
      value: {
        name: "значение",
        detail: "Числовое значение, которое вы хотите преобразовать в текст."
      },
      formatText: {
        name: "формат_текста",
        detail: "Строка текста, которая определяет форматирование, которое вы хотите применить к указанному значению."
      }
    }
  },
  TEXTAFTER: {
    description: "Возвращает текст, который находится после указанного символа или строки",
    abstract: "Возвращает текст, который находится после указанного символа или строки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/textafter-function-c8db2546-5b51-416a-9690-c7e6722e90b4"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текст, в котором производится поиск. Использовать подстановочные знаки не разрешено."
      },
      delimiter: {
        name: "разделитель",
        detail: "Текст, помечающий точку, после которой нужно извлечь текст."
      },
      instanceNum: {
        name: "номер_вхождения",
        detail: "Экземпляр разделителя, после которого вы хотите извлечь текст."
      },
      matchMode: {
        name: "шаблон соответствия",
        detail: "Определяет, учитывается ли регистр в текстовом поиске. По умолчанию регистр учитывается."
      },
      matchEnd: {
        name: "конец матча",
        detail: "Рассматривает конец текста как разделитель. По умолчанию текст является точным совпадением."
      },
      ifNotFound: {
        name: "если не найдено",
        detail: "Значение возвращается, если совпадение не найдено. По умолчанию возвращается значение #N/A."
      }
    }
  },
  TEXTBEFORE: {
    description: "Возвращает текст, который находится до указанного символа или строки",
    abstract: "Возвращает текст, который находится до указанного символа или строки",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/textbefore-function-d099c28a-dba8-448e-ac6c-f086d0fa1b29"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текст, в котором производится поиск. Использовать подстановочные знаки не разрешено."
      },
      delimiter: {
        name: "разделитель",
        detail: "Текст, помечающий точку, после которой нужно извлечь текст."
      },
      instanceNum: {
        name: "номер_вхождения",
        detail: "Экземпляр разделителя, после которого вы хотите извлечь текст."
      },
      matchMode: {
        name: "шаблон соответствия",
        detail: "Определяет, учитывается ли регистр в текстовом поиске. По умолчанию регистр учитывается."
      },
      matchEnd: {
        name: "конец матча",
        detail: "Рассматривает конец текста как разделитель. По умолчанию текст является точным совпадением."
      },
      ifNotFound: {
        name: "если не найдено",
        detail: "Значение возвращается, если совпадение не найдено. По умолчанию возвращается значение #N/A."
      }
    }
  },
  TEXTJOIN: {
    description: "Объединяет текст из нескольких диапазонов и/или строк",
    abstract: "Объединяет текст из нескольких диапазонов и/или строк",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/textjoin-function-357b449a-ec91-49d0-80c3-0e8fc845691c"
    }],
    functionParameter: {
      delimiter: {
        name: "разделитель",
        detail: "Текстовая строка (пустая или с символами в двойных кавычках) или ссылка на действительную текстовую строку."
      },
      ignoreEmpty: {
        name: "игнорировать_пустые",
        detail: "В случае значения ИСТИНА игнорирует пустые ячейки."
      },
      text1: {
        name: "текст1",
        detail: "Элемент текста, который нужно присоединить. Текстовая строка или массив строк, например диапазон ячеек."
      },
      text2: {
        name: "текст2",
        detail: "Дополнительные текстовые элементы для объединения. Для текстовых элементов можно указать до 252 аргументов, включая текст1. Каждый из них может быть текстовой строкой или массивом строк, например диапазоном ячеек."
      }
    }
  },
  TEXTSPLIT: {
    description: "Разделяет текстовые строки, используя разделители столбцов и строк",
    abstract: "Разделяет текстовые строки, используя разделители столбцов и строк",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/textsplit-function-b1ca414e-4c21-4ca0-b1b7-bdecace8a6e7"
    }],
    functionParameter: {
      text: {
        name: "текст",
        detail: "Текст, который нужно разделить."
      },
      colDelimiter: {
        name: "разделитель_столбцов",
        detail: "Текст, помечающий точку, в которой текст разлит по столбцам."
      },
      rowDelimiter: {
        name: "разделитель_строк",
        detail: "Текст, помечающий точку, в которую следует слить текст вниз по строкам."
      },
      ignoreEmpty: {
        name: "игнорировать_пустые",
        detail: "В случае значения ИСТИНА игнорирует пустые ячейки."
      },
      matchMode: {
        name: "шаблон соответствия",
        detail: "Определяет, учитывается ли регистр в текстовом поиске. По умолчанию регистр учитывается."
      },
      padWith: {
        name: "заполняющее_значение",
        detail: "Значение, которым нужно дополнить результат. Значение по умолчанию: #N/A."
      }
    }
  },
  TRIM: {
    description: "Удаляет из текста все пробелы, за исключением одиночных пробелов между словами.",
    abstract: "Удаляет пробелы из текста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/trim-function-410388fa-c5df-49c6-b16c-9e5630b479f9"
    }],
    functionParameter: { text: {
      name: "tекст",
      detail: "Текст, из которого удаляются пробелы."
    } }
  },
  UNICHAR: {
    description: "Возвращает Юникод-символ, на который ссылается заданное числовое значение",
    abstract: "Возвращает Юникод-символ, на который ссылается заданное числовое значение",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/unichar-function-ffeb64f5-f131-44c6-b332-5cd72f0659b8"
    }],
    functionParameter: { number: {
      name: "число",
      detail: "это число Юникод, которое представляет символ."
    } }
  },
  UNICODE: {
    description: "Возвращает номер (кодовый пункт), соответствующий первому символу текста",
    abstract: "Возвращает номер (кодовый пункт), соответствующий первому символу текста",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/unicode-function-adb74aaa-a2a5-4dde-aff6-966e4e81f16f"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "это символ, для которого необходимо установить значение Юникод."
    } }
  },
  UPPER: {
    description: "Преобразует текст в верхний регистр",
    abstract: "Преобразует текст в верхний регистр",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/upper-function-c11f29b3-d1a3-4537-8df6-04d0049963d6"
    }],
    functionParameter: { text: {
      name: "tекст",
      detail: "Текст, преобразуемый в верхний регистр."
    } }
  },
  VALUE: {
    description: "Преобразует текстовый аргумент в число",
    abstract: "Преобразует текстовый аргумент в число",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/value-function-257d0108-07dc-437d-ae1c-bc2d3953d8c2"
    }],
    functionParameter: { text: {
      name: "текст",
      detail: "Текст в кавычках или ссылка на ячейку, содержащую текст, который нужно преобразовать."
    } }
  },
  VALUETOTEXT: {
    description: "Возвращает текст из любого указанного значения",
    abstract: "Возвращает текст из любого указанного значения",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/valuetotext-function-5fff61a2-301a-4ab2-9ffa-0a5242a08fea"
    }],
    functionParameter: {
      value: {
        name: "значение",
        detail: "Значение, возвращаемое в виде текста."
      },
      format: {
        name: "формат",
        detail: "Формат возвращаемых данных. Это может быть одно из двух значений:\n0 По умолчанию. Краткий формат, удобный для чтения.\n1 Строгий формат, включающий escape-символы и разделители строк. Создает строку, которую можно анализировать при вводе в строку формул. Заключает возвращаемые строки в кавычки, кроме логических значений, чисел и ошибок."
      }
    }
  },
  CALL: {
    description: "Вызывает процедуру в динамической библиотеке или ресурсе кода",
    abstract: "Вызывает процедуру в динамической библиотеке или ресурсе кода",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/call-function-32d58445-e646-4ffd-8d5e-b45077a5e995"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  EUROCONVERT: {
    description: "Преобразует число в евро, преобразует число из евро в валюту страны-члена еврозоны или преобразует число из одной валюты страны-члена еврозоны в другую, используя евро в качестве промежуточного звена (триангуляция)",
    abstract: "Преобразует число в евро, преобразует число из евро в валюту страны-члена еврозоны или преобразует число из одной валюты страны-члена еврозоны в другую, используя евро в качестве промежуточного звена (триангуляция)",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/euroconvert-function-79c8fd67-c665-450c-bb6c-15fc92f8345c"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  REGISTER_ID: {
    description: "Возвращает ID регистрации указанной динамической библиотеки (DLL) или ресурса кода, который был ранее зарегистрирован",
    abstract: "Возвращает ID регистрации указанной динамической библиотеки (DLL) или ресурса кода, который был ранее зарегистрирован",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/register-id-function-f8f0af0f-fd66-4704-a0f2-87b27b175b50"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  }
};
const locale$3$1 = {};
const locale$2$1 = locale$3$1;
const locale$1$1 = {
  ENCODEURL: {
    description: "Возвращает строку, закодированную в формате URL",
    abstract: "Возвращает строку, закодированную в формате URL",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/encodeurl-function-07c7fb90-7c60-4bff-8687-fac50fe33d0e"
    }],
    functionParameter: { text: {
      name: "tекст",
      detail: "Строка для кодирования URL-адреса"
    } }
  },
  FILTERXML: {
    description: "Возвращает конкретные данные из XML-содержимого, используя указанный XPath",
    abstract: "Возвращает конкретные данные из XML-содержимого, используя указанный XPath",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/filterxml-function-4df72efc-11ec-4951-86f5-c1374812f5b7"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  },
  WEBSERVICE: {
    description: "Возвращает данные с веб-сервиса",
    abstract: "Возвращает данные с веб-сервиса",
    links: [{
      title: "Инструкция",
      url: "https://support.microsoft.com/ru-ru/office/webservice-function-0546a35a-ecc6-4739-aed7-c0b7ce1562c4"
    }],
    functionParameter: {
      number1: {
        name: "number1",
        detail: "первый"
      },
      number2: {
        name: "number2",
        detail: "второй"
      }
    }
  }
};
const locale$a = { "sheets-formula": { functionList: {
  ...locale$16,
  ...locale$15,
  ...locale$14,
  ...locale$13,
  ...locale$12,
  ...locale$11,
  ...locale$10,
  ...locale$9,
  ...locale$8,
  ...locale$7,
  ...locale$6,
  ...locale$5,
  ...locale$4,
  ...locale$2$1,
  ...locale$1$1
} } };
const locale$3 = { "sheets-formula-ui": {
  shortcut: { "quick-sum": "Быстрая сумма" },
  insert: {
    tooltip: "Функции",
    common: "Часто используемые функции"
  },
  prompt: {
    helpExample: "ПРИМЕР",
    helpAbstract: "ОПИСАНИЕ",
    required: "Обязательно.",
    optional: "Необязательно."
  },
  error: {
    title: "Ошибка",
    divByZero: "Ошибка деления на ноль",
    name: "Ошибка неверного имени",
    value: "Ошибка в значении",
    num: "Ошибка числа",
    na: "Ошибка недоступного значения",
    cycle: "Ошибка циклической ссылки",
    ref: "Ошибка неверной ссылки на ячейку",
    spill: "Диапазон разлива не пуст",
    calc: "Ошибка вычисления",
    error: "Ошибка",
    connect: "Получение данных",
    null: "Ошибка нулевого значения"
  },
  functionType: {
    financial: "Финансовые",
    date: "Дата и время",
    math: "Математика и тригонометрия",
    statistical: "Статистические",
    lookup: "Поиск и ссылки",
    database: "База данных",
    text: "Текстовые",
    logical: "Логические",
    information: "Информационные",
    engineering: "Инженерные",
    cube: "Куб",
    compatibility: "Совместимость",
    web: "Веб",
    array: "Массив",
    univer: "Универсальные",
    user: "Пользовательские",
    definedname: "Defined Name"
  },
  moreFunctions: {
    confirm: "Подтвердить",
    prev: "Предыдущий",
    next: "Следующий",
    searchFunctionPlaceholder: "Поиск функции",
    allFunctions: "Все функции",
    syntax: "СИНТАКСИС"
  },
  operation: {
    copyFormulaOnly: "Копировать только формулу",
    pasteFormula: "Вставить Формулу"
  },
  rangeSelector: {
    title: "Выберите диапазон данных",
    addAnotherRange: "Добавить диапазон",
    buttonTooltip: "Выбрать диапазон данных",
    placeHolder: "Выберите диапазон или введите.",
    confirm: "Подтвердить",
    cancel: "Отменить"
  }
} };
const locale$2 = { "sheets-numfmt-ui": {
  title: "Формат числа",
  numfmtType: "Типы форматов",
  cancel: "Отмена",
  confirm: "Подтвердить",
  general: "Общий",
  accounting: "Бухгалтерский",
  text: "Текст",
  number: "Число",
  percent: "Процент",
  scientific: "Экспоненциальный",
  currency: "Валюта",
  date: "Дата",
  time: "Время",
  thousandthPercentile: "Разделитель тысяч",
  preview: "Предпросмотр",
  dateTime: "Дата и время",
  decimalLength: "Десятичные знаки",
  currencyType: "Символ валюты",
  moreFmt: "Другие форматы",
  financialValue: "Финансовое значение",
  roundingCurrency: "Округление валюты",
  timeDuration: "Продолжительность времени",
  currencyDes: "Формат валюты используется для представления общих значений валюты. Формат бухгалтерского учета выравнивает столбец значений по десятичным точкам.",
  accountingDes: "Формат бухгалтерских чисел выравнивает столбец значений по символам валюты и десятичным точкам.",
  dateType: "Тип даты",
  dateDes: "Формат даты представляет значения времени и даты как значения даты.",
  negType: "Тип отрицательного числа",
  generalDes: "Обычный формат не содержит никакого специфического формата числа.",
  thousandthPercentileDes: "Формат процента используется для представления обычных чисел. Монетарные и бухгалтерские форматы предоставляют специальный формат для вычислений монетарных значений.",
  addDecimal: "Увеличить количество десятичных знаков",
  subtractDecimal: "Уменьшить количество десятичных знаков",
  customFormat: "Пользовательский формат",
  customFormatDes: "Генерация пользовательских числовых форматов на основе существующих форматов.",
  info: {
    error: "Ошибка",
    forceStringInfo: "Число хранится как текст"
  }
} };
const locale$1 = { "sheets-ui": {
  toolbar: {
    undo: "Отменить",
    redo: "Повторить",
    formatPainter: "Копировать формат",
    font: "Шрифт",
    fontSize: "Размер шрифта",
    fontSizeIncrease: "Увеличить размер шрифта",
    fontSizeDecrease: "Уменьшить размер шрифта",
    bold: "Жирный",
    italic: "Курсив",
    strikethrough: "Зачеркнутый",
    subscript: "Нижний индекс",
    superscript: "Верхний индекс",
    underline: "Подчеркнутый",
    textColor: {
      main: "Цвет текста",
      right: "Выбрать цвет"
    },
    resetColor: "Сбросить",
    fillColor: {
      main: "Цвет заливки",
      right: "Выбрать цвет"
    },
    border: {
      main: "Граница",
      right: "Стиль границы"
    },
    mergeCell: {
      main: "Объединить ячейки",
      right: "Выбрать тип объединения"
    },
    horizontalAlignMode: {
      main: "Горизонтальное выравнивание",
      right: "Выравнивание"
    },
    verticalAlignMode: {
      main: "Вертикальное выравнивание",
      right: "Выравнивание"
    },
    textWrapMode: {
      main: "Перенос текста",
      right: "Режим переноса текста"
    },
    textRotateMode: {
      main: "Поворот текста",
      right: "Режим поворота текста"
    },
    more: "Больше",
    toggleGridlines: "Переключить сетку",
    textToNumber: "Преобразовать текст в число"
  },
  align: {
    left: "Лево",
    center: "Центр",
    right: "Право",
    top: "Верх",
    middle: "Середина",
    bottom: "Низ"
  },
  button: {
    confirm: "ОК",
    cancel: "Отмена",
    close: "Закрыть",
    insert: "Вставить",
    prevPage: "Предыдущая",
    nextPage: "Следующая",
    total: "всего:"
  },
  borderLine: {
    borderTop: "верхняя граница",
    borderBottom: "нижняя граница",
    borderLeft: "левая граница",
    borderRight: "правая граница",
    borderNone: "без границы",
    borderAll: "все границы",
    borderOutside: "внешняя граница",
    borderInside: "внутренняя граница",
    borderHorizontal: "горизонтальная граница",
    borderVertical: "вертикальная граница",
    borderColor: "цвет границы",
    borderSize: "размер границы",
    borderType: "тип границы"
  },
  merge: {
    all: "Объединить все",
    vertical: "Вертикальное объединение",
    horizontal: "Горизонтальное объединение",
    cancel: "Отменить объединение",
    overlappingError: "Невозможно объединить перекрывающиеся области",
    partiallyError: "Невозможно выполнить эту операцию на частично объединенных ячейках"
  },
  filter: {},
  textWrap: {
    overflow: "Переполнение",
    wrap: "Перенос",
    clip: "Обрезать"
  },
  textRotate: {
    none: "Нет",
    angleUp: "Повернуть вверх",
    angleDown: "Повернуть вниз",
    vertical: "Вертикально",
    rotationUp: "Поворот вверх",
    rotationDown: "Поворот вниз"
  },
  sheetConfig: {
    delete: "Удалить",
    copy: "Копировать",
    rename: "Переименовать",
    changeColor: "Изменить цвет",
    hide: "Скрыть",
    unhide: "Показать",
    moveLeft: "Переместить влево",
    moveRight: "Переместить вправо",
    resetColor: "Сбросить цвет",
    cancelText: "Отмена",
    chooseText: "Подтвердить цвет",
    tipNameRepeat: "Имя вкладки не может повторяться! Пожалуйста, исправьте",
    noMoreSheet: "В книге должен содержаться хотя бы один видимый лист. Чтобы удалить выбранный лист, вставьте новый лист или покажите скрытый лист.",
    confirmDelete: "Вы уверены, что хотите удалить",
    redoDelete: "Можно отменить с помощью Ctrl+Z",
    noHide: "Нельзя скрыть, оставьте хотя бы одну вкладку листа",
    chartEditNoOpt: "Эта операция недоступна в режиме редактирования диаграммы!",
    sheetNameErrorTitle: "Произошла ошибка",
    sheetNameSpecCharError: "Имя не может превышать 31 символов, начало и конец имени не могут быть ' и имя не может содержать: [ ] : \\ ? * /",
    sheetNameCannotIsEmptyError: "Имя листа не может быть пустым.",
    sheetNameAlreadyExistsError: "Имя листа уже существует. Пожалуйста, введите другое имя.",
    deleteSheet: "Удалить лист",
    deleteSheetContent: "Подтвердите удаление этого листа?",
    deleteLargeSheetContent: "Подтвердите удаление этого листа. После удаления его нельзя будет восстановить. Вы уверены, что хотите удалить его?",
    addProtectSheet: "Защитить лист",
    removeProtectSheet: "Снять защиту листа",
    changeSheetPermission: "Изменить разрешения листа",
    viewAllProtectArea: "Просмотреть все защищенные области"
  },
  rightClick: {
    copy: "Копировать",
    cut: "Вырезать",
    paste: "Вставить",
    copySpecial: "Выборочная копия",
    pasteSpecial: "Специальная вставка",
    pasteValue: "Вставить значение",
    pasteFormat: "Вставить формат",
    pasteColWidth: "Вставить ширину столбца",
    pasteBesidesBorder: "Вставить кроме стилей границы",
    insert: "Вставить",
    insertRow: "Вставить строку",
    insertRowBefore: "Вставить строку выше",
    insertRowsAfter: "Вставить",
    insertRowsAbove: "Вставить",
    insertRowsAfterSuffix: "строк после",
    insertRowsAboveSuffix: "строк выше",
    insertColumn: "Вставить столбец",
    insertColumnBefore: "Вставить столбец слева",
    insertColsLeft: "Вставить",
    insertColsRight: "Вставить",
    insertColsLeftSuffix: "столбцов слева",
    insertColsRightSuffix: "столбцов справа",
    delete: "Удалить",
    deleteCell: "Удалить ячейку",
    insertCell: "Вставить ячейку",
    deleteSelected: "Удалить выбранное",
    hide: "Скрыть",
    hideSelected: "Скрыть выбранное",
    showHide: "Показать скрытые",
    toTopAdd: "Добавить сверху",
    toBottomAdd: "Добавить снизу",
    toLeftAdd: "Добавить слева",
    toRightAdd: "Добавить справа",
    deleteSelectedRow: "Удалить выбранную строку",
    deleteSelectedColumn: "Удалить выбранный столбец",
    hideSelectedRow: "Скрыть выбранную строку",
    showHideRow: "Показать скрытую строку",
    rowHeight: "Высота строки",
    hideSelectedColumn: "Скрыть выбранный столбец",
    showHideColumn: "Показать скрытый столбец",
    columnWidth: "Ширина столбца",
    moveLeft: "Переместить влево",
    moveUp: "Переместить вверх",
    moveRight: "Переместить вправо",
    moveDown: "Переместить вниз",
    add: "Добавить",
    row: "Строка",
    column: "Столбец",
    confirm: "Подтвердить",
    clearSelection: "Очистить",
    clearContent: "Очистить содержимое",
    clearFormat: "Очистить формат",
    clearAll: "Очистить все",
    root: "Корень",
    log: "Логарифм",
    delete0: "Удалить значения 0 с обоих концов",
    removeDuplicate: "Удалить дубликаты значений",
    byRow: "По строке",
    byCol: "По столбцу",
    generateNewMatrix: "Создать новую матрицу",
    fitContent: "Подогнать под данные",
    freeze: "Закрепить",
    freezeCell: "Закрепить до активной ячейки ({0} строка {1} столбец)",
    freezeCol: "Закрепить до {0} столбца",
    freezeRow: "Закрепить до {0} строки",
    freezeFirstCol: "Закрепить первый столбец",
    freezeFirstRow: "Закрепить первую строку",
    cancelFreeze: "Отменить закрепление",
    deleteAllRowsAlert: "Нельзя удалить все строки на листе",
    deleteAllColumnsAlert: "Нельзя удалить все столбцы на листе",
    hideAllRowsAlert: "Нельзя скрыть все строки на листе",
    hideAllColumnsAlert: "Нельзя скрыть все столбцы на листе",
    protectRange: "Защитить диапазон",
    editProtectRange: "Редактировать защищенный диапазон",
    removeProtectRange: "Удалить защиту диапазона",
    turnOnProtectRange: "Включить защиту диапазона",
    viewAllProtectArea: "Просмотреть все защищенные области",
    textToNumber: "Преобразовать текст в число"
  },
  info: {
    notChangeMerge: "Вы не можете частично изменить объединенные ячейки",
    detailUpdate: "Новый открытый",
    detailSave: "Восстановлено из локального кэша",
    row: "",
    column: "",
    loading: "Загрузка...",
    copy: "Копировать",
    return: "Выход",
    rename: "Переименовать",
    tips: "Переименовать",
    noName: "Электронная таблица без названия",
    wait: "ожидание обновления",
    add: "Добавить",
    addLast: "больше строк внизу",
    backTop: "Вернуться наверх",
    nextPage: "Следующая",
    tipInputNumber: "Пожалуйста, введите число",
    tipInputNumberLimit: "Диапазон увеличения ограничен от 1 до 100",
    tipRowHeightLimit: "Высота строки должна быть в пределах от 0 до 545",
    tipColumnWidthLimit: "Ширина столбца должна быть в пределах от 0 до 2038",
    problem: "Произошла проблема"
  },
  clipboard: {
    paste: {
      exceedMaxCells: "Количество вставляемых ячеек превышает максимальное количество ячеек",
      overlappingMergedCells: "Область вставки перекрывается с объединенными ячейками"
    },
    shortCutNotify: {
      title: "Используйте сочетания клавиш для вставки.",
      useShortCutInstead: "Обнаружено содержимое Excel. Используйте сочетание клавиш для вставки."
    }
  },
  statusbar: {
    sum: "Сумма",
    average: "Среднее",
    min: "Минимум",
    max: "Максимум",
    count: "Числовое количество",
    countA: "Количество",
    clickToCopy: "Нажмите, чтобы скопировать",
    copied: "Скопировано"
  },
  shortcut: {
    "sheet-view": "Sheet View",
    "sheet-edit": "Sheet Edit",
    sheet: {
      "zoom-in": "Увеличить",
      "zoom-out": "Уменьшить",
      "reset-zoom": "Сбросить масштаб",
      "select-below-cell": "Выбрать ячейку ниже",
      "select-up-cell": "Выбрать ячейку выше",
      "select-left-cell": "Выбрать ячейку слева",
      "select-right-cell": "Выбрать ячейку справа",
      "select-next-cell": "Выбрать следующую ячейку",
      "select-previous-cell": "Выбрать предыдущую ячейку",
      "select-up-value-cell": "Выбрать ячейку выше со значением",
      "select-below-value-cell": "Выбрать ячейку ниже со значением",
      "select-left-value-cell": "Выбрать ячейку слева со значением",
      "select-right-value-cell": "Выбрать ячейку справа со значением",
      "expand-selection-down": "Расширить выделение вниз",
      "expand-selection-up": "Расширить выделение вверх",
      "expand-selection-left": "Расширить выделение влево",
      "expand-selection-right": "Расширить выделение вправо",
      "expand-selection-to-left-gap": "Расширить выделение до левого пробела",
      "expand-selection-to-below-gap": "Расширить выделение до нижнего пробела",
      "expand-selection-to-right-gap": "Расширить выделение до правого пробела",
      "expand-selection-to-up-gap": "Расширить выделение до верхнего пробела",
      "select-all": "Выбрать все",
      "toggle-editing": "Переключить редактирование",
      "delete-and-start-editing": "Очистить и начать редактирование",
      "abort-editing": "Прервать редактирование",
      "break-line": "Разрыв строки",
      "set-bold": "Переключить жирный",
      "start-editing": "Начать редактирование",
      "repeat-last-action": "Повторить последнее действие",
      "set-italic": "Переключить курсив",
      "set-underline": "Переключить подчеркивание",
      "set-strike-through": "Переключить зачеркивание"
    }
  },
  definedName: {
    managerTitle: "Управление именами",
    managerDescription: "Создайте определенное имя, выбрав ячейки или формулы и введя желаемое имя в текстовое поле.",
    addButton: "Добавить определенное имя",
    featureTitle: "Определенные имена",
    ratioRange: "Диапазон",
    ratioFormula: "Формула",
    confirm: "Подтвердить",
    cancel: "Отмена",
    scopeWorkbook: "Книга",
    inputNamePlaceholder: "Введите имя (без пробелов)",
    inputCommentPlaceholder: "Введите комментарий",
    inputRangePlaceholder: "Введите диапазон (без пробелов)",
    inputFormulaPlaceholder: "Введите формулу (без пробелов)",
    formulaOrRefStringInvalid: "Неверная формула или строка ссылки",
    defaultName: "ОпределенноеИмя",
    updateButton: "Обновить",
    deleteButton: "Удалить",
    deleteConfirmText: "Вы уверены, что хотите удалить это определенное имя?"
  },
  uploadLoading: { loading: "Загрузка..." },
  "data-validation": {
    alert: { ok: "ОК" },
    list: {
      edit: "Редактировать",
      dropdown: "Выберите элемент"
    },
    listMultiple: { dropdown: "Выберите элементы" }
  },
  permission: {
    toolbarMenu: "Защита",
    panel: {
      title: "Защита строк и столбцов",
      name: "Имя",
      protectedRange: "Защищенный диапазон",
      permissionDirection: "Описание разрешения",
      permissionDirectionPlaceholder: "Введите описание разрешения",
      editPermission: "Редактировать разрешения",
      onlyICanEdit: "Только я могу редактировать",
      designedUserCanEdit: "Назначенные пользователи могут редактировать",
      viewPermission: "Просмотр разрешений",
      othersCanView: "Другие могут просматривать",
      noOneElseCanView: "Никто другой не может просматривать",
      designedPerson: "Назначенные лица",
      addPerson: "Добавить человека",
      canEdit: "Может редактировать",
      canView: "Может просматривать",
      delete: "Удалить",
      currentSheet: "Текущий лист",
      allSheet: "Все листы",
      edit: "Редактировать",
      Print: "Печать",
      Comment: "Комментировать",
      Copy: "Копировать",
      SetCellStyle: "Установить стиль ячейки",
      SetCellValue: "Установить значение ячейки",
      SetHyperLink: "Установить гиперссылку",
      Sort: "Сортировать",
      Filter: "Фильтровать",
      PivotTable: "Сводная таблица",
      FloatImage: "Плавающее изображение",
      RowHeightColWidth: "Высота строки и ширина столбца",
      RowHeightColWidthReadonly: "Только для чтения высота строки и ширина столбца",
      FilterReadonly: "Только для чтения фильтр",
      nameError: "Имя не может быть пустым",
      created: "Создано",
      iCanEdit: "Я могу редактировать",
      iCanNotEdit: "Я не могу редактировать",
      iCanView: "Я могу просматривать",
      iCanNotView: "Я не могу просматривать",
      emptyRangeError: "Диапазон не может быть пустым",
      rangeOverlapError: "Диапазон не может пересекаться",
      rangeOverlapOverPermissionError: "Диапазон не может пересекаться с диапазоном, имеющим те же разрешения",
      InsertHyperlink: "Вставить гиперссылку",
      SetRowStyle: "Установить стиль строки",
      SetColumnStyle: "Установить стиль столбца",
      InsertColumn: "Вставить столбец",
      InsertRow: "Вставить строку",
      DeleteRow: "Удалить строку",
      DeleteColumn: "Удалить столбец",
      EditExtraObject: "Редактировать дополнительный объект"
    },
    dialog: {
      allowUserToEdit: "Разрешить пользователю редактировать",
      allowedPermissionType: "Допустимые типы разрешений",
      setCellValue: "Установить значение ячейки",
      setCellStyle: "Установить стиль ячейки",
      copy: "Копировать",
      alert: "Предупреждение",
      search: "Поиск",
      ownerInherit: "Владелец документа, включено наследование разрешений",
      ownerWithoutInherit: "Владелец документа, не включено наследование разрешений",
      alertContent: "Этот диапазон защищен и в настоящее время недоступен для редактирования. Если вам нужно редактировать, пожалуйста, свяжитесь с создателем.",
      userEmpty: "нет назначенных лиц, поделитесь ссылкой, чтобы пригласить конкретных людей.",
      listEmpty: "Вы не установили ни одного защищенного диапазона или листа.",
      commonErr: "Диапазон защищен, и у вас нет разрешения на выполнение этой операции. Для редактирования свяжитесь с создателем.",
      editErr: "Диапазон защищен, и у вас нет разрешения на редактирование. Для редактирования свяжитесь с создателем.",
      pasteErr: "Диапазон защищен, и у вас нет разрешения на вставку. Для вставки свяжитесь с создателем.",
      setStyleErr: "Диапазон защищен, и у вас нет разрешения на установку стилей. Для установки стилей свяжитесь с создателем.",
      copyErr: "Диапазон защищен, и у вас нет разрешения на копирование. Для копирования свяжитесь с создателем.",
      workbookCopyErr: "Лист защищен, и у вас нет разрешения на копирование. Для копирования свяжитесь с создателем.",
      setRowColStyleErr: "Диапазон защищен, и у вас нет разрешения на установку стилей строк и столбцов. Для установки стилей строк и столбцов свяжитесь с создателем.",
      moveRowColErr: "Диапазон защищен, и у вас нет разрешения на перемещение строк и столбцов. Для перемещения строк и столбцов свяжитесь с создателем.",
      moveRangeErr: "Диапазон защищен, и у вас нет разрешения на перемещение выделения. Для перемещения выделения свяжитесь с создателем.",
      insertRowColErr: "Диапазон защищен, и у вас нет разрешения на вставку строк и столбцов. Для вставки строк и столбцов свяжитесь с создателем.",
      removeRowColErr: "Диапазон защищен, и у вас нет разрешения на удаление строк и столбцов. Для удаления строк и столбцов свяжитесь с создателем.",
      autoFillErr: "Диапазон защищен, и у вас нет разрешения на автозаполнение. Для использования автозаполнения свяжитесь с создателем.",
      filterErr: "Диапазон защищен, и у вас нет разрешения на фильтрацию. Для фильтрации свяжитесь с создателем.",
      operatorSheetErr: "Лист защищен, и у вас нет разрешения на операции с листом. Для операций с листом свяжитесь с создателем.",
      insertOrDeleteMoveRangeErr: "Вставленный или удаленный диапазон пересекается с защищенным диапазоном, и эта операция в настоящее время не поддерживается.",
      printErr: "Лист защищен, и у вас нет разрешения на печать. Для печати свяжитесь с создателем.",
      formulaErr: "Диапазон или ссылочный диапазон защищен, и у вас нет разрешения на редактирование. Для редактирования свяжитесь с создателем.",
      hyperLinkErr: "Диапазон защищен, и у вас нет разрешения на установку гиперссылок. Для установки гиперссылок свяжитесь с создателем.",
      commentErr: "Диапазон защищен, и у вас нет разрешения на комментирование. Для комментирования свяжитесь с создателем."
    },
    button: {
      confirm: "Подтвердить",
      cancel: "Отменить",
      addNewPermission: "Добавить новое разрешение"
    }
  }
} };
const locale = { ui: {
  toolbar: { heading: {
    normal: "Обычный текст",
    title: "Заголовок",
    subTitle: "Подзаголовок",
    1: "Заголовок 1",
    2: "Заголовок 2",
    3: "Заголовок 3",
    4: "Заголовок 4",
    5: "Заголовок 5",
    6: "Заголовок 6",
    tooltip: "Установить заголовок"
  } },
  ribbon: {
    start: "Начало",
    startDesc: "Инициализация рабочей таблицы и установка основных параметров.",
    insert: "Вставка",
    insertDesc: "Вставка строк, столбцов, графиков и различных других элементов.",
    formulas: "Формулы",
    formulasDesc: "Использование функций и формул для вычислений данных.",
    data: "Данные",
    dataDesc: "Управление данными, включая импорт, сортировку и фильтрацию.",
    view: "Вид",
    viewDesc: "Смена режимов отображения и настройка эффекта отображения.",
    others: "Другие",
    othersDesc: "Другие функции и настройки.",
    more: "Больше"
  },
  fontFamily: {
    "not-supported": "В системе не найден такой шрифт, используется шрифт по умолчанию.",
    arial: "Arial",
    "times-new-roman": "Times New Roman",
    tahoma: "Tahoma",
    verdana: "Verdana",
    "microsoft-yahei": "Microsoft YaHei",
    simsun: "SimSun",
    simhei: "SimHei",
    kaiti: "Kaiti",
    fangsong: "FangSong",
    nsimsun: "NSimSun",
    stxinwei: "STXinwei",
    stxingkai: "STXingkai",
    stliti: "STLiti"
  },
  "shortcut-panel": { title: "Сочетания клавиш" },
  shortcut: {
    undo: "Отменить",
    redo: "Повторить",
    cut: "Вырезать",
    copy: "Копировать",
    paste: "Вставить",
    "shortcut-panel": "Переключить панель сочетания клавиш"
  },
  "common-edit": "Общие команды редактирования",
  "toggle-shortcut-panel": "Переключить панель сочетания клавиш",
  clipboard: { authentication: {
    title: "Доступ запрещен",
    content: "Пожалуйста, разрешите Univer доступ к вашему буферу обмена."
  } },
  textEditor: {
    formulaError: "Пожалуйста, введите корректную формулу, например =SUM(A1)",
    rangeError: "Пожалуйста, введите корректный диапазон, например A1:B10"
  },
  rangeSelector: {
    title: "Выберите диапазон данных",
    addAnotherRange: "Добавить диапазон",
    buttonTooltip: "Выбрать диапазон данных",
    placeHolder: "Выберите диапазон или введите.",
    confirm: "Подтвердить",
    cancel: "Отменить"
  },
  "global-shortcut": "Сочетания клавиш",
  "zoom-slider": { resetTo: "Сбросить до" },
  row: "Строка",
  column: "Столбец"
} };
const g = mergeLocales(
  locale$d,
  locale$c,
  locale$b,
  locale$a,
  locale$3,
  locale$2,
  locale$1,
  locale
);
export {
  g as default
};
