import { m as mergeLocales } from "./index-OqF_uRM0.js";
const locale = { "sheets-sort-ui": {
  general: {
    sort: "Сортировка",
    "sort-asc": "По возрастанию",
    "sort-desc": "По убыванию",
    "sort-custom": "Пользовательская сортировка",
    "sort-asc-ext": "Расширенная сортировка по возрастанию",
    "sort-desc-ext": "Расширенная сортировка по убыванию",
    "sort-asc-cur": "По возрастанию",
    "sort-desc-cur": "По убыванию"
  },
  error: {
    "merge-size": "Выбранный диапазон содержит объединенные ячейки разного размера, которые нельзя отсортировать.",
    empty: "Выбранный диапазон не содержит данных и не может быть отсортирован.",
    single: "Выбранный диапазон содержит только одну строку и не может быть отсортирован.",
    "formula-array": "Выбранный диапазон содержит массив формул и не может быть отсортирован."
  },
  dialog: {
    "sort-reminder": "Напоминание о сортировке",
    "sort-reminder-desc": "Расширить сортировку диапазона или оставить сортировку диапазона?",
    "sort-reminder-ext": "Расширить сортировку диапазона",
    "sort-reminder-no": "Оставить сортировку диапазона",
    "first-row-check": "Первая строка контента не участвует в сортировке",
    "add-condition": "Добавить условие",
    cancel: "Отмена",
    confirm: "Подтвердить"
  },
  info: { tooltip: "Подсказка" }
} };
const t = mergeLocales(
  locale
);
export {
  t as default
};
