<!DOCTYPE html>
<html lang="zh-CN">
<head>    
    <#include "../common/header_meta.ftl" />

</head>
<body>

    <article class="_2rhmJa">
        <p>微语·隐私策略</p>
        <p>北京微语天下科技有限公司</p>
        <p>本页为微语隐私策略网址</p>
        <p>本应用尊重并保护所有使用服务用户的个人隐私权。为了给您提供更准确、更有个性化的服务，本应用会按照本隐私权政策的规定使用和披露您的个人信息。但本应用将以高度的勤勉、审慎义务对待这些信息。除本隐私权政策另有规定外，在未征得您事先许可的情况下，本应用不会将这些信息对外披露或向第三方提供。本应用会不时更新本隐私权政策。
            您在同意本应用服务使用协议之时，即视为您已经同意本隐私权政策全部内容。本隐私权政策属于本应用服务使用协议不可分割的一部分。严禁使用本平台从事违法犯罪活动。</p>
        <p>1. 适用范围</p>
        <p>(a) 在您使用本应用网络服务，或访问本应用平台网页时，本应用自动接收并记录的您的浏览器和计算机上的信息，包括但不限于您的IP地址、浏览器的类型、使用的语言、访问日期和时间、软硬件特征信息及您需求的网页记录等数据；
        </p>
        <p>您了解并同意，以下信息不适用本隐私权政策：</p>
        <p>(a) 本应用收集到的您在本应用发布的有关信息数据，包括但不限于参与活动、成交信息及评价详情；</p>
        <p>(b) 违反法律规定或违反本应用规则行为及本应用已对您采取的措施。</p>
        <p>2. 信息使用</p>
        <p>(a)本应用不会向任何无关第三方提供、出售、出租、分享或交易您的个人信息，除非事先得到您的许可，或该第三方和本应用（含本应用关联公司）单独或共同为您提供服务，且在该服务结束后，其将被禁止访问包括其以前能够访问的所有这些资料。
        </p>
        <p>(b) 本应用亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播您的个人信息。任何本应用平台用户如从事上述活动，一经发现，本应用有权立即终止与该用户的服务协议。</p>
        <p>3. 信息披露</p>
        <p>在如下情况下，本应用将依据您的个人意愿或法律的规定全部或部分的披露您的个人信息：</p>
        <p>(a) 经您事先同意，向第三方披露；</p>
        <p>(b)为提供您所要求的产品和服务，而必须和第三方分享您的个人信息；</p>
        <p>(c) 根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
        <p>(d) 如您出现违反中国有关法律、法规或者本应用服务协议或相关规则的情况，需要向第三方披露；</p>
        <p>(e) 如您是适格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
        <p>(f) 在本应用平台上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，本应用有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。</p>
        <p>(g) 其它本应用根据法律、法规或者网站政策认为合适的披露。</p>
        <p>4. 信息存储和交换</p>
        <p>本应用收集的有关您的信息和资料将保存在本应用及（或）其关联公司的服务器上，这些信息和资料可能传送至您所在国家、地区或本应用收集信息和资料所在地的境外并在境外被访问、存储和展示。</p>
        <p>5. Cookie的使用</p>
        <p>(a) 在您未拒绝接受cookies的情况下，本应用会在您的计算机上设定或取用cookies
            ，以便您能登录或使用依赖于cookies的本应用平台服务或功能。本应用使用cookies可为您提供更加周到的个性化服务，包括推广服务。</p>
        <p>(b) 您有权选择接受或拒绝接受cookies。您可以通过修改浏览器设置的方式拒绝接受cookies。但如果您选择拒绝接受cookies，则您可能无法登录或使用依赖于cookies的本应用网络服务或功能。</p>
        <p>(c) 通过本应用所设cookies所取得的有关信息，将适用本政策。</p>
        <p>6. 信息安全</p>
        <p>(a) 本应用帐号均有安全保护功能，请妥善保管您的用户名及密码信息。本应用将通过对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您注意在信息网络上不存在“完善的安全措施”。
        </p>
        <p>(b) 在使用本应用网络服务进行网上交易时，您不可避免的要向交易对方或潜在的交易对</p>
        <p>7.本隐私政策的更改</p>
        <p>(a)如果决定更改隐私政策，我们会在本政策中、本公司网站中以及我们认为适当的位置发布这些更改，以便您了解我们如何收集、使用您的个人信息，哪些人可以访问这些信息，以及在什么情况下我们会透露这些信息。</p>
        <p>(b)本公司保留随时修改本政策的权利，因此请经常查看。如对本政策作出重大更改，本公司会通过网站通知的形式告知。</p>
        <p>请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息泄密，尤其是本应用用户名及密码发生泄露，请您立即联络本应用客服，以便本应用采取相应措施。</p>
    </article>

    <article class="_2rhmJa">
        <h2>用户协议</h2>
        <p class="about-desc">
            尊敬的用户，欢迎使用由北京微语天下科技有限公司（下列简称为“微语天下”或“微语”）提供的服务。在使用前请您阅读如下服务协议，使用本应用即表示您同意接受本协议，本协议产生法律效力，特别涉及免除或者限制微语天下责任的条款，请仔细阅读。如有任何问题，可向微语天下咨询。
        </p>
        <dl>
            <dt>1. 服务条款的确认和接受</dt>
            <dd>通过访问或使用本应用，表示用户同意接受本协议的所有条件和条款。</dd>
        </dl>
        <dl>
            <dt>2. 服务条款的变更和修改</dt>
            <dd>微语天下有权在必要时修改服务条款，服务条款一旦发生变更，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以放弃获得的本应用信息服务。如果用户继续享用本应用的信息服务，则视为接受服务条款的变更。本应用保留随时修改或中断服务而不需要通知用户的权利。本应用行使修改或中断服务的权利，不需对用户或第三方负责。
            </dd>
        </dl>
        <dl>
            <dt>3. 用户行为</dt>
            <dt class="secend-dt">3.1 用户账号、密码和安全</dt>
            <dd>用户一旦注册成功，便成为微语的合法用户，将得到一个密码和帐号。同时，此账号密码可登录微语的所有网页和APP。因此用户应采取合理措施维护其密码和帐号的安全。用户对利用该密码和帐号所进行的一切活动负全部责任；由该等活动所导致的任何损失或损害由用户承担，微语天下不承担任何责任。
                用户的密码和帐号遭到未授权的使用或发生其他任何安全问题，用户可以立即通知微语天下，并且用户在每次连线结束，应结束帐号使用，否则用户可能得不到微语天下的安全保护。对于用户长时间未使用的帐号，微语天下有权予以关闭并注销其内容。
        
            </dd>
        </dl>
        <dl>
            <dt class="secend-dt">3.2 账号注册时的禁止行为</dt>
            <dd>（1）请勿以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；</dd>
            <dd>（2）冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关的名称；</dd>
            <dd>（3）请勿注册和其他网友之名相近、相仿的名字；</dd>
            <dd>（4）请勿注册不文明、不健康名字，或包含歧视、侮辱、猥亵类词语的名字；</dd>
            <dd>（5）请勿注册易产生歧义、引起他人误解的名字；</dd>
        </dl>
        <dl>
            <dt class="secend-dt">3.3 用户在本应用上不得发布下列违法信息和照片：</dt>
            <dd>（1）反对宪法所确定的基本原则的；</dd>
            <dd>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</dd>
            <dd>（3）损害国家荣誉和利益的；</dd>
            <dd>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</dd>
            <dd>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</dd>
            <dd>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</dd>
            <dd>（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</dd>
            <dd>（8）侮辱或者诽谤他人，侵害他人合法权益的；</dd>
            <dd>（9）含有法律、行政法规禁止的其他内容的；</dd>
            <dd>（10）禁止骚扰、毁谤、威胁、仿冒网站其他用户；</dd>
            <dd>（11）严禁煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；</dd>
            <dd>（12）严禁发布可能会妨害第三方权益的文件或者信息，例如（包括但不限于）：病毒代码、黑客程序、软件破解注册信息。</dd>
            <dd>（13）禁止上传他人作品。其中包括你从互联网上下载、截图或收集的他人的作品；</dd>
            <dd>（14）禁止上传广告、横幅、标志等网络图片；</dd>
        </dl>
        <dl>
            <dt>4. 上传或发布的内容</dt>
            <dd>用户上传的内容是指用户在微语上传或发布的视频或其它任何形式的内容包括文字、图片、音频等。除非微语天下收到相关通知，否则微语天下将用户视为其在本应用上传或发布的内容的版权拥有人。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。严禁虚假宣传、虚构原价、价格欺诈、招考舞弊、违规收费、卷款跑路等违法违规行为。微语天下不承担任何法律及连带责任。
            </dd>
        </dl>
        <dl>
            <dd>对于经由本应用而传送的内容，微语天下不保证前述其合法性、正当性、准确性、完整性或品质。用户在使用本应用时，有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，微语天下均不对任何内容承担任何责任，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。微语天下有权（但无义务）自行拒绝或删除经由本应用提供的任何内容。
            </dd>
        </dl>
        <dl>
            <dd>个人或单位如认为微语天下存在侵犯自身合法权益的内容，应准备好具有法律效应的证明材料，及时与微语天下取得联系，以便微语天下迅速作出处理。</dd>
        </dl>
        <h2>隐私条款</h2>
        <dl>
            <dt>1.用户信息公开情况说明</dt>
            <dd>尊重用户个人隐私是微语天下的一项基本政策。所以，微语天下不会在未经合法用户授权时公开、编辑或透露其注册资料及保存在本应用中的非公开内容，除非有下列情况：</dd>
            <dd>（1）有关法律规定或微语天下合法服务程序规定；</dd>
            <dd>（2）在紧急情况下，为维护用户及公众的权益；</dd>
            <dd>（3）为维护微语天下的商标权、专利权及其他任何合法权益；</dd>
            <dd>（4）其他需要公开、编辑或透露个人信息的情况；</dd>
        </dl>
        <dl>
            <dd>在以下（包括但不限于）几种情况下，微语天下有权使用用户的个人信息：</dd>
            <dd>（1）在进行促销或抽奖时，微语天下可能会与赞助商共享用户的个人信息，在这些情况下微语天下会在发送用户信息之前进行提示，并且用户可以通过不参与来终止传送过程；</dd>
            <dd>（2）微语天下可以将用户信息与第三方数据匹配；</dd>
            <dd>（3）微语天下会通过透露合计用户统计数据，向未来的合作伙伴、广告商及其他第三方以及为了其他合法目的而描述微语天下的服务；</dd>
        </dl>
        <dl>
            <dt>2.隐私权政策适用范围</dt>
            <dd>（1）用户在登录本应用服务器时留下的个人身份信息；</dd>
            <dd>（2）用户通过本应用服务器与其他用户或非用户之间传送的各种资讯；</dd>
            <dd>（3）本应用与商业伙伴共享的其他用户或非用户的各种信息；</dd>
        </dl>
        <dl>
            <dt>3.资讯公开与共享</dt>
            <dd>微语天下不会将用户的个人信息和资讯故意透露、出租或出售给任何第三方。但以下情况除外：</dd>
            <dd>（1）用户本人同意与第三方共享信息和资讯;</dd>
            <dd>（2）只有透露用户的个人信息和资讯，才能提供用户所要求的某种产品和服务;</dd>
            <dd>（3）应代表本应用提供产品或服务的主体的要求提供（除非我们另行通知，否则该等主体无权将相关用户个人信息和资讯用于提供产品和服务之外的其他用途）：根据法律法规或行政命令的要求提供;因外部审计需要而提供;用户违反了本应用服务条款或任何其他产品及服务的使用规定;经本站评估，用户的帐户存在风险，需要加以保护。
            </dd>
        </dl>
        <dl>
            <dt>4.Cookies、日志档案和webbeacon</dt>
            <dd>通过使用cookies，本应用向用户提供简单易行并富个性化的网络体验。cookies能帮助我们确定用户连接的页面和内容，并将该等信息储存。我们使用自己的cookies和webbeacon，用于以下用途：</dd>
            <dd>（1）记住用户身份。例如：cookies和webbeacon有助于我们辨认用户作为我们的注册用户的身份，或保存用户向我们提供有关用户的喜好或其他信息； </dd>
            <dd>（2）分析用户使用我们服务的情况。我们可利用cookies和webbeacon来了解用户使用我们的服务进行什么活动、或哪些网页或服务最受欢迎；
                我们为上述目的使用cookies和webbeacon的同时，可能将通过cookies和webbeacon收集的非个人身份信息汇总提供给广告商和其他伙伴，用于分析您和其他用户如何使用我们的服务并用于广告服务。用户可以通过浏览器或用户选择机制拒绝或管理cookies或webbeacon。但请用户注意，如果用户停用cookies或webbeacon，我们有可能无法为您提供最佳的服务体验，某些服务也可能无法正常使用。
            </dd>
            <dd>（3）当你使用本站的服务时，我们的主机会自动记录用户的浏览器在访问网站时所发送的信息和资讯。主机日志资讯包括但不限于用户的网路请求、IP地址、浏览器类型、浏览器使用的语言、请求的日期和时间，以及一个或多个可以对用户的浏览器进行辨识的cookie。
            </dd>
        </dl>
        <dl>
            <dt>5.账户删除申请</dt>
            <dd>用户有权在任何时候编辑用户在微语天下的帐户信息和资讯，用户也可以填写相关申请表格，要求删除个人帐户，但是用户无条件同意在你的帐户删除后，该帐户内及与该帐户相关的信息和资讯仍然保留在本网站档案记录中，除上述第三条规定的情况外，微语天下将为用户保密。
            </dd>
        </dl>
    </article>

    <script
        type="text/javascript">document.write(unescape("%3Cspan id='cnzz_stat_icon_1279686124'%3E%3C/span%3E%3Cscript src='https://s4.cnzz.com/stat.php%3Fid%3D1279686124%26show%3Dpic1' type='text/javascript'%3E%3C/script%3E"));</script>

    <#--  网站统计代码  -->
    <#include "../common/track.ftl"/>

</body>
</html>